[Killed] BlockStatement
src/combat.ts:25:12
   _opponentBattlefield: Battlefield,
   targetColumn: number,
   columns = 4,
-): boolean {
-  if (targetColumn < 0 || targetColumn >= columns) return false;
-  return true;
-}
+): boolean {}
 
 /**
killedBy: isValidTarget with columns validates columns 0-2 for 3-column grid
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/combat.ts:26:27
   targetColumn: number,
   columns = 4,
 ): boolean {
-  if (targetColumn < 0 || targetColumn >= columns) return false;
+  if (targetColumn < 0 || targetColumn > columns) return false;
   return true;
 }
killedBy: isValidTarget with columns validates columns 0-2 for 3-column grid
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/combat.ts:26:7
   targetColumn: number,
   columns = 4,
 ): boolean {
-  if (targetColumn < 0 || targetColumn >= columns) return false;
+  if (targetColumn < 0 && targetColumn >= columns) return false;
   return true;
 }
killedBy: isValidTarget with columns validates columns 0-2 for 3-column grid
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/combat.ts:27:10
   columns = 4,
 ): boolean {
   if (targetColumn < 0 || targetColumn >= columns) return false;
-  return true;
+  return false;
 }
 
killedBy: isValidTarget with columns validates columns 0-2 for 3-column grid
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/combat.ts:33:72
 /**
  * Get the base damage an attacker deals (before suit bonuses).
  */
-export function getBaseAttackDamage(attacker: BattlefieldCard): number {
-  return attacker.card.value;
-}
+export function getBaseAttackDamage(attacker: BattlefieldCard): number {}
 
 /**
killedBy: Targeted edge case probes attack into completely empty column sends all damage to LP
statusReason: expected 20 to be +0 // Object.is equality

[Killed] BlockStatement
src/combat.ts:39:48
 
 /**
  */
-function isAce(card: BattlefieldCard): boolean {
-  return card.card.type === 'ace';
-}
+function isAce(card: BattlefieldCard): boolean {}
 
 /** Immutable attack context threaded through the damage chain (PHX-FACECARD-001). */
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/combat.ts:40:10
 /**
  */
 function isAce(card: BattlefieldCard): boolean {
-  return card.card.type === 'ace';
+  return true;
 }
 
killedBy: Core Rules Verification (TASK-Coverage) Rule 11: Classic Face Cards proves a Queen can destroy a Jack or a Queen, but not a King
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:40:10
 /**
  */
 function isAce(card: BattlefieldCard): boolean {
-  return card.card.type === 'ace';
+  return false;
 }
 
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected null not to be null

[Killed] BlockStatement
src/combat.ts:60:86
  *   Queen  → can destroy Jack, Queen
  *   King   → can destroy Jack, Queen, King
  */
-function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {
-  if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
-  if (attackerType === 'king') return true;
-  if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
-  if (attackerType === 'jack') return defenderType === 'jack';
-  return true; // number / ace / joker: always eligible
-}
+function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {}
 
 /**
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected 20 to be 2 // Object.is equality

[Killed] EqualityOperator
src/combat.ts:61:62
  *   King   → can destroy Jack, Queen, King
  */
 function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {
-  if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
+  if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType === 'king') return true;
   if (attackerType === 'king') return true;
   if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy King defender
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/combat.ts:61:94
  *   King   → can destroy Jack, Queen, King
  */
 function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {
-  if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
+  if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return false;
   if (attackerType === 'king') return true;
   if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Classic Ace mode toggle disables ace invulnerability when modeClassicAces is false
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:62:7
  */
 function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {
   if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
-  if (attackerType === 'king') return true;
+  if (true) return true;
   if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
   if (attackerType === 'jack') return defenderType === 'jack';
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/combat.ts:62:39
  */
 function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {
   if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
-  if (attackerType === 'king') return true;
+  if (attackerType === 'king') return false;
   if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
   if (attackerType === 'jack') return defenderType === 'jack';
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:63:7
 function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {
   if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
   if (attackerType === 'king') return true;
-  if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
+  if (false) return defenderType === 'jack' || defenderType === 'queen';
   if (attackerType === 'jack') return defenderType === 'jack';
   return true; // number / ace / joker: always eligible
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Queen attacker CANNOT destroy King defender
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/combat.ts:63:40
 function isFaceCardEligible(attackerType: CardType, defenderType: CardType): boolean {
   if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
   if (attackerType === 'king') return true;
-  if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
+  if (attackerType === 'queen') return true;
   if (attackerType === 'jack') return defenderType === 'jack';
   return true; // number / ace / joker: always eligible
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Queen attacker CANNOT destroy King defender
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/combat.ts:64:7
   if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
   if (attackerType === 'king') return true;
   if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
-  if (attackerType === 'jack') return defenderType === 'jack';
+  if (false) return defenderType === 'jack';
   return true; // number / ace / joker: always eligible
 }
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/combat.ts:64:39
   if (defenderType !== 'jack' && defenderType !== 'queen' && defenderType !== 'king') return true;
   if (attackerType === 'king') return true;
   if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
-  if (attackerType === 'jack') return defenderType === 'jack';
+  if (attackerType === 'jack') return false;
   return true; // number / ace / joker: always eligible
 }
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Eligible attacks — card is destroyed Jack attacker destroys Jack defender
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] BooleanLiteral
src/combat.ts:65:10
   if (attackerType === 'king') return true;
   if (attackerType === 'queen') return defenderType === 'jack' || defenderType === 'queen';
   if (attackerType === 'jack') return defenderType === 'jack';
-  return true; // number / ace / joker: always eligible
+  return false; // number / ace / joker: always eligible
 }
 
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Eligible attacks — card is destroyed Number card (value>11) attacker destroys Jack defender
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:91:25
   const steps: CombatLogStep[] = [];
   const discarded: BattlefieldCard['card'][] = [];
   let overflow = baseDamage;
-  const attackerIsAce = ctx.attackerType === 'ace';
+  const attackerIsAce = true;
 
   // Step A: Front card (index = column)
killedBy: Golden Scenarios (TASK-205) Scenario 2: Club doubling — front survives, no doubling clubs attacker vs front ace (invulnerable) — no overflow doubling to back
statusReason: expected null not to be null

[Killed] EqualityOperator
src/combat.ts:91:25
   const steps: CombatLogStep[] = [];
   const discarded: BattlefieldCard['card'][] = [];
   let overflow = baseDamage;
-  const attackerIsAce = ctx.attackerType === 'ace';
+  const attackerIsAce = ctx.attackerType !== 'ace';
 
   // Step A: Front card (index = column)
killedBy: Golden Scenarios (TASK-205) Scenario 2: Club doubling — front survives, no doubling clubs attacker vs front ace (invulnerable) — no overflow doubling to back
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/combat.ts:99:7
   let frontDiamondShield = 0;
   let frontHeartShield = 0;
 
-  if (frontCard && overflow > 0) {
+  if (true) {
     const step = absorbDamage(frontCard, overflow, attackerIsAce, true, ctx);
     overflow = step.overflow;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.4: Spade (♠) Weapon doubles damage against Player
statusReason: Cannot read properties of null (reading 'currentHp')

[Killed] BlockStatement
src/combat.ts:99:34
   let frontDiamondShield = 0;
   let frontHeartShield = 0;
 
-  if (frontCard && overflow > 0) {
-    const step = absorbDamage(frontCard, overflow, attackerIsAce, true, ctx);
-    overflow = step.overflow;
-    steps.push(step.logStep);
-
-    if (step.destroyed) {
-      discarded.push(frontCard.card);
-      newBf[frontIdx] = null;
-      if (frontCard.card.suit === 'diamonds') {
-        frontDiamondShield = frontCard.card.value;
-      }
-      if (frontCard.card.suit === 'hearts') {
-        frontHeartShield = frontCard.card.value;
-      }
-    } else {
-      newBf[frontIdx] = { ...frontCard, currentHp: step.remainingHp };
-    }
-  }
+  if (frontCard && overflow > 0) {}
 
   // Step B: Back card (index = column + ctx.columns)
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] BooleanLiteral
src/combat.ts:100:67
   let frontHeartShield = 0;
 
   if (frontCard && overflow > 0) {
-    const step = absorbDamage(frontCard, overflow, attackerIsAce, true, ctx);
+    const step = absorbDamage(frontCard, overflow, attackerIsAce, false, ctx);
     overflow = step.overflow;
     steps.push(step.logStep);
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace CAN be destroyed by another Ace
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:104:9
     overflow = step.overflow;
     steps.push(step.logStep);
 
-    if (step.destroyed) {
+    if (true) {
       discarded.push(frontCard.card);
       newBf[frontIdx] = null;
killedBy: Golden Scenarios (TASK-205) Scenario 2: Club doubling — front survives, no doubling clubs attacker vs front ace (invulnerable) — no overflow doubling to back
statusReason: expected null not to be null

[Killed] BlockStatement
src/combat.ts:104:25
     overflow = step.overflow;
     steps.push(step.logStep);
 
-    if (step.destroyed) {
-      discarded.push(frontCard.card);
-      newBf[frontIdx] = null;
-      if (frontCard.card.suit === 'diamonds') {
-        frontDiamondShield = frontCard.card.value;
-      }
-      if (frontCard.card.suit === 'hearts') {
-        frontHeartShield = frontCard.card.value;
-      }
-    } else {
+    if (step.destroyed) {} else {
       newBf[frontIdx] = { ...frontCard, currentHp: step.remainingHp };
     }
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] BlockStatement
src/combat.ts:107:47
     if (step.destroyed) {
       discarded.push(frontCard.card);
       newBf[frontIdx] = null;
-      if (frontCard.card.suit === 'diamonds') {
-        frontDiamondShield = frontCard.card.value;
-      }
+      if (frontCard.card.suit === 'diamonds') {}
       if (frontCard.card.suit === 'hearts') {
         frontHeartShield = frontCard.card.value;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 4 to be 6 // Object.is equality

[Killed] EqualityOperator
src/combat.ts:107:11
     if (step.destroyed) {
       discarded.push(frontCard.card);
       newBf[frontIdx] = null;
-      if (frontCard.card.suit === 'diamonds') {
+      if (frontCard.card.suit !== 'diamonds') {
         frontDiamondShield = frontCard.card.value;
       }
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 4 to be 6 // Object.is equality

[Killed] EqualityOperator
src/combat.ts:110:11
       if (frontCard.card.suit === 'diamonds') {
         frontDiamondShield = frontCard.card.value;
       }
-      if (frontCard.card.suit === 'hearts') {
+      if (frontCard.card.suit !== 'hearts') {
         frontHeartShield = frontCard.card.value;
       }
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 10 to be 13 // Object.is equality

[Killed] BlockStatement
src/combat.ts:110:45
       if (frontCard.card.suit === 'diamonds') {
         frontDiamondShield = frontCard.card.value;
       }
-      if (frontCard.card.suit === 'hearts') {
-        frontHeartShield = frontCard.card.value;
-      }
+      if (frontCard.card.suit === 'hearts') {}
     } else {
       newBf[frontIdx] = { ...frontCard, currentHp: step.remainingHp };
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 10 to be 13 // Object.is equality

[Killed] BlockStatement
src/combat.ts:113:12
       if (frontCard.card.suit === 'hearts') {
         frontHeartShield = frontCard.card.value;
       }
-    } else {
-      newBf[frontIdx] = { ...frontCard, currentHp: step.remainingHp };
-    }
+    } else {}
   }
 
killedBy: Core Rules Verification (TASK-Coverage) DEF-001 / TASK-193: Classic Mode HP Reset (§12) does NOT reset defender card HP in Cumulative mode
statusReason: expected 10 to be 7 // Object.is equality

[Killed] ObjectLiteral
src/combat.ts:114:25
         frontHeartShield = frontCard.card.value;
       }
     } else {
-      newBf[frontIdx] = { ...frontCard, currentHp: step.remainingHp };
+      newBf[frontIdx] = {};
     }
   }
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ArithmeticOperator
src/combat.ts:119:19
   }
 
   // Step B: Back card (index = column + ctx.columns)
-  const backIdx = column + ctx.columns;
+  const backIdx = column - ctx.columns;
   const backCard = newBf[backIdx];
   let backHeartShield = 0;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 10 to be 6 // Object.is equality

[Killed] EqualityOperator
src/combat.ts:123:7
   const backCard = newBf[backIdx];
   let backHeartShield = 0;
 
-  if (overflow > 0) {
+  if (overflow <= 0) {
     let clubDoubled = false;
     if (backCard && attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:123:7
   const backCard = newBf[backIdx];
   let backHeartShield = 0;
 
-  if (overflow > 0) {
+  if (false) {
     let clubDoubled = false;
     if (backCard && attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Survived] BooleanLiteral
src/combat.ts:124:23
   let backHeartShield = 0;
 
   if (overflow > 0) {
-    let clubDoubled = false;
+    let clubDoubled = true;
     if (backCard && attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
       overflow = overflow * 2;

[Killed] ConditionalExpression
src/combat.ts:125:21
 
   if (overflow > 0) {
     let clubDoubled = false;
-    if (backCard && attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
+    if (backCard && true && newBf[frontIdx] === null) {
       overflow = overflow * 2;
       clubDoubled = true;
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected 7 to be 20 // Object.is equality

[Killed] LogicalOperator
src/combat.ts:125:9
 
   if (overflow > 0) {
     let clubDoubled = false;
-    if (backCard && attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
+    if (backCard || attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
       overflow = overflow * 2;
       clubDoubled = true;
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected +0 to be 13 // Object.is equality

[Killed] ArithmeticOperator
src/combat.ts:126:18
   if (overflow > 0) {
     let clubDoubled = false;
     if (backCard && attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
-      overflow = overflow * 2;
+      overflow = overflow / 2;
       clubDoubled = true;
     }
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 10 to be 6 // Object.is equality

[Survived] BooleanLiteral
src/combat.ts:127:21
     let clubDoubled = false;
     if (backCard && attacker.card.suit === 'clubs' && newBf[frontIdx] === null) {
       overflow = overflow * 2;
-      clubDoubled = true;
+      clubDoubled = false;
     }
 

[Killed] BlockStatement
src/combat.ts:131:33
     }
 
     // Recorded on the front card's log step; overflow field updated to net value.
-    if (frontDiamondShield > 0) {
-      const shieldAbsorbed = Math.min(overflow, frontDiamondShield);
-      overflow -= shieldAbsorbed;
-      const frontStep = steps.at(-1);
-      if (!frontStep) throw new Error('Expected front step in combat log');
-      frontStep.overflow = overflow;
-      frontStep.remaining = overflow;
-      frontStep.bonuses ??= [];
-      if (clubDoubled && overflow === 0) {
-        // Club bonus absorbed by Diamond shield — record it on front step too
-        frontStep.bonuses.push('clubDoubleOverflow');
-        clubDoubled = false;
-      }
-      frontStep.bonuses.push('diamondDeathShield');
-    }
+    if (frontDiamondShield > 0) {}
 
     if (backCard && overflow > 0) {
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 4 to be 6 // Object.is equality

[Killed] EqualityOperator
src/combat.ts:131:9
     }
 
     // Recorded on the front card's log step; overflow field updated to net value.
-    if (frontDiamondShield > 0) {
+    if (frontDiamondShield <= 0) {
       const shieldAbsorbed = Math.min(overflow, frontDiamondShield);
       overflow -= shieldAbsorbed;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 4 to be 6 // Object.is equality

[Killed] MethodExpression
src/combat.ts:132:30
 
     // Recorded on the front card's log step; overflow field updated to net value.
     if (frontDiamondShield > 0) {
-      const shieldAbsorbed = Math.min(overflow, frontDiamondShield);
+      const shieldAbsorbed = Math.max(overflow, frontDiamondShield);
       overflow -= shieldAbsorbed;
       const frontStep = steps.at(-1);
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 10 to be 6 // Object.is equality

[Killed] AssignmentOperator
src/combat.ts:133:7
     // Recorded on the front card's log step; overflow field updated to net value.
     if (frontDiamondShield > 0) {
       const shieldAbsorbed = Math.min(overflow, frontDiamondShield);
-      overflow -= shieldAbsorbed;
+      overflow += shieldAbsorbed;
       const frontStep = steps.at(-1);
       if (!frontStep) throw new Error('Expected front step in combat log');
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 2 to be 6 // Object.is equality

[Killed] UnaryOperator
src/combat.ts:134:34
     if (frontDiamondShield > 0) {
       const shieldAbsorbed = Math.min(overflow, frontDiamondShield);
       overflow -= shieldAbsorbed;
-      const frontStep = steps.at(-1);
+      const frontStep = steps.at(+1);
       if (!frontStep) throw new Error('Expected front step in combat log');
       frontStep.overflow = overflow;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: Expected front step in combat log

[Killed] BooleanLiteral
src/combat.ts:135:11
       const shieldAbsorbed = Math.min(overflow, frontDiamondShield);
       overflow -= shieldAbsorbed;
       const frontStep = steps.at(-1);
-      if (!frontStep) throw new Error('Expected front step in combat log');
+      if (frontStep) throw new Error('Expected front step in combat log');
       frontStep.overflow = overflow;
       frontStep.remaining = overflow;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: Expected front step in combat log

[Killed] ConditionalExpression
src/combat.ts:135:11
       const shieldAbsorbed = Math.min(overflow, frontDiamondShield);
       overflow -= shieldAbsorbed;
       const frontStep = steps.at(-1);
-      if (!frontStep) throw new Error('Expected front step in combat log');
+      if (true) throw new Error('Expected front step in combat log');
       frontStep.overflow = overflow;
       frontStep.remaining = overflow;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: Expected front step in combat log

[Survived] AssignmentOperator
src/combat.ts:138:7
       if (!frontStep) throw new Error('Expected front step in combat log');
       frontStep.overflow = overflow;
       frontStep.remaining = overflow;
-      frontStep.bonuses ??= [];
+      frontStep.bonuses &&= [];
       if (clubDoubled && overflow === 0) {
         // Club bonus absorbed by Diamond shield — record it on front step too

[NoCoverage] ArrayDeclaration
src/combat.ts:138:29
       if (!frontStep) throw new Error('Expected front step in combat log');
       frontStep.overflow = overflow;
       frontStep.remaining = overflow;
-      frontStep.bonuses ??= [];
+      frontStep.bonuses ??= ["Stryker was here"];
       if (clubDoubled && overflow === 0) {
         // Club bonus absorbed by Diamond shield — record it on front step too

[Survived] LogicalOperator
src/combat.ts:139:11
       frontStep.overflow = overflow;
       frontStep.remaining = overflow;
       frontStep.bonuses ??= [];
-      if (clubDoubled && overflow === 0) {
+      if (clubDoubled || overflow === 0) {
         // Club bonus absorbed by Diamond shield — record it on front step too
         frontStep.bonuses.push('clubDoubleOverflow');

[Survived] ConditionalExpression
src/combat.ts:139:11
       frontStep.overflow = overflow;
       frontStep.remaining = overflow;
       frontStep.bonuses ??= [];
-      if (clubDoubled && overflow === 0) {
+      if (false) {
         // Club bonus absorbed by Diamond shield — record it on front step too
         frontStep.bonuses.push('clubDoubleOverflow');

[Survived] BooleanLiteral
src/combat.ts:142:23
       if (clubDoubled && overflow === 0) {
         // Club bonus absorbed by Diamond shield — record it on front step too
         frontStep.bonuses.push('clubDoubleOverflow');
-        clubDoubled = false;
+        clubDoubled = true;
       }
       frontStep.bonuses.push('diamondDeathShield');

[Killed] LogicalOperator
src/combat.ts:147:9
       frontStep.bonuses.push('diamondDeathShield');
     }
 
-    if (backCard && overflow > 0) {
+    if (backCard || overflow > 0) {
       const step = absorbDamage(backCard, overflow, attackerIsAce, false, ctx);
       overflow = step.overflow;
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Cannot read properties of null (reading 'currentHp')

[Killed] EqualityOperator
src/combat.ts:147:21
       frontStep.bonuses.push('diamondDeathShield');
     }
 
-    if (backCard && overflow > 0) {
+    if (backCard && overflow <= 0) {
       const step = absorbDamage(backCard, overflow, attackerIsAce, false, ctx);
       overflow = step.overflow;
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] BooleanLiteral
src/combat.ts:148:68
     }
 
     if (backCard && overflow > 0) {
-      const step = absorbDamage(backCard, overflow, attackerIsAce, false, ctx);
+      const step = absorbDamage(backCard, overflow, attackerIsAce, true, ctx);
       overflow = step.overflow;
 
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Survived] ConditionalExpression
src/combat.ts:151:11
       const step = absorbDamage(backCard, overflow, attackerIsAce, false, ctx);
       overflow = step.overflow;
 
-      if (clubDoubled) {
+      if (false) {
         step.logStep.bonuses ??= [];
         step.logStep.bonuses.push('clubDoubleOverflow');

[Survived] ConditionalExpression
src/combat.ts:151:11
       const step = absorbDamage(backCard, overflow, attackerIsAce, false, ctx);
       overflow = step.overflow;
 
-      if (clubDoubled) {
+      if (true) {
         step.logStep.bonuses ??= [];
         step.logStep.bonuses.push('clubDoubleOverflow');
