[Killed] BlockStatement
src/bot.ts:18:49
 }
 
 /** Mulberry32: fast seeded PRNG for deterministic bot decisions. */
-function mulberry32(seed: number): () => number {
-  let s = seed | 0;
-  return () => {
-    s = (s + 0x6d2b79f5) | 0;
-    let t = Math.imul(s ^ (s >>> 15), 1 | s);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-  };
-}
+function mulberry32(seed: number): () => number {}
 
 function pickRandom<T>(arr: readonly T[], rng: () => number): T {
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: rng is not a function

[Killed] BlockStatement
src/bot.ts:20:16
 /** Mulberry32: fast seeded PRNG for deterministic bot decisions. */
 function mulberry32(seed: number): () => number {
   let s = seed | 0;
-  return () => {
-    s = (s + 0x6d2b79f5) | 0;
-    let t = Math.imul(s ^ (s >>> 15), 1 | s);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-  };
+  return () => {};
 }
 
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: pickRandom called on empty array

[Survived] ArithmeticOperator
src/bot.ts:21:10
 function mulberry32(seed: number): () => number {
   let s = seed | 0;
   return () => {
-    s = (s + 0x6d2b79f5) | 0;
+    s = (s - 0x6d2b79f5) | 0;
     let t = Math.imul(s ^ (s >>> 15), 1 | s);
     t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;

[Survived] ArithmeticOperator
src/bot.ts:23:10
   return () => {
     s = (s + 0x6d2b79f5) | 0;
     let t = Math.imul(s ^ (s >>> 15), 1 | s);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
+    t = (t - Math.imul(t ^ t >>> 7, 61 | t)) ^ t;
     return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
   };

[Killed] BlockStatement
src/bot.ts:28:65
   };
 }
 
-function pickRandom<T>(arr: readonly T[], rng: () => number): T {
-  const item = arr[Math.floor(rng() * arr.length)];
-  if (item === undefined) throw new Error('pickRandom called on empty array');
-  return item;
-}
+function pickRandom<T>(arr: readonly T[], rng: () => number): T {}
 
 export function computeBotAction(
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Cannot read properties of undefined (reading 'id')

[Survived] ArithmeticOperator
src/bot.ts:29:31
 }
 
 function pickRandom<T>(arr: readonly T[], rng: () => number): T {
-  const item = arr[Math.floor(rng() * arr.length)];
+  const item = arr[Math.floor(rng() / arr.length)];
   if (item === undefined) throw new Error('pickRandom called on empty array');
   return item;

[Killed] ConditionalExpression
src/bot.ts:30:7
 
 function pickRandom<T>(arr: readonly T[], rng: () => number): T {
   const item = arr[Math.floor(rng() * arr.length)];
-  if (item === undefined) throw new Error('pickRandom called on empty array');
+  if (true) throw new Error('pickRandom called on empty array');
   return item;
 }
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: pickRandom called on empty array

[Killed] EqualityOperator
src/bot.ts:30:7
 
 function pickRandom<T>(arr: readonly T[], rng: () => number): T {
   const item = arr[Math.floor(rng() * arr.length)];
-  if (item === undefined) throw new Error('pickRandom called on empty array');
+  if (item !== undefined) throw new Error('pickRandom called on empty array');
   return item;
 }
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: pickRandom called on empty array

[Survived] StringLiteral
src/bot.ts:38:15
   gs: GameState,
   playerIndex: 0 | 1,
   config: BotConfig,
-  timestamp = '1970-01-01T00:00:00.000Z',
+  timestamp = "",
 ): Action {
   const rng = mulberry32(config.seed);

[Killed] BlockStatement
src/bot.ts:39:11
   playerIndex: 0 | 1,
   config: BotConfig,
   timestamp = '1970-01-01T00:00:00.000Z',
-): Action {
-  const rng = mulberry32(config.seed);
-
-  if (config.strategy === 'mcts') {
-    return runMCTS(gs, playerIndex, {
-      iterations: config.mctsIterations ?? 500,
-      explorationParam: 2.0,
-      seed: config.seed,
-    });
-  }
-
-  if (config.strategy === 'heuristic') {
-    return computeHeuristicAction(gs, playerIndex, rng, timestamp);
-  }
-
-  return computeRandomAction(gs, playerIndex, rng, timestamp);
-}
+): Action {}
 
 function computeRandomAction(
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Cannot read properties of undefined (reading 'type')

[Survived] ConditionalExpression
src/bot.ts:42:7
 ): Action {
   const rng = mulberry32(config.seed);
 
-  if (config.strategy === 'mcts') {
+  if (false) {
     return runMCTS(gs, playerIndex, {
       iterations: config.mctsIterations ?? 500,

[Survived] BlockStatement
src/bot.ts:42:35
 ): Action {
   const rng = mulberry32(config.seed);
 
-  if (config.strategy === 'mcts') {
-    return runMCTS(gs, playerIndex, {
-      iterations: config.mctsIterations ?? 500,
-      explorationParam: 2.0,
-      seed: config.seed,
-    });
-  }
+  if (config.strategy === 'mcts') {}
 
   if (config.strategy === 'heuristic') {

[Survived] LogicalOperator
src/bot.ts:44:19
 
   if (config.strategy === 'mcts') {
     return runMCTS(gs, playerIndex, {
-      iterations: config.mctsIterations ?? 500,
+      iterations: config.mctsIterations && 500,
       explorationParam: 2.0,
       seed: config.seed,

[Survived] ConditionalExpression
src/bot.ts:50:7
     });
   }
 
-  if (config.strategy === 'heuristic') {
+  if (false) {
     return computeHeuristicAction(gs, playerIndex, rng, timestamp);
   }

[Survived] EqualityOperator
src/bot.ts:50:7
     });
   }
 
-  if (config.strategy === 'heuristic') {
+  if (config.strategy !== 'heuristic') {
     return computeHeuristicAction(gs, playerIndex, rng, timestamp);
   }

[Killed] ConditionalExpression
src/bot.ts:64:7
   timestamp: string,
 ): Action {
   const player = gs.players[playerIndex];
-  if (!player) throw new Error(`No player at index ${playerIndex}`);
+  if (true) throw new Error(`No player at index ${playerIndex}`);
 
   const rows = gs.params?.rows ?? 2;
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: No player at index 1

[Killed] BooleanLiteral
src/bot.ts:64:7
   timestamp: string,
 ): Action {
   const player = gs.players[playerIndex];
-  if (!player) throw new Error(`No player at index ${playerIndex}`);
+  if (player) throw new Error(`No player at index ${playerIndex}`);
 
   const rows = gs.params?.rows ?? 2;
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: No player at index 1

[Survived] LogicalOperator
src/bot.ts:66:16
   const player = gs.players[playerIndex];
   if (!player) throw new Error(`No player at index ${playerIndex}`);
 
-  const rows = gs.params?.rows ?? 2;
+  const rows = gs.params?.rows && 2;
 
   const columns = gs.params?.columns ?? 4;

[Survived] OptionalChaining
src/bot.ts:66:16
   const player = gs.players[playerIndex];
   if (!player) throw new Error(`No player at index ${playerIndex}`);
 
-  const rows = gs.params?.rows ?? 2;
+  const rows = gs.params.rows ?? 2;
 
   const columns = gs.params?.columns ?? 4;

[Survived] LogicalOperator
src/bot.ts:68:19
 
   const rows = gs.params?.rows ?? 2;
 
-  const columns = gs.params?.columns ?? 4;
+  const columns = gs.params?.columns && 4;
 
   switch (gs.phase) {

[Survived] OptionalChaining
src/bot.ts:68:19
 
   const rows = gs.params?.rows ?? 2;
 
-  const columns = gs.params?.columns ?? 4;
+  const columns = gs.params.columns ?? 4;
 
   switch (gs.phase) {

[Killed] BlockStatement
src/bot.ts:71:29
   const columns = gs.params?.columns ?? 4;
 
   switch (gs.phase) {
-    case 'DeploymentPhase': {
-      if (player.hand.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const validCols: number[] = [];
-      for (let col = 0; col < columns; col++) {
-        if (getDeployTarget(player.battlefield, col, rows, columns) !== null) {
-          validCols.push(col);
-        }
-      }
-      if (validCols.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const card = pickRandom(player.hand, rng);
-      const col = pickRandom(validCols, rng);
-      return { type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp };
-    }
+    case 'DeploymentPhase': {}
 
     case 'AttackPhase': {
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Action "pass" is not allowed in phase "DeploymentPhase"

[Killed] ConditionalExpression
src/bot.ts:71:5
   const columns = gs.params?.columns ?? 4;
 
   switch (gs.phase) {
-    case 'DeploymentPhase': {
-      if (player.hand.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const validCols: number[] = [];
-      for (let col = 0; col < columns; col++) {
-        if (getDeployTarget(player.battlefield, col, rows, columns) !== null) {
-          validCols.push(col);
-        }
-      }
-      if (validCols.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const card = pickRandom(player.hand, rng);
-      const col = pickRandom(validCols, rng);
-      return { type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp };
-    }
+    case 'DeploymentPhase':
 
     case 'AttackPhase': {
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Action "pass" is not allowed in phase "DeploymentPhase"

[Killed] BlockStatement
src/bot.ts:72:37
 
   switch (gs.phase) {
     case 'DeploymentPhase': {
-      if (player.hand.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
+      if (player.hand.length === 0) {}
       const validCols: number[] = [];
       for (let col = 0; col < columns; col++) {
killedBy: computeBotAction - random strategy returns pass when hand is empty
statusReason: pickRandom called on empty array

[Killed] ConditionalExpression
src/bot.ts:72:11
 
   switch (gs.phase) {
     case 'DeploymentPhase': {
-      if (player.hand.length === 0) {
+      if (false) {
         return { type: 'pass', playerIndex, timestamp };
       }
killedBy: computeBotAction - random strategy returns pass when hand is empty
statusReason: pickRandom called on empty array

[Killed] ObjectLiteral
src/bot.ts:73:16
   switch (gs.phase) {
     case 'DeploymentPhase': {
       if (player.hand.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
+        return {};
       }
       const validCols: number[] = [];
killedBy: computeBotAction - random strategy returns pass when hand is empty
statusReason: expected undefined to be 'pass' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:76:25
         return { type: 'pass', playerIndex, timestamp };
       }
       const validCols: number[] = [];
-      for (let col = 0; col < columns; col++) {
+      for (let col = 0; col <= columns; col++) {
         if (getDeployTarget(player.battlefield, col, rows, columns) !== null) {
           validCols.push(col);
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Column out of range

[Killed] BlockStatement
src/bot.ts:76:47
         return { type: 'pass', playerIndex, timestamp };
       }
       const validCols: number[] = [];
-      for (let col = 0; col < columns; col++) {
-        if (getDeployTarget(player.battlefield, col, rows, columns) !== null) {
-          validCols.push(col);
-        }
-      }
+      for (let col = 0; col < columns; col++) {}
       if (validCols.length === 0) {
         return { type: 'pass', playerIndex, timestamp };
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:77:13
       }
       const validCols: number[] = [];
       for (let col = 0; col < columns; col++) {
-        if (getDeployTarget(player.battlefield, col, rows, columns) !== null) {
+        if (true) {
           validCols.push(col);
         }
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Column is full

[Killed] BlockStatement
src/bot.ts:77:79
       }
       const validCols: number[] = [];
       for (let col = 0; col < columns; col++) {
-        if (getDeployTarget(player.battlefield, col, rows, columns) !== null) {
-          validCols.push(col);
-        }
+        if (getDeployTarget(player.battlefield, col, rows, columns) !== null) {}
       }
       if (validCols.length === 0) {
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] BlockStatement
src/bot.ts:81:35
           validCols.push(col);
         }
       }
-      if (validCols.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
+      if (validCols.length === 0) {}
       const card = pickRandom(player.hand, rng);
       const col = pickRandom(validCols, rng);
killedBy: computeBotAction - random strategy returns pass in deployment when battlefield is full
statusReason: pickRandom called on empty array

[Killed] ConditionalExpression
src/bot.ts:81:11
           validCols.push(col);
         }
       }
-      if (validCols.length === 0) {
+      if (false) {
         return { type: 'pass', playerIndex, timestamp };
       }
killedBy: computeBotAction - random strategy returns pass in deployment when battlefield is full
statusReason: pickRandom called on empty array

[Killed] ObjectLiteral
src/bot.ts:82:16
         }
       }
       if (validCols.length === 0) {
-        return { type: 'pass', playerIndex, timestamp };
+        return {};
       }
       const card = pickRandom(player.hand, rng);
killedBy: computeBotAction - random strategy returns pass in deployment when battlefield is full
statusReason: expected undefined to be 'pass' // Object.is equality

[Killed] ObjectLiteral
src/bot.ts:86:14
       }
       const card = pickRandom(player.hand, rng);
       const col = pickRandom(validCols, rng);
-      return { type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp };
+      return {};
     }
 
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: expected undefined to be 'deploy' // Object.is equality

[Survived] ConditionalExpression
src/bot.ts:89:5
       return { type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp };
     }
 
-    case 'AttackPhase': {
-      const attackers: number[] = [];
-      for (let col = 0; col < columns; col++) {
-        if (player.battlefield[col]) {
-          attackers.push(col);
-        }
-      }
-      if (attackers.length === 0 || rng() < 0.2) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const atkCol = pickRandom(attackers, rng);
-      return {
-        type: 'attack',
-        playerIndex,
-        attackingColumn: atkCol,
-        defendingColumn: atkCol,
-        timestamp,
-      };
-    }
+    case 'AttackPhase':
 
     case 'ReinforcementPhase': {

[Survived] BlockStatement
src/bot.ts:89:25
       return { type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp };
     }
 
-    case 'AttackPhase': {
-      const attackers: number[] = [];
-      for (let col = 0; col < columns; col++) {
-        if (player.battlefield[col]) {
-          attackers.push(col);
-        }
-      }
-      if (attackers.length === 0 || rng() < 0.2) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const atkCol = pickRandom(attackers, rng);
-      return {
-        type: 'attack',
-        playerIndex,
-        attackingColumn: atkCol,
-        defendingColumn: atkCol,
-        timestamp,
-      };
-    }
+    case 'AttackPhase': {}
 
     case 'ReinforcementPhase': {

[Killed] EqualityOperator
src/bot.ts:91:25
 
     case 'AttackPhase': {
       const attackers: number[] = [];
-      for (let col = 0; col < columns; col++) {
+      for (let col = 0; col <= columns; col++) {
         if (player.battlefield[col]) {
           attackers.push(col);
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Only front-row cards can attack

[Timeout] UpdateOperator
src/bot.ts:91:40
 
     case 'AttackPhase': {
       const attackers: number[] = [];
-      for (let col = 0; col < columns; col++) {
+      for (let col = 0; col < columns; col--) {
         if (player.battlefield[col]) {
           attackers.push(col);

[Survived] ConditionalExpression
src/bot.ts:92:13
     case 'AttackPhase': {
       const attackers: number[] = [];
       for (let col = 0; col < columns; col++) {
-        if (player.battlefield[col]) {
+        if (false) {
           attackers.push(col);
         }

[Survived] BlockStatement
src/bot.ts:92:38
     case 'AttackPhase': {
       const attackers: number[] = [];
       for (let col = 0; col < columns; col++) {
-        if (player.battlefield[col]) {
-          attackers.push(col);
-        }
+        if (player.battlefield[col]) {}
       }
       if (attackers.length === 0 || rng() < 0.2) {

[Survived] EqualityOperator
src/bot.ts:96:37
           attackers.push(col);
         }
       }
-      if (attackers.length === 0 || rng() < 0.2) {
+      if (attackers.length === 0 || rng() >= 0.2) {
         return { type: 'pass', playerIndex, timestamp };
       }

[Survived] BlockStatement
src/bot.ts:96:50
           attackers.push(col);
         }
       }
-      if (attackers.length === 0 || rng() < 0.2) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
+      if (attackers.length === 0 || rng() < 0.2) {}
       const atkCol = pickRandom(attackers, rng);
       return {

[Killed] ObjectLiteral
src/bot.ts:97:16
         }
       }
       if (attackers.length === 0 || rng() < 0.2) {
-        return { type: 'pass', playerIndex, timestamp };
+        return {};
       }
       const atkCol = pickRandom(attackers, rng);
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Action "undefined" is not allowed in phase "AttackPhase"

[Killed] ObjectLiteral
src/bot.ts:100:14
         return { type: 'pass', playerIndex, timestamp };
       }
       const atkCol = pickRandom(attackers, rng);
-      return {
-        type: 'attack',
-        playerIndex,
-        attackingColumn: atkCol,
-        defendingColumn: atkCol,
-        timestamp,
-      };
+      return {};
     }
 
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Action "undefined" is not allowed in phase "AttackPhase"

[Killed] StringLiteral
src/bot.ts:101:15
       }
       const atkCol = pickRandom(attackers, rng);
       return {
-        type: 'attack',
+        type: "",
         playerIndex,
         attackingColumn: atkCol,
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Action "" is not allowed in phase "AttackPhase"

[Killed] BlockStatement
src/bot.ts:109:32
       };
     }
 
-    case 'ReinforcementPhase': {
-      if (player.hand.length === 0 || !gs.reinforcement) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const card = pickRandom(player.hand, rng);
-      return { type: 'reinforce', playerIndex, cardId: card.id, timestamp };
-    }
+    case 'ReinforcementPhase': {}
 
     default:
killedBy: computeBotAction - random strategy triggers random reinforcement
statusReason: expected 'pass' to be 'reinforce' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:109:5
       };
     }
 
-    case 'ReinforcementPhase': {
-      if (player.hand.length === 0 || !gs.reinforcement) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      const card = pickRandom(player.hand, rng);
-      return { type: 'reinforce', playerIndex, cardId: card.id, timestamp };
-    }
+    case 'ReinforcementPhase':
 
     default:
killedBy: computeBotAction - random strategy triggers random reinforcement
statusReason: expected 'pass' to be 'reinforce' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:110:11
     }
 
     case 'ReinforcementPhase': {
-      if (player.hand.length === 0 || !gs.reinforcement) {
+      if (false) {
         return { type: 'pass', playerIndex, timestamp };
       }
killedBy: computeBotAction - random strategy handles empty hand during ReinforcementPhase
statusReason: pickRandom called on empty array

[Killed] EqualityOperator
src/bot.ts:110:11
     }
 
     case 'ReinforcementPhase': {
-      if (player.hand.length === 0 || !gs.reinforcement) {
+      if (player.hand.length !== 0 || !gs.reinforcement) {
         return { type: 'pass', playerIndex, timestamp };
       }
killedBy: computeBotAction - random strategy triggers random reinforcement
statusReason: expected 'pass' to be 'reinforce' // Object.is equality

[Killed] StringLiteral
src/bot.ts:111:24
 
     case 'ReinforcementPhase': {
       if (player.hand.length === 0 || !gs.reinforcement) {
-        return { type: 'pass', playerIndex, timestamp };
+        return { type: "", playerIndex, timestamp };
       }
       const card = pickRandom(player.hand, rng);
killedBy: computeBotAction - random strategy handles empty hand during ReinforcementPhase
statusReason: expected '' to be 'pass' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:117:5
       return { type: 'reinforce', playerIndex, cardId: card.id, timestamp };
     }
 
-    default:
-      return { type: 'pass', playerIndex, timestamp };
+    default:
   }
 }
killedBy: computeBotAction - random strategy returns pass for unrecognized phases
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
src/bot.ts:118:14
     }
 
     default:
-      return { type: 'pass', playerIndex, timestamp };
+      return {};
   }
 }
killedBy: computeBotAction - random strategy returns pass for unrecognized phases
statusReason: expected undefined to be 'pass' // Object.is equality

[Killed] BlockStatement
src/bot.ts:127:11
   playerIndex: 0 | 1,
   rng: () => number,
   timestamp: string,
-): Action {
-  switch (gs.phase) {
-    case 'DeploymentPhase':
-      return scoreDeployment(gs, playerIndex, rng, timestamp);
-    case 'AttackPhase':
-      return scoreAttack(gs, playerIndex, rng, timestamp);
-    case 'ReinforcementPhase':
-      if ((gs.players[playerIndex]?.hand.length ?? 0) === 0 || !gs.reinforcement) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      return {
-        type: 'reinforce',
-        playerIndex,
-        cardId: pickRandom(gs.players[playerIndex]?.hand ?? [], rng).id,
-        timestamp,
-      };
-    default:
-      return { type: 'pass', playerIndex, timestamp };
-  }
-}
+): Action {}
 
 function scoreDeployment(gs: GameState, playerIdx: 0 | 1, rng: () => number, ts: string): Action {
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/bot.ts:129:5
   timestamp: string,
 ): Action {
   switch (gs.phase) {
-    case 'DeploymentPhase':
-      return scoreDeployment(gs, playerIndex, rng, timestamp);
+    case 'DeploymentPhase':
     case 'AttackPhase':
       return scoreAttack(gs, playerIndex, rng, timestamp);
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:131:5
   switch (gs.phase) {
     case 'DeploymentPhase':
       return scoreDeployment(gs, playerIndex, rng, timestamp);
-    case 'AttackPhase':
-      return scoreAttack(gs, playerIndex, rng, timestamp);
+    case 'AttackPhase':
     case 'ReinforcementPhase':
       if ((gs.players[playerIndex]?.hand.length ?? 0) === 0 || !gs.reinforcement) {
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:133:5
       return scoreDeployment(gs, playerIndex, rng, timestamp);
     case 'AttackPhase':
       return scoreAttack(gs, playerIndex, rng, timestamp);
-    case 'ReinforcementPhase':
-      if ((gs.players[playerIndex]?.hand.length ?? 0) === 0 || !gs.reinforcement) {
-        return { type: 'pass', playerIndex, timestamp };
-      }
-      return {
-        type: 'reinforce',
-        playerIndex,
-        cardId: pickRandom(gs.players[playerIndex]?.hand ?? [], rng).id,
-        timestamp,
-      };
+    case 'ReinforcementPhase':
     default:
       return { type: 'pass', playerIndex, timestamp };
killedBy: computeBotAction - heuristic strategy triggers heuristic reinforcement
statusReason: expected 'pass' to be 'reinforce' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:134:11
     case 'AttackPhase':
       return scoreAttack(gs, playerIndex, rng, timestamp);
     case 'ReinforcementPhase':
-      if ((gs.players[playerIndex]?.hand.length ?? 0) === 0 || !gs.reinforcement) {
+      if ((gs.players[playerIndex]?.hand.length ?? 0) !== 0 || !gs.reinforcement) {
         return { type: 'pass', playerIndex, timestamp };
       }
killedBy: computeBotAction - heuristic strategy triggers heuristic reinforcement
statusReason: expected 'pass' to be 'reinforce' // Object.is equality

[Killed] LogicalOperator
src/bot.ts:134:12
     case 'AttackPhase':
       return scoreAttack(gs, playerIndex, rng, timestamp);
     case 'ReinforcementPhase':
-      if ((gs.players[playerIndex]?.hand.length ?? 0) === 0 || !gs.reinforcement) {
+      if ((gs.players[playerIndex]?.hand.length && 0) === 0 || !gs.reinforcement) {
         return { type: 'pass', playerIndex, timestamp };
       }
killedBy: computeBotAction - heuristic strategy triggers heuristic reinforcement
statusReason: expected 'pass' to be 'reinforce' // Object.is equality

[Killed] LogicalOperator
src/bot.ts:140:28
       return {
         type: 'reinforce',
         playerIndex,
-        cardId: pickRandom(gs.players[playerIndex]?.hand ?? [], rng).id,
+        cardId: pickRandom(gs.players[playerIndex]?.hand && [], rng).id,
         timestamp,
       };
killedBy: computeBotAction - heuristic strategy triggers heuristic reinforcement
statusReason: pickRandom called on empty array

[Survived] OptionalChaining
src/bot.ts:140:28
       return {
         type: 'reinforce',
         playerIndex,
-        cardId: pickRandom(gs.players[playerIndex]?.hand ?? [], rng).id,
+        cardId: pickRandom(gs.players[playerIndex].hand ?? [], rng).id,
         timestamp,
       };

[Killed] ConditionalExpression
src/bot.ts:143:5
         cardId: pickRandom(gs.players[playerIndex]?.hand ?? [], rng).id,
         timestamp,
       };
-    default:
-      return { type: 'pass', playerIndex, timestamp };
+    default:
   }
 }
killedBy: computeBotAction - heuristic strategy handles unrecognized phase in heuristic
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/bot.ts:150:7
 
 function scoreDeployment(gs: GameState, playerIdx: 0 | 1, rng: () => number, ts: string): Action {
   const player = gs.players[playerIdx];
-  if (!player) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (true) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   const rows = gs.params?.rows ?? 2;
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] BooleanLiteral
src/bot.ts:150:7
 
 function scoreDeployment(gs: GameState, playerIdx: 0 | 1, rng: () => number, ts: string): Action {
   const player = gs.players[playerIdx];
-  if (!player) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (player) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   const rows = gs.params?.rows ?? 2;
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:156:7
 
   const columns = gs.params?.columns ?? 4;
 
-  if (player.hand.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (player.hand.length !== 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   const validDeploys: { card: Card; col: number; score: number }[] = [];
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:156:7
 
   const columns = gs.params?.columns ?? 4;
 
-  if (player.hand.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (true) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   const validDeploys: { card: Card; col: number; score: number }[] = [];
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality
