[Killed] BlockStatement
src/bot.ts:159:35
   if (player.hand.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   const validDeploys: { card: Card; col: number; score: number }[] = [];
-  for (const card of player.hand) {
-    for (let col = 0; col < columns; col++) {
-      const targetIdx = getDeployTarget(player.battlefield, col, rows, columns);
-      if (targetIdx === null) continue;
-
-      let score = 10;
-      if (player.battlefield[col] === null) score += 5;
-      if (targetIdx < columns) score += card.value;
-
-      validDeploys.push({ card, col, score });
-    }
-  }
+  for (const card of player.hand) {}
 
   if (validDeploys.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] BlockStatement
src/bot.ts:160:45
 
   const validDeploys: { card: Card; col: number; score: number }[] = [];
   for (const card of player.hand) {
-    for (let col = 0; col < columns; col++) {
-      const targetIdx = getDeployTarget(player.battlefield, col, rows, columns);
-      if (targetIdx === null) continue;
-
-      let score = 10;
-      if (player.battlefield[col] === null) score += 5;
-      if (targetIdx < columns) score += card.value;
-
-      validDeploys.push({ card, col, score });
-    }
+    for (let col = 0; col < columns; col++) {}
   }
 
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:160:23
 
   const validDeploys: { card: Card; col: number; score: number }[] = [];
   for (const card of player.hand) {
-    for (let col = 0; col < columns; col++) {
+    for (let col = 0; false; col++) {
       const targetIdx = getDeployTarget(player.battlefield, col, rows, columns);
       if (targetIdx === null) continue;
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:162:11
   for (const card of player.hand) {
     for (let col = 0; col < columns; col++) {
       const targetIdx = getDeployTarget(player.battlefield, col, rows, columns);
-      if (targetIdx === null) continue;
+      if (true) continue;
 
       let score = 10;
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:162:11
   for (const card of player.hand) {
     for (let col = 0; col < columns; col++) {
       const targetIdx = getDeployTarget(player.battlefield, col, rows, columns);
-      if (targetIdx === null) continue;
+      if (targetIdx !== null) continue;
 
       let score = 10;
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Survived] ConditionalExpression
src/bot.ts:165:11
       if (targetIdx === null) continue;
 
       let score = 10;
-      if (player.battlefield[col] === null) score += 5;
+      if (false) score += 5;
       if (targetIdx < columns) score += card.value;
 

[Survived] ConditionalExpression
src/bot.ts:165:11
       if (targetIdx === null) continue;
 
       let score = 10;
-      if (player.battlefield[col] === null) score += 5;
+      if (true) score += 5;
       if (targetIdx < columns) score += card.value;
 

[Survived] ConditionalExpression
src/bot.ts:166:11
 
       let score = 10;
       if (player.battlefield[col] === null) score += 5;
-      if (targetIdx < columns) score += card.value;
+      if (false) score += card.value;
 
       validDeploys.push({ card, col, score });

[Survived] AssignmentOperator
src/bot.ts:166:32
 
       let score = 10;
       if (player.battlefield[col] === null) score += 5;
-      if (targetIdx < columns) score += card.value;
+      if (targetIdx < columns) score -= card.value;
 
       validDeploys.push({ card, col, score });

[Killed] ObjectLiteral
src/bot.ts:168:25
       if (player.battlefield[col] === null) score += 5;
       if (targetIdx < columns) score += card.value;
 
-      validDeploys.push({ card, col, score });
+      validDeploys.push({});
     }
   }
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/bot.ts:172:7
     }
   }
 
-  if (validDeploys.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (true) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   validDeploys.sort((a, b) => b.score - a.score);
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:172:7
     }
   }
 
-  if (validDeploys.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (validDeploys.length !== 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   validDeploys.sort((a, b) => b.score - a.score);
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Survived] ArrowFunction
src/bot.ts:174:21
 
   if (validDeploys.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
-  validDeploys.sort((a, b) => b.score - a.score);
+  validDeploys.sort(() => undefined);
   const topScore = validDeploys[0]?.score;
   const best = validDeploys.filter((d) => d.score === topScore);

[Survived] ArithmeticOperator
src/bot.ts:174:31
 
   if (validDeploys.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
-  validDeploys.sort((a, b) => b.score - a.score);
+  validDeploys.sort((a, b) => b.score + a.score);
   const topScore = validDeploys[0]?.score;
   const best = validDeploys.filter((d) => d.score === topScore);

[Survived] OptionalChaining
src/bot.ts:175:20
   if (validDeploys.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   validDeploys.sort((a, b) => b.score - a.score);
-  const topScore = validDeploys[0]?.score;
+  const topScore = validDeploys[0].score;
   const best = validDeploys.filter((d) => d.score === topScore);
   const choice = pickRandom(best, rng);

[Killed] ConditionalExpression
src/bot.ts:176:43
 
   validDeploys.sort((a, b) => b.score - a.score);
   const topScore = validDeploys[0]?.score;
-  const best = validDeploys.filter((d) => d.score === topScore);
+  const best = validDeploys.filter((d) => false);
   const choice = pickRandom(best, rng);
   return {
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: pickRandom called on empty array

[Killed] ArrowFunction
src/bot.ts:176:36
 
   validDeploys.sort((a, b) => b.score - a.score);
   const topScore = validDeploys[0]?.score;
-  const best = validDeploys.filter((d) => d.score === topScore);
+  const best = validDeploys.filter(() => undefined);
   const choice = pickRandom(best, rng);
   return {
killedBy: computeBotAction - heuristic strategy returns a deploy action during DeploymentPhase
statusReason: pickRandom called on empty array

[Killed] ArithmeticOperator
src/bot.ts:189:31
 
 function scoreAttack(gs: GameState, playerIdx: 0 | 1, rng: () => number, ts: string): Action {
   const player = gs.players[playerIdx];
-  const opponent = gs.players[1 - playerIdx];
+  const opponent = gs.players[1 + playerIdx];
   if (!player || !opponent) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] BooleanLiteral
src/bot.ts:190:18
 function scoreAttack(gs: GameState, playerIdx: 0 | 1, rng: () => number, ts: string): Action {
   const player = gs.players[playerIdx];
   const opponent = gs.players[1 - playerIdx];
-  if (!player || !opponent) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (!player || opponent) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   const columns = gs.params?.columns ?? 4;
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] BooleanLiteral
src/bot.ts:190:7
 function scoreAttack(gs: GameState, playerIdx: 0 | 1, rng: () => number, ts: string): Action {
   const player = gs.players[playerIdx];
   const opponent = gs.players[1 - playerIdx];
-  if (!player || !opponent) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (player || !opponent) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   const columns = gs.params?.columns ?? 4;
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:195:21
   const columns = gs.params?.columns ?? 4;
 
   const attackers: { col: number; score: number }[] = [];
-  for (let col = 0; col < columns; col++) {
+  for (let col = 0; col <= columns; col++) {
     const attacker = player.battlefield[col];
     if (!attacker) continue;
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: Only front-row cards can attack

[Killed] EqualityOperator
src/bot.ts:195:21
   const columns = gs.params?.columns ?? 4;
 
   const attackers: { col: number; score: number }[] = [];
-  for (let col = 0; col < columns; col++) {
+  for (let col = 0; col >= columns; col++) {
     const attacker = player.battlefield[col];
     if (!attacker) continue;
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:197:9
   const attackers: { col: number; score: number }[] = [];
   for (let col = 0; col < columns; col++) {
     const attacker = player.battlefield[col];
-    if (!attacker) continue;
+    if (false) continue;
 
     attackers.push({ col, score: evaluateAttackColumn(col, attacker, opponent, columns) });
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: Cannot read properties of null (reading 'card')

[Killed] ConditionalExpression
src/bot.ts:197:9
   const attackers: { col: number; score: number }[] = [];
   for (let col = 0; col < columns; col++) {
     const attacker = player.battlefield[col];
-    if (!attacker) continue;
+    if (true) continue;
 
     attackers.push({ col, score: evaluateAttackColumn(col, attacker, opponent, columns) });
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ObjectLiteral
src/bot.ts:199:20
     const attacker = player.battlefield[col];
     if (!attacker) continue;
 
-    attackers.push({ col, score: evaluateAttackColumn(col, attacker, opponent, columns) });
+    attackers.push({});
   }
 
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: pickRandom called on empty array

[Killed] ConditionalExpression
src/bot.ts:202:7
     attackers.push({ col, score: evaluateAttackColumn(col, attacker, opponent, columns) });
   }
 
-  if (attackers.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (true) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   attackers.sort((a, b) => b.score - a.score);
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:202:7
     attackers.push({ col, score: evaluateAttackColumn(col, attacker, opponent, columns) });
   }
 
-  if (attackers.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+  if (attackers.length !== 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   attackers.sort((a, b) => b.score - a.score);
killedBy: computeBotAction - heuristic strategy handles empty defense columns in evaluation
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Survived] ArrowFunction
src/bot.ts:204:18
 
   if (attackers.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
-  attackers.sort((a, b) => b.score - a.score);
+  attackers.sort(() => undefined);
   const topAttackScore = attackers[0]?.score ?? 0;
   if (topAttackScore < 20 && rng() < 0.1) {

[Survived] ArithmeticOperator
src/bot.ts:204:28
 
   if (attackers.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
-  attackers.sort((a, b) => b.score - a.score);
+  attackers.sort((a, b) => b.score + a.score);
   const topAttackScore = attackers[0]?.score ?? 0;
   if (topAttackScore < 20 && rng() < 0.1) {

[Killed] LogicalOperator
src/bot.ts:205:26
   if (attackers.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   attackers.sort((a, b) => b.score - a.score);
-  const topAttackScore = attackers[0]?.score ?? 0;
+  const topAttackScore = attackers[0]?.score && 0;
   if (topAttackScore < 20 && rng() < 0.1) {
     return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: pickRandom called on empty array

[Survived] OptionalChaining
src/bot.ts:205:26
   if (attackers.length === 0) return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
 
   attackers.sort((a, b) => b.score - a.score);
-  const topAttackScore = attackers[0]?.score ?? 0;
+  const topAttackScore = attackers[0].score ?? 0;
   if (topAttackScore < 20 && rng() < 0.1) {
     return { type: 'pass', playerIndex: playerIdx, timestamp: ts };

[Killed] EqualityOperator
src/bot.ts:206:7
 
   attackers.sort((a, b) => b.score - a.score);
   const topAttackScore = attackers[0]?.score ?? 0;
-  if (topAttackScore < 20 && rng() < 0.1) {
+  if (topAttackScore >= 20 && rng() < 0.1) {
     return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
   }
killedBy: computeBotAction - heuristic strategy triggers pass in attack when score is low (probabilistic)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/bot.ts:206:43
 
   attackers.sort((a, b) => b.score - a.score);
   const topAttackScore = attackers[0]?.score ?? 0;
-  if (topAttackScore < 20 && rng() < 0.1) {
-    return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
-  }
+  if (topAttackScore < 20 && rng() < 0.1) {}
 
   const best = attackers.filter((a) => a.score === topAttackScore);
killedBy: computeBotAction - heuristic strategy triggers pass in attack when score is low (probabilistic)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/bot.ts:207:12
   attackers.sort((a, b) => b.score - a.score);
   const topAttackScore = attackers[0]?.score ?? 0;
   if (topAttackScore < 20 && rng() < 0.1) {
-    return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+    return {};
   }
 
killedBy: computeBotAction - heuristic strategy triggers pass in attack when score is low (probabilistic)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/bot.ts:207:20
   attackers.sort((a, b) => b.score - a.score);
   const topAttackScore = attackers[0]?.score ?? 0;
   if (topAttackScore < 20 && rng() < 0.1) {
-    return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
+    return { type: "", playerIndex: playerIdx, timestamp: ts };
   }
 
killedBy: computeBotAction - heuristic strategy triggers pass in attack when score is low (probabilistic)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/bot.ts:210:40
     return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
   }
 
-  const best = attackers.filter((a) => a.score === topAttackScore);
+  const best = attackers.filter((a) => false);
   const choice = pickRandom(best, rng);
   return {
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: pickRandom called on empty array

[Killed] EqualityOperator
src/bot.ts:210:40
     return { type: 'pass', playerIndex: playerIdx, timestamp: ts };
   }
 
-  const best = attackers.filter((a) => a.score === topAttackScore);
+  const best = attackers.filter((a) => a.score !== topAttackScore);
   const choice = pickRandom(best, rng);
   return {
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ObjectLiteral
src/bot.ts:212:10
 
   const best = attackers.filter((a) => a.score === topAttackScore);
   const choice = pickRandom(best, rng);
-  return {
-    type: 'attack',
-    playerIndex: playerIdx,
-    attackingColumn: choice.col,
-    defendingColumn: choice.col,
-    timestamp: ts,
-  };
+  return {};
 }
 
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: Action "undefined" is not allowed in phase "AttackPhase"

[Survived] ArithmeticOperator
src/bot.ts:228:40
   columns: number,
 ): number {
   const defFront = opponent.battlefield[col];
-  const defBack = opponent.battlefield[col + columns];
+  const defBack = opponent.battlefield[col - columns];
 
   if (!defFront && !defBack) {

[Killed] ConditionalExpression
src/bot.ts:230:7
   const defFront = opponent.battlefield[col];
   const defBack = opponent.battlefield[col + columns];
 
-  if (!defFront && !defBack) {
+  if (true) {
     let score = 100 + attacker.card.value;
     if (attacker.card.suit === 'spades') score += 50;
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] BooleanLiteral
src/bot.ts:230:7
   const defFront = opponent.battlefield[col];
   const defBack = opponent.battlefield[col + columns];
 
-  if (!defFront && !defBack) {
+  if (defFront && !defBack) {
     let score = 100 + attacker.card.value;
     if (attacker.card.suit === 'spades') score += 50;
killedBy: computeBotAction - heuristic strategy triggers pass in attack when score is low (probabilistic)
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/bot.ts:231:17
   const defBack = opponent.battlefield[col + columns];
 
   if (!defFront && !defBack) {
-    let score = 100 + attacker.card.value;
+    let score = 100 - attacker.card.value;
     if (attacker.card.suit === 'spades') score += 50;
     return score;

[Survived] AssignmentOperator
src/bot.ts:232:42
 
   if (!defFront && !defBack) {
     let score = 100 + attacker.card.value;
-    if (attacker.card.suit === 'spades') score += 50;
+    if (attacker.card.suit === 'spades') score -= 50;
     return score;
   }

[Survived] ConditionalExpression
src/bot.ts:232:9
 
   if (!defFront && !defBack) {
     let score = 100 + attacker.card.value;
-    if (attacker.card.suit === 'spades') score += 50;
+    if (false) score += 50;
     return score;
   }

[Survived] ConditionalExpression
src/bot.ts:236:7
     return score;
   }
 
-  if (!defFront) return 10; // Should not happen in v1.0 but for completeness
+  if (true) return 10; // Should not happen in v1.0 but for completeness
 
   if (attacker.card.value >= defFront.currentHp) {

[Survived] ConditionalExpression
src/bot.ts:236:7
     return score;
   }
 
-  if (!defFront) return 10; // Should not happen in v1.0 but for completeness
+  if (false) return 10; // Should not happen in v1.0 but for completeness
 
   if (attacker.card.value >= defFront.currentHp) {

[Killed] ConditionalExpression
src/bot.ts:238:7
 
   if (!defFront) return 10; // Should not happen in v1.0 but for completeness
 
-  if (attacker.card.value >= defFront.currentHp) {
+  if (true) {
     let score = 50 + defFront.card.value;
     const overflow = attacker.card.value - defFront.currentHp;
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] EqualityOperator
src/bot.ts:238:7
 
   if (!defFront) return 10; // Should not happen in v1.0 but for completeness
 
-  if (attacker.card.value >= defFront.currentHp) {
+  if (attacker.card.value < defFront.currentHp) {
     let score = 50 + defFront.card.value;
     const overflow = attacker.card.value - defFront.currentHp;
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Survived] ArithmeticOperator
src/bot.ts:239:17
   if (!defFront) return 10; // Should not happen in v1.0 but for completeness
 
   if (attacker.card.value >= defFront.currentHp) {
-    let score = 50 + defFront.card.value;
+    let score = 50 - defFront.card.value;
     const overflow = attacker.card.value - defFront.currentHp;
     if (overflow > 0) {

[Killed] ArithmeticOperator
src/bot.ts:240:22
 
   if (attacker.card.value >= defFront.currentHp) {
     let score = 50 + defFront.card.value;
-    const overflow = attacker.card.value - defFront.currentHp;
+    const overflow = attacker.card.value + defFront.currentHp;
     if (overflow > 0) {
       if (defBack) {
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Survived] BlockStatement
src/bot.ts:241:23
   if (attacker.card.value >= defFront.currentHp) {
     let score = 50 + defFront.card.value;
     const overflow = attacker.card.value - defFront.currentHp;
-    if (overflow > 0) {
-      if (defBack) {
-        score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
-      } else {
-        score += 40 + overflow;
-      }
-    }
+    if (overflow > 0) {}
     if (attacker.card.suit === 'clubs') score += 20;
     return score;

[Survived] ConditionalExpression
src/bot.ts:241:9
   if (attacker.card.value >= defFront.currentHp) {
     let score = 50 + defFront.card.value;
     const overflow = attacker.card.value - defFront.currentHp;
-    if (overflow > 0) {
+    if (true) {
       if (defBack) {
         score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;

[Killed] ConditionalExpression
src/bot.ts:242:11
     let score = 50 + defFront.card.value;
     const overflow = attacker.card.value - defFront.currentHp;
     if (overflow > 0) {
-      if (defBack) {
+      if (true) {
         score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
       } else {
killedBy: computeBotAction - heuristic strategy handles attack evaluation when there is no back row defender
statusReason: Cannot read properties of null (reading 'currentHp')

[Survived] BlockStatement
src/bot.ts:242:20
     let score = 50 + defFront.card.value;
     const overflow = attacker.card.value - defFront.currentHp;
     if (overflow > 0) {
-      if (defBack) {
-        score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
-      } else {
+      if (defBack) {} else {
         score += 40 + overflow;
       }

[Survived] EqualityOperator
src/bot.ts:243:18
     const overflow = attacker.card.value - defFront.currentHp;
     if (overflow > 0) {
       if (defBack) {
-        score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
+        score += overflow < defBack.currentHp ? 30 + defBack.card.value : 10;
       } else {
         score += 40 + overflow;

[Survived] ConditionalExpression
src/bot.ts:243:18
     const overflow = attacker.card.value - defFront.currentHp;
     if (overflow > 0) {
       if (defBack) {
-        score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
+        score += false ? 30 + defBack.card.value : 10;
       } else {
         score += 40 + overflow;

[Survived] BlockStatement
src/bot.ts:244:14
     if (overflow > 0) {
       if (defBack) {
         score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
-      } else {
-        score += 40 + overflow;
-      }
+      } else {}
     }
     if (attacker.card.suit === 'clubs') score += 20;

[Survived] AssignmentOperator
src/bot.ts:245:9
       if (defBack) {
         score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
       } else {
-        score += 40 + overflow;
+        score -= 40 + overflow;
       }
     }

[Survived] ArithmeticOperator
src/bot.ts:245:18
       if (defBack) {
         score += overflow >= defBack.currentHp ? 30 + defBack.card.value : 10;
       } else {
-        score += 40 + overflow;
+        score += 40 - overflow;
       }
     }

[Survived] ConditionalExpression
src/bot.ts:248:9
         score += 40 + overflow;
       }
     }
-    if (attacker.card.suit === 'clubs') score += 20;
+    if (false) score += 20;
     return score;
   }

[Survived] ConditionalExpression
src/bot.ts:248:9
         score += 40 + overflow;
       }
     }
-    if (attacker.card.suit === 'clubs') score += 20;
+    if (true) score += 20;
     return score;
   }

[Survived] ArithmeticOperator
src/bot.ts:252:10
     return score;
   }
 
-  return 10 + attacker.card.value;
+  return 10 - attacker.card.value;
 }
 
