[Survived] AssignmentOperator
src/combat.ts:152:9
       overflow = step.overflow;
 
       if (clubDoubled) {
-        step.logStep.bonuses ??= [];
+        step.logStep.bonuses &&= [];
         step.logStep.bonuses.push('clubDoubleOverflow');
       }

[NoCoverage] ArrayDeclaration
src/combat.ts:152:34
       overflow = step.overflow;
 
       if (clubDoubled) {
-        step.logStep.bonuses ??= [];
+        step.logStep.bonuses ??= ["Stryker was here"];
         step.logStep.bonuses.push('clubDoubleOverflow');
       }

[Survived] StringLiteral
src/combat.ts:153:35
 
       if (clubDoubled) {
         step.logStep.bonuses ??= [];
-        step.logStep.bonuses.push('clubDoubleOverflow');
+        step.logStep.bonuses.push("");
       }
 

[Killed] BlockStatement
src/combat.ts:158:27
 
       steps.push(step.logStep);
 
-      if (step.destroyed) {
-        discarded.push(backCard.card);
-        newBf[backIdx] = null;
-        if (backCard.card.suit === 'hearts') {
-          backHeartShield = backCard.card.value;
-        }
-      } else {
+      if (step.destroyed) {} else {
         newBf[backIdx] = { ...backCard, currentHp: step.remainingHp };
       }
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:158:11
 
       steps.push(step.logStep);
 
-      if (step.destroyed) {
+      if (false) {
         discarded.push(backCard.card);
         newBf[backIdx] = null;
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:161:13
       if (step.destroyed) {
         discarded.push(backCard.card);
         newBf[backIdx] = null;
-        if (backCard.card.suit === 'hearts') {
+        if (true) {
           backHeartShield = backCard.card.value;
         }
killedBy: Golden Scenarios (TASK-205) Scenario 2: Club doubling — front survives, no doubling clubs attacker vs front ace (invulnerable) — no overflow doubling to back
statusReason: expected 20 to be less than 20

[Killed] EqualityOperator
src/combat.ts:161:13
       if (step.destroyed) {
         discarded.push(backCard.card);
         newBf[backIdx] = null;
-        if (backCard.card.suit === 'hearts') {
+        if (backCard.card.suit !== 'hearts') {
           backHeartShield = backCard.card.value;
         }
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected 19 to be 20 // Object.is equality

[Killed] BlockStatement
src/combat.ts:164:14
         if (backCard.card.suit === 'hearts') {
           backHeartShield = backCard.card.value;
         }
-      } else {
-        newBf[backIdx] = { ...backCard, currentHp: step.remainingHp };
-      }
+      } else {}
     }
   }
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 10 to be 6 // Object.is equality

[Killed] ObjectLiteral
src/combat.ts:165:26
           backHeartShield = backCard.card.value;
         }
       } else {
-        newBf[backIdx] = { ...backCard, currentHp: step.remainingHp };
+        newBf[backIdx] = {};
       }
     }
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: Cannot read properties of undefined (reading 'face')

[Killed] ConditionalExpression
src/combat.ts:174:7
   let totalLpDamage = 0;
   let newLp = defenderLp;
 
-  if (overflow > 0) {
+  if (true) {
     let lpDamage = overflow;
     const bonuses: CombatBonusType[] = [];
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Damage origin is immutable across the target chain Jack kills front number card, then cannot kill Queen in back (overflow halted)
statusReason: expected [ Array(3) ] to have a length of 2 but got 3

[Killed] EqualityOperator
src/combat.ts:174:7
   let totalLpDamage = 0;
   let newLp = defenderLp;
 
-  if (overflow > 0) {
+  if (overflow >= 0) {
     let lpDamage = overflow;
     const bonuses: CombatBonusType[] = [];
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Damage origin is immutable across the target chain Jack kills front number card, then cannot kill Queen in back (overflow halted)
statusReason: expected [ Array(3) ] to have a length of 2 but got 3

[Survived] ArrayDeclaration
src/combat.ts:176:40
 
   if (overflow > 0) {
     let lpDamage = overflow;
-    const bonuses: CombatBonusType[] = [];
+    const bonuses: CombatBonusType[] = ["Stryker was here"];
 
     if (attacker.card.suit === 'spades') {

[Killed] EqualityOperator
src/combat.ts:178:9
     let lpDamage = overflow;
     const bonuses: CombatBonusType[] = [];
 
-    if (attacker.card.suit === 'spades') {
+    if (attacker.card.suit !== 'spades') {
       lpDamage = lpDamage * 2;
       bonuses.push('spadeDoubleLp');
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected 11 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:178:9
     let lpDamage = overflow;
     const bonuses: CombatBonusType[] = [];
 
-    if (attacker.card.suit === 'spades') {
+    if (false) {
       lpDamage = lpDamage * 2;
       bonuses.push('spadeDoubleLp');
killedBy: Targeted edge case probes attack into completely empty column sends all damage to LP
statusReason: expected 9 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/combat.ts:179:18
     const bonuses: CombatBonusType[] = [];
 
     if (attacker.card.suit === 'spades') {
-      lpDamage = lpDamage * 2;
+      lpDamage = lpDamage / 2;
       bonuses.push('spadeDoubleLp');
     }
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected 15.5 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:183:25
       bonuses.push('spadeDoubleLp');
     }
 
-    const heartShield = backHeartShield > 0 ? backHeartShield : frontHeartShield;
+    const heartShield = true ? backHeartShield : frontHeartShield;
     if (heartShield > 0) {
       const shieldAbsorbed = Math.min(lpDamage, heartShield);
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 10 to be 13 // Object.is equality

[Killed] EqualityOperator
src/combat.ts:183:25
       bonuses.push('spadeDoubleLp');
     }
 
-    const heartShield = backHeartShield > 0 ? backHeartShield : frontHeartShield;
+    const heartShield = backHeartShield <= 0 ? backHeartShield : frontHeartShield;
     if (heartShield > 0) {
       const shieldAbsorbed = Math.min(lpDamage, heartShield);
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 10 to be 13 // Object.is equality

[Killed] BlockStatement
src/combat.ts:184:26
     }
 
     const heartShield = backHeartShield > 0 ? backHeartShield : frontHeartShield;
-    if (heartShield > 0) {
-      const shieldAbsorbed = Math.min(lpDamage, heartShield);
-      lpDamage -= shieldAbsorbed;
-      bonuses.push('heartDeathShield');
-    }
+    if (heartShield > 0) {}
 
     totalLpDamage = lpDamage;
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 10 to be 13 // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:184:9
     }
 
     const heartShield = backHeartShield > 0 ? backHeartShield : frontHeartShield;
-    if (heartShield > 0) {
+    if (false) {
       const shieldAbsorbed = Math.min(lpDamage, heartShield);
       lpDamage -= shieldAbsorbed;
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 10 to be 13 // Object.is equality

[Killed] MethodExpression
src/combat.ts:185:30
 
     const heartShield = backHeartShield > 0 ? backHeartShield : frontHeartShield;
     if (heartShield > 0) {
-      const shieldAbsorbed = Math.min(lpDamage, heartShield);
+      const shieldAbsorbed = Math.max(lpDamage, heartShield);
       lpDamage -= shieldAbsorbed;
       bonuses.push('heartDeathShield');
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 20 to be 13 // Object.is equality

[Killed] AssignmentOperator
src/combat.ts:186:7
     const heartShield = backHeartShield > 0 ? backHeartShield : frontHeartShield;
     if (heartShield > 0) {
       const shieldAbsorbed = Math.min(lpDamage, heartShield);
-      lpDamage -= shieldAbsorbed;
+      lpDamage += shieldAbsorbed;
       bonuses.push('heartDeathShield');
     }
killedBy: Core Rules Verification (TASK-Coverage) DEF-003+009 / TASK-194: Heart Shield (§9.3, §19) applies front heart shield when front heart destroyed and back non-heart also destroyed
statusReason: expected 7 to be 13 // Object.is equality

[Survived] StringLiteral
src/combat.ts:187:20
     if (heartShield > 0) {
       const shieldAbsorbed = Math.min(lpDamage, heartShield);
       lpDamage -= shieldAbsorbed;
-      bonuses.push('heartDeathShield');
+      bonuses.push("");
     }
 

[Killed] ArithmeticOperator
src/combat.ts:191:25
     }
 
     totalLpDamage = lpDamage;
-    newLp = Math.max(0, defenderLp - lpDamage);
+    newLp = Math.max(0, defenderLp + lpDamage);
 
     const lpStep: CombatLogStep = {
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected 38 to be 2 // Object.is equality

[Killed] MethodExpression
src/combat.ts:191:13
     }
 
     totalLpDamage = lpDamage;
-    newLp = Math.max(0, defenderLp - lpDamage);
+    newLp = Math.min(0, defenderLp - lpDamage);
 
     const lpStep: CombatLogStep = {
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ObjectLiteral
src/combat.ts:193:35
     totalLpDamage = lpDamage;
     newLp = Math.max(0, defenderLp - lpDamage);
 
-    const lpStep: CombatLogStep = {
-      target: 'playerLp',
-      incomingDamage: overflow,
-      damage: lpDamage,
-      absorbed: Math.max(0, overflow - lpDamage),
-      overflow: 0,
-      remaining: 0,
-      lpBefore: defenderLp,
-      lpAfter: newLp,
-      bonuses: bonuses.length > 0 ? bonuses : undefined,
-    };
+    const lpStep: CombatLogStep = {};
     steps.push(lpStep);
   }

[Survived] ArithmeticOperator
src/combat.ts:197:29
       target: 'playerLp',
       incomingDamage: overflow,
       damage: lpDamage,
-      absorbed: Math.max(0, overflow - lpDamage),
+      absorbed: Math.max(0, overflow + lpDamage),
       overflow: 0,
       remaining: 0,

[Survived] MethodExpression
src/combat.ts:197:17
       target: 'playerLp',
       incomingDamage: overflow,
       damage: lpDamage,
-      absorbed: Math.max(0, overflow - lpDamage),
+      absorbed: Math.min(0, overflow - lpDamage),
       overflow: 0,
       remaining: 0,

[Survived] EqualityOperator
src/combat.ts:202:16
       remaining: 0,
       lpBefore: defenderLp,
       lpAfter: newLp,
-      bonuses: bonuses.length > 0 ? bonuses : undefined,
+      bonuses: bonuses.length >= 0 ? bonuses : undefined,
     };
     steps.push(lpStep);

[Survived] ConditionalExpression
src/combat.ts:202:16
       remaining: 0,
       lpBefore: defenderLp,
       lpAfter: newLp,
-      bonuses: bonuses.length > 0 ? bonuses : undefined,
+      bonuses: true ? bonuses : undefined,
     };
     steps.push(lpStep);

[Killed] ObjectLiteral
src/combat.ts:207:10
     steps.push(lpStep);
   }
 
-  return { battlefield: newBf, newLp, discarded, steps, totalLpDamage };
+  return {};
 }
 
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'flatMap')

[Killed] BooleanLiteral
src/combat.ts:231:35
 
   // PHX-FACECARD-001: Classic Face Cards eligibility check.
   // Must run before Ace check — face card eligibility is independent of Ace invulnerability.
-  if (ctx.modeClassicFaceCards && !isFaceCardEligible(ctx.attackerType, card.card.type)) {
+  if (ctx.modeClassicFaceCards && isFaceCardEligible(ctx.attackerType, card.card.type)) {
     bonuses.push('faceCardIneligible');
     // Cumulative mode: clamp HP to 1 (persistent damage), no overflow.
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] LogicalOperator
src/combat.ts:231:7
 
   // PHX-FACECARD-001: Classic Face Cards eligibility check.
   // Must run before Ace check — face card eligibility is independent of Ace invulnerability.
-  if (ctx.modeClassicFaceCards && !isFaceCardEligible(ctx.attackerType, card.card.type)) {
+  if (ctx.modeClassicFaceCards || !isFaceCardEligible(ctx.attackerType, card.card.type)) {
     bonuses.push('faceCardIneligible');
     // Cumulative mode: clamp HP to 1 (persistent damage), no overflow.
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] StringLiteral
src/combat.ts:232:18
   // PHX-FACECARD-001: Classic Face Cards eligibility check.
   // Must run before Ace check — face card eligibility is independent of Ace invulnerability.
   if (ctx.modeClassicFaceCards && !isFaceCardEligible(ctx.attackerType, card.card.type)) {
-    bonuses.push('faceCardIneligible');
+    bonuses.push("");
     // Cumulative mode: clamp HP to 1 (persistent damage), no overflow.
     // Classic mode: no HP change (HP resets each turn anyway), no overflow.
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected [ '' ] to include 'faceCardIneligible'

[Killed] MethodExpression
src/combat.ts:236:9
     // Cumulative mode: clamp HP to 1 (persistent damage), no overflow.
     // Classic mode: no HP change (HP resets each turn anyway), no overflow.
     const remainingHp = ctx.isCumulative
-      ? Math.max(card.currentHp - incomingDamage, 1)
+      ? Math.min(card.currentHp - incomingDamage, 1)
       : card.currentHp;
     const absorbed = card.currentHp - remainingHp;
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — cumulative mode: clamp to 1 HP Jack attacks Queen in cumulative mode: Queen clamped to 1 HP, LP unchanged
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/combat.ts:236:18
     // Cumulative mode: clamp HP to 1 (persistent damage), no overflow.
     // Classic mode: no HP change (HP resets each turn anyway), no overflow.
     const remainingHp = ctx.isCumulative
-      ? Math.max(card.currentHp - incomingDamage, 1)
+      ? Math.max(card.currentHp + incomingDamage, 1)
       : card.currentHp;
     const absorbed = card.currentHp - remainingHp;
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — cumulative mode: clamp to 1 HP Jack attacks Queen in cumulative mode: Queen clamped to 1 HP, LP unchanged
statusReason: expected 22 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/combat.ts:238:22
     const remainingHp = ctx.isCumulative
       ? Math.max(card.currentHp - incomingDamage, 1)
       : card.currentHp;
-    const absorbed = card.currentHp - remainingHp;
+    const absorbed = card.currentHp + remainingHp;
     return {
       remainingHp,

[Killed] ObjectLiteral
src/combat.ts:239:12
       ? Math.max(card.currentHp - incomingDamage, 1)
       : card.currentHp;
     const absorbed = card.currentHp - remainingHp;
-    return {
-      remainingHp,
-      overflow: 0,
-      destroyed: false,
-      logStep: {
-        target: isFrontRow ? 'frontCard' : 'backCard',
-        card: card.card,
-        incomingDamage,
-        hpBefore,
-        effectiveHp,
-        absorbed,
-        overflow: 0,
-        remaining: 0,
-        damage: absorbed,
-        hpAfter: remainingHp,
-        destroyed: false,
-        bonuses,
-      },
-    };
+    return {};
   }
 
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: Cannot read properties of undefined (reading 'bonuses')

[Killed] BooleanLiteral
src/combat.ts:242:18
     return {
       remainingHp,
       overflow: 0,
-      destroyed: false,
+      destroyed: true,
       logStep: {
         target: isFrontRow ? 'frontCard' : 'backCard',
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected null not to be null

[Killed] ObjectLiteral
src/combat.ts:243:16
       remainingHp,
       overflow: 0,
       destroyed: false,
-      logStep: {
-        target: isFrontRow ? 'frontCard' : 'backCard',
-        card: card.card,
-        incomingDamage,
-        hpBefore,
-        effectiveHp,
-        absorbed,
-        overflow: 0,
-        remaining: 0,
-        damage: absorbed,
-        hpAfter: remainingHp,
-        destroyed: false,
-        bonuses,
-      },
+      logStep: {},
     };
   }
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
src/combat.ts:244:30
       overflow: 0,
       destroyed: false,
       logStep: {
-        target: isFrontRow ? 'frontCard' : 'backCard',
+        target: isFrontRow ? "" : 'backCard',
         card: card.card,
         incomingDamage,

[Killed] BooleanLiteral
src/combat.ts:254:20
         remaining: 0,
         damage: absorbed,
         hpAfter: remainingHp,
-        destroyed: false,
+        destroyed: true,
         bonuses,
       },
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:262:7
 
   // (applied after Club doubling when the card is destroyed). No in-place bonus here.
 
-  if (isAce(card) && ctx.modeClassicAces) {
+  if (true) {
     if (attackerIsAce && isFrontRow) {
       // Ace-vs-Ace: invulnerability does not apply (only for front-rank aces, §10)
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] ConditionalExpression
src/combat.ts:262:7
 
   // (applied after Club doubling when the card is destroyed). No in-place bonus here.
 
-  if (isAce(card) && ctx.modeClassicAces) {
+  if (false) {
     if (attackerIsAce && isFrontRow) {
       // Ace-vs-Ace: invulnerability does not apply (only for front-rank aces, §10)
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/combat.ts:263:9
   // (applied after Club doubling when the card is destroyed). No in-place bonus here.
 
   if (isAce(card) && ctx.modeClassicAces) {
-    if (attackerIsAce && isFrontRow) {
+    if (false) {
       // Ace-vs-Ace: invulnerability does not apply (only for front-rank aces, §10)
       bonuses.push('aceVsAce');
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace CAN be destroyed by another Ace
statusReason: expected { card: { …(5) }, …(3) } to be null

[Killed] LogicalOperator
src/combat.ts:263:9
   // (applied after Club doubling when the card is destroyed). No in-place bonus here.
 
   if (isAce(card) && ctx.modeClassicAces) {
-    if (attackerIsAce && isFrontRow) {
+    if (attackerIsAce || isFrontRow) {
       // Ace-vs-Ace: invulnerability does not apply (only for front-rank aces, §10)
       bonuses.push('aceVsAce');
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected null not to be null

[Survived] MethodExpression
src/combat.ts:266:24
     if (attackerIsAce && isFrontRow) {
       // Ace-vs-Ace: invulnerability does not apply (only for front-rank aces, §10)
       bonuses.push('aceVsAce');
-      const absorbed = Math.min(incomingDamage, card.currentHp);
+      const absorbed = Math.max(incomingDamage, card.currentHp);
       const destroyed = card.currentHp - absorbed <= 0;
       const hpAfter = destroyed ? 0 : card.currentHp - absorbed;

[Killed] ArithmeticOperator
src/combat.ts:267:25
       // Ace-vs-Ace: invulnerability does not apply (only for front-rank aces, §10)
       bonuses.push('aceVsAce');
       const absorbed = Math.min(incomingDamage, card.currentHp);
-      const destroyed = card.currentHp - absorbed <= 0;
+      const destroyed = card.currentHp + absorbed <= 0;
       const hpAfter = destroyed ? 0 : card.currentHp - absorbed;
       const aceVsAceOverflow = incomingDamage - absorbed;
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace CAN be destroyed by another Ace
statusReason: expected { card: { …(5) }, …(3) } to be null

[Timeout] EqualityOperator
src/combat.ts:267:25
       // Ace-vs-Ace: invulnerability does not apply (only for front-rank aces, §10)
       bonuses.push('aceVsAce');
       const absorbed = Math.min(incomingDamage, card.currentHp);
-      const destroyed = card.currentHp - absorbed <= 0;
+      const destroyed = card.currentHp - absorbed < 0;
       const hpAfter = destroyed ? 0 : card.currentHp - absorbed;
       const aceVsAceOverflow = incomingDamage - absorbed;

[NoCoverage] ArithmeticOperator
src/combat.ts:268:39
       bonuses.push('aceVsAce');
       const absorbed = Math.min(incomingDamage, card.currentHp);
       const destroyed = card.currentHp - absorbed <= 0;
-      const hpAfter = destroyed ? 0 : card.currentHp - absorbed;
+      const hpAfter = destroyed ? 0 : card.currentHp + absorbed;
       const aceVsAceOverflow = incomingDamage - absorbed;
       return {

[Survived] ArithmeticOperator
src/combat.ts:269:32
       const absorbed = Math.min(incomingDamage, card.currentHp);
       const destroyed = card.currentHp - absorbed <= 0;
       const hpAfter = destroyed ? 0 : card.currentHp - absorbed;
-      const aceVsAceOverflow = incomingDamage - absorbed;
+      const aceVsAceOverflow = incomingDamage + absorbed;
       return {
         remainingHp: hpAfter,

[Killed] MethodExpression
src/combat.ts:292:22
     }
     // Normal attack on Ace: absorbs 1, stays at 1 HP
     bonuses.push('aceInvulnerable');
-    const absorbed = Math.min(incomingDamage, 1);
+    const absorbed = Math.max(incomingDamage, 1);
     const aceOverflow = incomingDamage - absorbed;
     return {
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected 20 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/combat.ts:293:25
     // Normal attack on Ace: absorbs 1, stays at 1 HP
     bonuses.push('aceInvulnerable');
     const absorbed = Math.min(incomingDamage, 1);
-    const aceOverflow = incomingDamage - absorbed;
+    const aceOverflow = incomingDamage + absorbed;
     return {
       remainingHp: 1,
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/combat.ts:297:18
     return {
       remainingHp: 1,
       overflow: aceOverflow,
-      destroyed: false,
+      destroyed: true,
       logStep: {
         target: isFrontRow ? 'frontCard' : 'backCard',
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: expected null not to be null

[Survived] ObjectLiteral
src/combat.ts:298:16
       remainingHp: 1,
       overflow: aceOverflow,
       destroyed: false,
-      logStep: {
-        target: isFrontRow ? 'frontCard' : 'backCard',
-        card: card.card,
-        incomingDamage,
-        hpBefore,
-        effectiveHp,
-        absorbed,
-        overflow: aceOverflow,
-        remaining: aceOverflow,
-        damage: absorbed,
-        hpAfter: 1,
-        destroyed: false,
-        bonuses,
-      },
+      logStep: {},
     };
   }

[Survived] BooleanLiteral
src/combat.ts:309:20
         remaining: aceOverflow,
         damage: absorbed,
         hpAfter: 1,
-        destroyed: false,
+        destroyed: true,
         bonuses,
       },

[Killed] MethodExpression
src/combat.ts:316:20
   }
 
   // Normal card absorption
-  const absorbed = Math.min(incomingDamage, effectiveHp);
+  const absorbed = Math.max(incomingDamage, effectiveHp);
   const overflow = incomingDamage - absorbed;
   const realHpLoss = absorbed;
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] ArithmeticOperator
src/combat.ts:317:20
 
   // Normal card absorption
   const absorbed = Math.min(incomingDamage, effectiveHp);
-  const overflow = incomingDamage - absorbed;
+  const overflow = incomingDamage + absorbed;
   const realHpLoss = absorbed;
   const newHp = card.currentHp - realHpLoss;
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: expected 'gameOver' to be 'ReinforcementPhase' // Object.is equality

[Killed] ArithmeticOperator
src/combat.ts:319:17
   const absorbed = Math.min(incomingDamage, effectiveHp);
   const overflow = incomingDamage - absorbed;
   const realHpLoss = absorbed;
-  const newHp = card.currentHp - realHpLoss;
+  const newHp = card.currentHp + realHpLoss;
   const destroyed = newHp <= 0;
 
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected 'LOSING_EXCHANGE' to be 'EVEN_EXCHANGE' // Object.is equality

[Killed] EqualityOperator
src/combat.ts:320:21
   const overflow = incomingDamage - absorbed;
   const realHpLoss = absorbed;
   const newHp = card.currentHp - realHpLoss;
-  const destroyed = newHp <= 0;
+  const destroyed = newHp > 0;
 
   return {
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] EqualityOperator
src/combat.ts:320:21
   const overflow = incomingDamage - absorbed;
   const realHpLoss = absorbed;
   const newHp = card.currentHp - realHpLoss;
-  const destroyed = newHp <= 0;
+  const destroyed = newHp < 0;
 
   return {
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected 'LOSING_EXCHANGE' to be 'EVEN_EXCHANGE' // Object.is equality

[Killed] BlockStatement
src/combat.ts:347:99
  * Used in per-turn damage mode after attack resolution.
  * Only resets cards that are still alive (non-null). Destroyed cards stay gone.
  */
-export function resetColumnHp(battlefield: Battlefield, column: number, columns = 4): Battlefield {
-  const newBf = [...battlefield] as Battlefield;
-  const frontIdx = column;
-  const backIdx = column + columns;
-
-  const frontCard = newBf[frontIdx];
-  if (frontCard) {
-    const fullHp = frontCard.card.value;
-    newBf[frontIdx] = { ...frontCard, currentHp: fullHp };
-  }
-
-  const backCard = newBf[backIdx];
-  if (backCard) {
-    const fullHp = backCard.card.value;
-    newBf[backIdx] = { ...backCard, currentHp: fullHp };
-  }
-
-  return newBf;
-}
+export function resetColumnHp(battlefield: Battlefield, column: number, columns = 4): Battlefield {}
 
 /**
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: Cannot read properties of undefined (reading 'some')
