[Killed] EqualityOperator
src/combat-preview.ts:50:25
     action.defendingColumn,
   );
 
-  const defenderIndex = action.playerIndex === 0 ? 1 : 0;
+  const defenderIndex = action.playerIndex !== 0 ? 1 : 0;
   const targetCol = action.attackingColumn;
   const { rows, columns } = state.params;
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:50:25
     action.defendingColumn,
   );
 
-  const defenderIndex = action.playerIndex === 0 ? 1 : 0;
+  const defenderIndex = false ? 1 : 0;
   const targetCol = action.attackingColumn;
   const { rows, columns } = state.params;
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/combat-preview.ts:55:22
   const { rows, columns } = state.params;
 
   const defender = postState.players[defenderIndex];
-  const defenderBf = defender?.battlefield ?? [];
+  const defenderBf = defender?.battlefield && [];
 
   // Use checkVictory (same logic as turns.ts) to match victoryTriggered exactly.
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected false to be true // Object.is equality

[Survived] OptionalChaining
src/combat-preview.ts:55:22
   const { rows, columns } = state.params;
 
   const defender = postState.players[defenderIndex];
-  const defenderBf = defender?.battlefield ?? [];
+  const defenderBf = defender.battlefield ?? [];
 
   // Use checkVictory (same logic as turns.ts) to match victoryTriggered exactly.

[Killed] EqualityOperator
src/combat-preview.ts:58:28
   const defenderBf = defender?.battlefield ?? [];
 
   // Use checkVictory (same logic as turns.ts) to match victoryTriggered exactly.
-  const victoryTriggered = checkVictory(postState) !== null;
+  const victoryTriggered = checkVictory(postState) === null;
   const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
   const reinforcementTriggered =
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:58:28
   const defenderBf = defender?.battlefield ?? [];
 
   // Use checkVictory (same logic as turns.ts) to match victoryTriggered exactly.
-  const victoryTriggered = checkVictory(postState) !== null;
+  const victoryTriggered = false;
   const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
   const reinforcementTriggered =
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S6 DIRECT_DAMAGE_RISK: victory triggered when defender LP depleted, preview equals real event
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:59:26
 
   // Use checkVictory (same logic as turns.ts) to match victoryTriggered exactly.
   const victoryTriggered = checkVictory(postState) !== null;
-  const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
+  const frontAfterNull = false;
   const reinforcementTriggered =
     frontAfterNull &&
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/combat-preview.ts:59:26
 
   // Use checkVictory (same logic as turns.ts) to match victoryTriggered exactly.
   const victoryTriggered = checkVictory(postState) !== null;
-  const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
+  const frontAfterNull = (defenderBf[targetCol] ?? null) !== null;
   const reinforcementTriggered =
     frontAfterNull &&
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:61:5
   const victoryTriggered = checkVictory(postState) !== null;
   const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
   const reinforcementTriggered =
-    frontAfterNull &&
-    (defender?.hand.length ?? 0) > 0 &&
-    !isColumnFull(defenderBf, targetCol, rows, columns);
+    true;
 
   // mode is intentionally omitted — events.ts also omits it, keeping outputs byte-identical.
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:61:5
   const victoryTriggered = checkVictory(postState) !== null;
   const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
   const reinforcementTriggered =
-    frontAfterNull &&
-    (defender?.hand.length ?? 0) > 0 &&
+    true &&
     !isColumnFull(defenderBf, targetCol, rows, columns);
 
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] EqualityOperator
src/combat-preview.ts:62:5
   const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
   const reinforcementTriggered =
     frontAfterNull &&
-    (defender?.hand.length ?? 0) > 0 &&
+    (defender?.hand.length ?? 0) >= 0 &&
     !isColumnFull(defenderBf, targetCol, rows, columns);
 
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] EqualityOperator
src/combat-preview.ts:62:5
   const frontAfterNull = (defenderBf[targetCol] ?? null) === null;
   const reinforcementTriggered =
     frontAfterNull &&
-    (defender?.hand.length ?? 0) > 0 &&
+    (defender?.hand.length ?? 0) <= 0 &&
     !isColumnFull(defenderBf, targetCol, rows, columns);
 
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] BooleanLiteral
src/combat-preview.ts:63:5
   const reinforcementTriggered =
     frontAfterNull &&
     (defender?.hand.length ?? 0) > 0 &&
-    !isColumnFull(defenderBf, targetCol, rows, columns);
+    isColumnFull(defenderBf, targetCol, rows, columns);
 
   // mode is intentionally omitted — events.ts also omits it, keeping outputs byte-identical.
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/combat-preview.ts:76:84
   return { verdict, resolution };
 }
 
-function resolveVerdict(resolution: CombatResolutionContext): AttackPreviewVerdict {
-  if (resolution.outcome.playerDamaged || resolution.outcome.victoryTriggered) {
-    return 'DIRECT_DAMAGE_RISK';
-  }
-  if (resolution.outcome.defenderFrontDestroyed && resolution.outcome.defenderBackDestroyed) {
-    return 'WINNING_EXCHANGE';
-  }
-  if (resolution.outcome.defenderFrontDestroyed) {
-    return 'EVEN_EXCHANGE';
-  }
-  return 'LOSING_EXCHANGE';
-}
+function resolveVerdict(resolution: CombatResolutionContext): AttackPreviewVerdict {}
 
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected undefined to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] LogicalOperator
src/combat-preview.ts:77:7
 }
 
 function resolveVerdict(resolution: CombatResolutionContext): AttackPreviewVerdict {
-  if (resolution.outcome.playerDamaged || resolution.outcome.victoryTriggered) {
+  if (resolution.outcome.playerDamaged && resolution.outcome.victoryTriggered) {
     return 'DIRECT_DAMAGE_RISK';
   }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S5 DIRECT_DAMAGE_RISK: overflow damages player LP, preview equals real event
statusReason: expected 'EVEN_EXCHANGE' to be 'DIRECT_DAMAGE_RISK' // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:77:7
 }
 
 function resolveVerdict(resolution: CombatResolutionContext): AttackPreviewVerdict {
-  if (resolution.outcome.playerDamaged || resolution.outcome.victoryTriggered) {
+  if (true) {
     return 'DIRECT_DAMAGE_RISK';
   }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] LogicalOperator
src/combat-preview.ts:80:7
   if (resolution.outcome.playerDamaged || resolution.outcome.victoryTriggered) {
     return 'DIRECT_DAMAGE_RISK';
   }
-  if (resolution.outcome.defenderFrontDestroyed && resolution.outcome.defenderBackDestroyed) {
+  if (resolution.outcome.defenderFrontDestroyed || resolution.outcome.defenderBackDestroyed) {
     return 'WINNING_EXCHANGE';
   }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected 'WINNING_EXCHANGE' to be 'EVEN_EXCHANGE' // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:80:7
   if (resolution.outcome.playerDamaged || resolution.outcome.victoryTriggered) {
     return 'DIRECT_DAMAGE_RISK';
   }
-  if (resolution.outcome.defenderFrontDestroyed && resolution.outcome.defenderBackDestroyed) {
+  if (false) {
     return 'WINNING_EXCHANGE';
   }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S4 WINNING_EXCHANGE: both cards destroyed with no LP damage, preview equals real event
statusReason: expected 'EVEN_EXCHANGE' to be 'WINNING_EXCHANGE' // Object.is equality

[Killed] BlockStatement
src/combat-preview.ts:83:50
   if (resolution.outcome.defenderFrontDestroyed && resolution.outcome.defenderBackDestroyed) {
     return 'WINNING_EXCHANGE';
   }
-  if (resolution.outcome.defenderFrontDestroyed) {
-    return 'EVEN_EXCHANGE';
-  }
+  if (resolution.outcome.defenderFrontDestroyed) {}
   return 'LOSING_EXCHANGE';
 }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected 'LOSING_EXCHANGE' to be 'EVEN_EXCHANGE' // Object.is equality

[Killed] ConditionalExpression
src/combat-preview.ts:83:7
   if (resolution.outcome.defenderFrontDestroyed && resolution.outcome.defenderBackDestroyed) {
     return 'WINNING_EXCHANGE';
   }
-  if (resolution.outcome.defenderFrontDestroyed) {
+  if (true) {
     return 'EVEN_EXCHANGE';
   }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'EVEN_EXCHANGE' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] StringLiteral
src/combat-preview.ts:86:10
   if (resolution.outcome.defenderFrontDestroyed) {
     return 'EVEN_EXCHANGE';
   }
-  return 'LOSING_EXCHANGE';
+  return "";
 }
 
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected '' to be 'LOSING_EXCHANGE' // Object.is equality
