[Survived] ArithmeticOperator
src/combat.ts:350:19
 export function resetColumnHp(battlefield: Battlefield, column: number, columns = 4): Battlefield {
   const newBf = [...battlefield] as Battlefield;
   const frontIdx = column;
-  const backIdx = column + columns;
+  const backIdx = column - columns;
 
   const frontCard = newBf[frontIdx];

[Killed] ConditionalExpression
src/combat.ts:353:7
   const backIdx = column + columns;
 
   const frontCard = newBf[frontIdx];
-  if (frontCard) {
+  if (true) {
     const fullHp = frontCard.card.value;
     newBf[frontIdx] = { ...frontCard, currentHp: fullHp };
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: Cannot read properties of null (reading 'card')

[Killed] BlockStatement
src/combat.ts:353:18
   const backIdx = column + columns;
 
   const frontCard = newBf[frontIdx];
-  if (frontCard) {
-    const fullHp = frontCard.card.value;
-    newBf[frontIdx] = { ...frontCard, currentHp: fullHp };
-  }
+  if (frontCard) {}
 
   const backCard = newBf[backIdx];
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: expected 5 to be 8 // Object.is equality

[Killed] ObjectLiteral
src/combat.ts:355:23
   const frontCard = newBf[frontIdx];
   if (frontCard) {
     const fullHp = frontCard.card.value;
-    newBf[frontIdx] = { ...frontCard, currentHp: fullHp };
+    newBf[frontIdx] = {};
   }
 
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:359:7
   }
 
   const backCard = newBf[backIdx];
-  if (backCard) {
+  if (true) {
     const fullHp = backCard.card.value;
     newBf[backIdx] = { ...backCard, currentHp: fullHp };
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: Cannot read properties of null (reading 'card')

[Survived] ConditionalExpression
src/combat.ts:359:7
   }
 
   const backCard = newBf[backIdx];
-  if (backCard) {
+  if (false) {
     const fullHp = backCard.card.value;
     newBf[backIdx] = { ...backCard, currentHp: fullHp };

[Killed] ObjectLiteral
src/combat.ts:361:22
   const backCard = newBf[backIdx];
   if (backCard) {
     const fullHp = backCard.card.value;
-    newBf[backIdx] = { ...backCard, currentHp: fullHp };
+    newBf[backIdx] = {};
   }
 
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
src/combat.ts:378:7
   _targetGridIndex: number,
 ): { state: GameState; combatEntry: CombatLogEntry } {
   const columns = state.params.columns;
-  if (attackerGridIndex < 0 || attackerGridIndex >= columns) {
+  if (attackerGridIndex <= 0 || attackerGridIndex >= columns) {
     throw new Error('Only front-row cards can attack');
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Only front-row cards can attack

[Killed] EqualityOperator
src/combat.ts:378:7
   _targetGridIndex: number,
 ): { state: GameState; combatEntry: CombatLogEntry } {
   const columns = state.params.columns;
-  if (attackerGridIndex < 0 || attackerGridIndex >= columns) {
+  if (attackerGridIndex >= 0 || attackerGridIndex >= columns) {
     throw new Error('Only front-row cards can attack');
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Only front-row cards can attack

[NoCoverage] StringLiteral
src/combat.ts:379:21
 ): { state: GameState; combatEntry: CombatLogEntry } {
   const columns = state.params.columns;
   if (attackerGridIndex < 0 || attackerGridIndex >= columns) {
-    throw new Error('Only front-row cards can attack');
+    throw new Error("");
   }
 

[Killed] EqualityOperator
src/combat.ts:382:25
     throw new Error('Only front-row cards can attack');
   }
 
-  const defenderIndex = attackerPlayerIndex === 0 ? 1 : 0;
+  const defenderIndex = attackerPlayerIndex !== 0 ? 1 : 0;
   const attacker = state.players[attackerPlayerIndex]?.battlefield[attackerGridIndex];
 
killedBy: Targeted edge case probes attack into completely empty column sends all damage to LP
statusReason: expected 20 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:382:25
     throw new Error('Only front-row cards can attack');
   }
 
-  const defenderIndex = attackerPlayerIndex === 0 ? 1 : 0;
+  const defenderIndex = false ? 1 : 0;
   const attacker = state.players[attackerPlayerIndex]?.battlefield[attackerGridIndex];
 
killedBy: Targeted edge case probes attack into completely empty column sends all damage to LP
statusReason: expected 20 to be +0 // Object.is equality

[Survived] OptionalChaining
src/combat.ts:383:20
   }
 
   const defenderIndex = attackerPlayerIndex === 0 ? 1 : 0;
-  const attacker = state.players[attackerPlayerIndex]?.battlefield[attackerGridIndex];
+  const attacker = state.players[attackerPlayerIndex].battlefield[attackerGridIndex];
 
   if (!attacker) {

[Killed] ConditionalExpression
src/combat.ts:385:7
   const defenderIndex = attackerPlayerIndex === 0 ? 1 : 0;
   const attacker = state.players[attackerPlayerIndex]?.battlefield[attackerGridIndex];
 
-  if (!attacker) {
+  if (true) {
     throw new Error(`No card at attacker position ${attackerGridIndex}`);
   }
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: No card at attacker position 0

[Killed] BooleanLiteral
src/combat.ts:385:7
   const defenderIndex = attackerPlayerIndex === 0 ? 1 : 0;
   const attacker = state.players[attackerPlayerIndex]?.battlefield[attackerGridIndex];
 
-  if (!attacker) {
+  if (attacker) {
     throw new Error(`No card at attacker position ${attackerGridIndex}`);
   }
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: No card at attacker position 0

[NoCoverage] StringLiteral
src/combat.ts:386:21
   const attacker = state.players[attackerPlayerIndex]?.battlefield[attackerGridIndex];
 
   if (!attacker) {
-    throw new Error(`No card at attacker position ${attackerGridIndex}`);
+    throw new Error(``);
   }
 

[Survived] ArithmeticOperator
src/combat.ts:390:24
   }
 
   const baseDamage = getBaseAttackDamage(attacker);
-  const targetColumn = attackerGridIndex % columns;
+  const targetColumn = attackerGridIndex * columns;
   const defender = state.players[defenderIndex];
   if (!defender) throw new Error(`No player at index ${defenderIndex}`);

[Killed] ConditionalExpression
src/combat.ts:392:7
   const baseDamage = getBaseAttackDamage(attacker);
   const targetColumn = attackerGridIndex % columns;
   const defender = state.players[defenderIndex];
-  if (!defender) throw new Error(`No player at index ${defenderIndex}`);
+  if (true) throw new Error(`No player at index ${defenderIndex}`);
   const ctx: AttackContext = {
     attackerType: attacker.card.type,
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No player at index 1

[Killed] BooleanLiteral
src/combat.ts:392:7
   const baseDamage = getBaseAttackDamage(attacker);
   const targetColumn = attackerGridIndex % columns;
   const defender = state.players[defenderIndex];
-  if (!defender) throw new Error(`No player at index ${defenderIndex}`);
+  if (defender) throw new Error(`No player at index ${defenderIndex}`);
   const ctx: AttackContext = {
     attackerType: attacker.card.type,
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No player at index 1

[Killed] EqualityOperator
src/combat.ts:397:19
     attackerType: attacker.card.type,
     modeClassicAces: state.params.modeClassicAces,
     modeClassicFaceCards: state.params.modeClassicFaceCards,
-    isCumulative: state.params.modeDamagePersistence === 'cumulative',
+    isCumulative: state.params.modeDamagePersistence !== 'cumulative',
     columns,
   };
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected 1 to be 11 // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:397:19
     attackerType: attacker.card.type,
     modeClassicAces: state.params.modeClassicAces,
     modeClassicFaceCards: state.params.modeClassicFaceCards,
-    isCumulative: state.params.modeDamagePersistence === 'cumulative',
+    isCumulative: true,
     columns,
   };
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Ineligible attacks — classic mode: overflow halted, card intact Jack attacker CANNOT destroy Queen defender (overflow=0, card intact)
statusReason: expected 1 to be 11 // Object.is equality

[Killed] ConditionalExpression
src/combat.ts:416:7
 
   // Flip attacker face-up
   const attackerPlayer = players[attackerPlayerIndex];
-  if (!attackerPlayer) throw new Error(`No player at index ${attackerPlayerIndex}`);
+  if (true) throw new Error(`No player at index ${attackerPlayerIndex}`);
   const attackerPs = { ...attackerPlayer };
   const attackerBf = [...attackerPs.battlefield] as Battlefield;
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Eligible attacks — card is destroyed Jack attacker destroys Jack defender
statusReason: No player at index 0

[Killed] BooleanLiteral
src/combat.ts:416:7
 
   // Flip attacker face-up
   const attackerPlayer = players[attackerPlayerIndex];
-  if (!attackerPlayer) throw new Error(`No player at index ${attackerPlayerIndex}`);
+  if (attackerPlayer) throw new Error(`No player at index ${attackerPlayerIndex}`);
   const attackerPs = { ...attackerPlayer };
   const attackerBf = [...attackerPs.battlefield] as Battlefield;
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Eligible attacks — card is destroyed Jack attacker destroys Jack defender
statusReason: No player at index 0

[Killed] BooleanLiteral
src/combat.ts:420:7
   const attackerPs = { ...attackerPlayer };
   const attackerBf = [...attackerPs.battlefield] as Battlefield;
   const attackerCard = attackerBf[attackerGridIndex];
-  if (!attackerCard) throw new Error(`No card at attacker grid index ${attackerGridIndex}`);
+  if (attackerCard) throw new Error(`No card at attacker grid index ${attackerGridIndex}`);
   attackerBf[attackerGridIndex] = { ...attackerCard, faceDown: false };
   attackerPs.battlefield = attackerBf;
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Eligible attacks — card is destroyed Jack attacker destroys Jack defender
statusReason: No card at attacker grid index 0

[Killed] ConditionalExpression
src/combat.ts:420:7
   const attackerPs = { ...attackerPlayer };
   const attackerBf = [...attackerPs.battlefield] as Battlefield;
   const attackerCard = attackerBf[attackerGridIndex];
-  if (!attackerCard) throw new Error(`No card at attacker grid index ${attackerGridIndex}`);
+  if (true) throw new Error(`No card at attacker grid index ${attackerGridIndex}`);
   attackerBf[attackerGridIndex] = { ...attackerCard, faceDown: false };
   attackerPs.battlefield = attackerBf;
killedBy: PHX-FACECARD-001: Classic Face Card Destruction Eligibility Eligible attacks — card is destroyed Jack attacker destroys Jack defender
statusReason: No card at attacker grid index 0

[Survived] BooleanLiteral
src/combat.ts:421:64
   const attackerBf = [...attackerPs.battlefield] as Battlefield;
   const attackerCard = attackerBf[attackerGridIndex];
   if (!attackerCard) throw new Error(`No card at attacker grid index ${attackerGridIndex}`);
-  attackerBf[attackerGridIndex] = { ...attackerCard, faceDown: false };
+  attackerBf[attackerGridIndex] = { ...attackerCard, faceDown: true };
   attackerPs.battlefield = attackerBf;
   players[attackerPlayerIndex] = attackerPs;

[Killed] ObjectLiteral
src/combat.ts:421:35
   const attackerBf = [...attackerPs.battlefield] as Battlefield;
   const attackerCard = attackerBf[attackerGridIndex];
   if (!attackerCard) throw new Error(`No card at attacker grid index ${attackerGridIndex}`);
-  attackerBf[attackerGridIndex] = { ...attackerCard, faceDown: false };
+  attackerBf[attackerGridIndex] = {};
   attackerPs.battlefield = attackerBf;
   players[attackerPlayerIndex] = attackerPs;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
src/combat.ts:426:22
   players[attackerPlayerIndex] = attackerPs;
 
   // Flip defender column face-up
-  const defenderPs = { ...players[defenderIndex] };
+  const defenderPs = {};
   const defenderBf = [...defenderPs.battlefield] as Battlefield;
   for (let r = 0; r < state.params.rows; r++) {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: defenderPs.battlefield is not iterable

[Survived] ConditionalExpression
src/combat.ts:428:19
   // Flip defender column face-up
   const defenderPs = { ...players[defenderIndex] };
   const defenderBf = [...defenderPs.battlefield] as Battlefield;
-  for (let r = 0; r < state.params.rows; r++) {
+  for (let r = 0; false; r++) {
     const idx = r * columns + targetColumn;
     const cell = defenderBf[idx];

[Timeout] UpdateOperator
src/combat.ts:428:42
   // Flip defender column face-up
   const defenderPs = { ...players[defenderIndex] };
   const defenderBf = [...defenderPs.battlefield] as Battlefield;
-  for (let r = 0; r < state.params.rows; r++) {
+  for (let r = 0; r < state.params.rows; r--) {
     const idx = r * columns + targetColumn;
     const cell = defenderBf[idx];

[Survived] ArithmeticOperator
src/combat.ts:429:17
   const defenderPs = { ...players[defenderIndex] };
   const defenderBf = [...defenderPs.battlefield] as Battlefield;
   for (let r = 0; r < state.params.rows; r++) {
-    const idx = r * columns + targetColumn;
+    const idx = r / columns + targetColumn;
     const cell = defenderBf[idx];
     if (cell) {

[Survived] ArithmeticOperator
src/combat.ts:429:17
   const defenderPs = { ...players[defenderIndex] };
   const defenderBf = [...defenderPs.battlefield] as Battlefield;
   for (let r = 0; r < state.params.rows; r++) {
-    const idx = r * columns + targetColumn;
+    const idx = r * columns - targetColumn;
     const cell = defenderBf[idx];
     if (cell) {

[Survived] ConditionalExpression
src/combat.ts:431:9
   for (let r = 0; r < state.params.rows; r++) {
     const idx = r * columns + targetColumn;
     const cell = defenderBf[idx];
-    if (cell) {
+    if (true) {
       defenderBf[idx] = { ...cell, faceDown: false };
     }

[Survived] ConditionalExpression
src/combat.ts:431:9
   for (let r = 0; r < state.params.rows; r++) {
     const idx = r * columns + targetColumn;
     const cell = defenderBf[idx];
-    if (cell) {
+    if (false) {
       defenderBf[idx] = { ...cell, faceDown: false };
     }

[Survived] BooleanLiteral
src/combat.ts:432:46
     const idx = r * columns + targetColumn;
     const cell = defenderBf[idx];
     if (cell) {
-      defenderBf[idx] = { ...cell, faceDown: false };
+      defenderBf[idx] = { ...cell, faceDown: true };
     }
   }

[Survived] ObjectLiteral
src/combat.ts:432:25
     const idx = r * columns + targetColumn;
     const cell = defenderBf[idx];
     if (cell) {
-      defenderBf[idx] = { ...cell, faceDown: false };
+      defenderBf[idx] = {};
     }
   }

[Survived] ArrowFunction
src/combat.ts:441:56
   newState.players = players;
 
   // Build combat log entry — store raw bonus keys as causeLabels; UI maps to display strings
-  const causeLabels = [...new Set(result.steps.flatMap((s) => s.bonuses ?? []))];
+  const causeLabels = [...new Set(result.steps.flatMap(() => undefined))];
 
   const combatEntry: CombatLogEntry = {

[Survived] LogicalOperator
src/combat.ts:441:63
   newState.players = players;
 
   // Build combat log entry — store raw bonus keys as causeLabels; UI maps to display strings
-  const causeLabels = [...new Set(result.steps.flatMap((s) => s.bonuses ?? []))];
+  const causeLabels = [...new Set(result.steps.flatMap((s) => s.bonuses && []))];
 
   const combatEntry: CombatLogEntry = {

[Survived] EqualityOperator
src/combat.ts:451:18
     baseDamage,
     steps: result.steps,
     totalLpDamage: result.totalLpDamage,
-    causeLabels: causeLabels.length > 0 ? causeLabels : undefined,
+    causeLabels: causeLabels.length <= 0 ? causeLabels : undefined,
   };
 

[Survived] ConditionalExpression
src/combat.ts:451:18
     baseDamage,
     steps: result.steps,
     totalLpDamage: result.totalLpDamage,
-    causeLabels: causeLabels.length > 0 ? causeLabels : undefined,
+    causeLabels: false ? causeLabels : undefined,
   };
 

[Killed] ObjectLiteral
src/combat.ts:455:33
   };
 
   const finalPlayers = [...players] as [PlayerState, PlayerState];
-  finalPlayers[defenderIndex] = {
-    ...finalPlayers[defenderIndex],
-    battlefield: result.battlefield,
-    discardPile: [...finalPlayers[defenderIndex].discardPile, ...result.discarded],
-    lifepoints: result.newLp,
-  };
+  finalPlayers[defenderIndex] = {};
 
   return { state: { ...newState, players: finalPlayers }, combatEntry };
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'some')
