[Killed] BlockStatement
src/mcts.ts:18:49
 }
 
 /** Mulberry32: fast seeded PRNG for deterministic MCTS. */
-function mulberry32(seed: number): () => number {
-  let s = seed | 0;
-  return () => {
-    s = (s + 0x6d2b79f5) | 0;
-    let t = Math.imul(s ^ (s >>> 15), 1 | s);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-  };
-}
+function mulberry32(seed: number): () => number {}
 
 export class MCTSNode {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: rng is not a function

[Killed] BlockStatement
src/mcts.ts:37:86
   public state: GameState;
   public playerIndex: number;
 
-  constructor(state: GameState, playerIndex: number, parent: MCTSNode | null = null) {
-    this.state = state;
-    this.playerIndex = playerIndex;
-    this.parent = parent;
-  }
+  constructor(state: GameState, playerIndex: number, parent: MCTSNode | null = null) {}
 
   public isFullyExpanded(): boolean {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Cannot read properties of undefined (reading 'activePlayerIndex')

[Killed] BlockStatement
src/mcts.ts:43:37
     this.parent = parent;
   }
 
-  public isFullyExpanded(): boolean {
-    const validActions = getValidActions(this.state, this.state.activePlayerIndex);
-    return this.children.size === validActions.length;
-  }
+  public isFullyExpanded(): boolean {}
 
   public getUCB1(explorationParam: number): number {
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:45:12
 
   public isFullyExpanded(): boolean {
     const validActions = getValidActions(this.state, this.state.activePlayerIndex);
-    return this.children.size === validActions.length;
+    return this.children.size !== validActions.length;
   }
 
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:45:12
 
   public isFullyExpanded(): boolean {
     const validActions = getValidActions(this.state, this.state.activePlayerIndex);
-    return this.children.size === validActions.length;
+    return false;
   }
 
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] BlockStatement
src/mcts.ts:48:52
     return this.children.size === validActions.length;
   }
 
-  public getUCB1(explorationParam: number): number {
-    if (this.visits === 0) return Infinity;
-    const parentVisits = this.parent ? this.parent.visits : this.visits;
-    const winRate = this.wins / this.visits;
-    const avgValue = this.totalValue / this.visits;
-    // Combine win rate with heuristic value for better tie-breaking
-    const exploitation = winRate * 0.7 + avgValue * 0.3;
-    return exploitation + explorationParam * Math.sqrt(Math.log(parentVisits) / this.visits);
-  }
+  public getUCB1(explorationParam: number): number {}
 }
 
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:49:9
   }
 
   public getUCB1(explorationParam: number): number {
-    if (this.visits === 0) return Infinity;
+    if (false) return Infinity;
     const parentVisits = this.parent ? this.parent.visits : this.visits;
     const winRate = this.wins / this.visits;
killedBy: Engine Coverage & Permutations MCTS Internal Gaps MCTSNode getUCB1 handles parentless node
statusReason: expected NaN to be Infinity // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:49:9
   }
 
   public getUCB1(explorationParam: number): number {
-    if (this.visits === 0) return Infinity;
+    if (this.visits !== 0) return Infinity;
     const parentVisits = this.parent ? this.parent.visits : this.visits;
     const winRate = this.wins / this.visits;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Survived] ArithmeticOperator
src/mcts.ts:51:21
   public getUCB1(explorationParam: number): number {
     if (this.visits === 0) return Infinity;
     const parentVisits = this.parent ? this.parent.visits : this.visits;
-    const winRate = this.wins / this.visits;
+    const winRate = this.wins * this.visits;
     const avgValue = this.totalValue / this.visits;
     // Combine win rate with heuristic value for better tie-breaking

[Survived] ArithmeticOperator
src/mcts.ts:52:22
     if (this.visits === 0) return Infinity;
     const parentVisits = this.parent ? this.parent.visits : this.visits;
     const winRate = this.wins / this.visits;
-    const avgValue = this.totalValue / this.visits;
+    const avgValue = this.totalValue * this.visits;
     // Combine win rate with heuristic value for better tie-breaking
     const exploitation = winRate * 0.7 + avgValue * 0.3;

[Survived] ArithmeticOperator
src/mcts.ts:54:42
     const winRate = this.wins / this.visits;
     const avgValue = this.totalValue / this.visits;
     // Combine win rate with heuristic value for better tie-breaking
-    const exploitation = winRate * 0.7 + avgValue * 0.3;
+    const exploitation = winRate * 0.7 + avgValue / 0.3;
     return exploitation + explorationParam * Math.sqrt(Math.log(parentVisits) / this.visits);
   }

[Survived] ArithmeticOperator
src/mcts.ts:54:26
     const winRate = this.wins / this.visits;
     const avgValue = this.totalValue / this.visits;
     // Combine win rate with heuristic value for better tie-breaking
-    const exploitation = winRate * 0.7 + avgValue * 0.3;
+    const exploitation = winRate * 0.7 - avgValue * 0.3;
     return exploitation + explorationParam * Math.sqrt(Math.log(parentVisits) / this.visits);
   }

[Killed] ArithmeticOperator
src/mcts.ts:55:12
     const avgValue = this.totalValue / this.visits;
     // Combine win rate with heuristic value for better tie-breaking
     const exploitation = winRate * 0.7 + avgValue * 0.3;
-    return exploitation + explorationParam * Math.sqrt(Math.log(parentVisits) / this.visits);
+    return exploitation - explorationParam * Math.sqrt(Math.log(parentVisits) / this.visits);
   }
 }
killedBy: Engine Coverage & Permutations MCTS Internal Gaps MCTSNode getUCB1 handles parentless node
statusReason: expected -0.45970518243761627 to be greater than 0

[Survived] ArithmeticOperator
src/mcts.ts:55:27
     const avgValue = this.totalValue / this.visits;
     // Combine win rate with heuristic value for better tie-breaking
     const exploitation = winRate * 0.7 + avgValue * 0.3;
-    return exploitation + explorationParam * Math.sqrt(Math.log(parentVisits) / this.visits);
+    return exploitation + explorationParam / Math.sqrt(Math.log(parentVisits) / this.visits);
   }
 }

[Killed] ConditionalExpression
src/mcts.ts:62:34
 /** Heuristic evaluation of the game state (0.0 to 1.0) */
 export function evaluateState(state: GameState, playerIndex: number): number {
   const player = state.players[playerIndex];
-  const opponent = state.players[playerIndex === 0 ? 1 : 0];
+  const opponent = state.players[true ? 1 : 0];
   if (!player || !opponent) return 0.5;
 
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected 0.49999999999999994 to be 1 // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:62:34
 /** Heuristic evaluation of the game state (0.0 to 1.0) */
 export function evaluateState(state: GameState, playerIndex: number): number {
   const player = state.players[playerIndex];
-  const opponent = state.players[playerIndex === 0 ? 1 : 0];
+  const opponent = state.players[playerIndex !== 0 ? 1 : 0];
   if (!player || !opponent) return 0.5;
 
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected 0.49999999999999994 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/mcts.ts:63:18
 export function evaluateState(state: GameState, playerIndex: number): number {
   const player = state.players[playerIndex];
   const opponent = state.players[playerIndex === 0 ? 1 : 0];
-  if (!player || !opponent) return 0.5;
+  if (!player || opponent) return 0.5;
 
   // Win/Loss terminal state detection in heuristic
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected 0.5 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:63:7
 export function evaluateState(state: GameState, playerIndex: number): number {
   const player = state.players[playerIndex];
   const opponent = state.players[playerIndex === 0 ? 1 : 0];
-  if (!player || !opponent) return 0.5;
+  if (true) return 0.5;
 
   // Win/Loss terminal state detection in heuristic
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected 0.5 to be 1 // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:66:7
   if (!player || !opponent) return 0.5;
 
   // Win/Loss terminal state detection in heuristic
-  if (player.lifepoints <= 0 && opponent.lifepoints <= 0) return 0.5;
+  if (player.lifepoints > 0 && opponent.lifepoints <= 0) return 0.5;
   if (player.lifepoints <= 0) return 0;
   if (opponent.lifepoints <= 0) return 1;
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected 0.5 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:66:33
   if (!player || !opponent) return 0.5;
 
   // Win/Loss terminal state detection in heuristic
-  if (player.lifepoints <= 0 && opponent.lifepoints <= 0) return 0.5;
+  if (player.lifepoints <= 0 && true) return 0.5;
   if (player.lifepoints <= 0) return 0;
   if (opponent.lifepoints <= 0) return 1;
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates loss state as 0.0
statusReason: expected 0.5 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:67:7
 
   // Win/Loss terminal state detection in heuristic
   if (player.lifepoints <= 0 && opponent.lifepoints <= 0) return 0.5;
-  if (player.lifepoints <= 0) return 0;
+  if (false) return 0;
   if (opponent.lifepoints <= 0) return 1;
 
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates loss state as 0.0
statusReason: expected 0.3 to be +0 // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:67:7
 
   // Win/Loss terminal state detection in heuristic
   if (player.lifepoints <= 0 && opponent.lifepoints <= 0) return 0.5;
-  if (player.lifepoints <= 0) return 0;
+  if (player.lifepoints > 0) return 0;
   if (opponent.lifepoints <= 0) return 1;
 
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:68:7
   // Win/Loss terminal state detection in heuristic
   if (player.lifepoints <= 0 && opponent.lifepoints <= 0) return 0.5;
   if (player.lifepoints <= 0) return 0;
-  if (opponent.lifepoints <= 0) return 1;
+  if (opponent.lifepoints < 0) return 1;
 
   // Normalize LP score (higher weighting as it's the primary win condition)
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected 0.7000000000000001 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:68:7
   // Win/Loss terminal state detection in heuristic
   if (player.lifepoints <= 0 && opponent.lifepoints <= 0) return 0.5;
   if (player.lifepoints <= 0) return 0;
-  if (opponent.lifepoints <= 0) return 1;
+  if (false) return 1;
 
   // Normalize LP score (higher weighting as it's the primary win condition)
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates win state as 1.0
statusReason: expected 0.7000000000000001 to be 1 // Object.is equality

[NoCoverage] ConditionalExpression
src/mcts.ts:72:32
 
   // Normalize LP score (higher weighting as it's the primary win condition)
   const lpScore =
-    player.lifepoints === 0 && opponent.lifepoints === 0
+    player.lifepoints === 0 && true
       ? 0.5
       : player.lifepoints / (player.lifepoints + opponent.lifepoints || 1);

[Survived] ConditionalExpression
src/mcts.ts:72:5
 
   // Normalize LP score (higher weighting as it's the primary win condition)
   const lpScore =
-    player.lifepoints === 0 && opponent.lifepoints === 0
+    false
       ? 0.5
       : player.lifepoints / (player.lifepoints + opponent.lifepoints || 1);

[Killed] LogicalOperator
src/mcts.ts:74:30
   const lpScore =
     player.lifepoints === 0 && opponent.lifepoints === 0
       ? 0.5
-      : player.lifepoints / (player.lifepoints + opponent.lifepoints || 1);
+      : player.lifepoints / (player.lifepoints + opponent.lifepoints && 1);
 
   // Battlefield presence (number of cards and their total value/health)
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 8.3 to be close to 0.5, received difference is 7.800000000000001, but expected 0.005

[Killed] ConditionalExpression
src/mcts.ts:74:30
   const lpScore =
     player.lifepoints === 0 && opponent.lifepoints === 0
       ? 0.5
-      : player.lifepoints / (player.lifepoints + opponent.lifepoints || 1);
+      : player.lifepoints / (true);
 
   // Battlefield presence (number of cards and their total value/health)
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 8.3 to be close to 0.5, received difference is 7.800000000000001, but expected 0.005

[Killed] ArrowFunction
src/mcts.ts:77:45
       : player.lifepoints / (player.lifepoints + opponent.lifepoints || 1);
 
   // Battlefield presence (number of cards and their total value/health)
-  const bfValue = player.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
+  const bfValue = player.battlefield.reduce(() => undefined, 0);
   const oppBfValue = opponent.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
   const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (bfValue + oppBfValue || 1);
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected NaN to be close to 0.5, received difference is NaN, but expected 0.005

[Survived] ArithmeticOperator
src/mcts.ts:77:57
       : player.lifepoints / (player.lifepoints + opponent.lifepoints || 1);
 
   // Battlefield presence (number of cards and their total value/health)
-  const bfValue = player.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
+  const bfValue = player.battlefield.reduce((acc, c) => acc - (c ? c.currentHp : 0), 0);
   const oppBfValue = opponent.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
   const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (bfValue + oppBfValue || 1);

[Killed] ArrowFunction
src/mcts.ts:78:50
 
   // Battlefield presence (number of cards and their total value/health)
   const bfValue = player.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
-  const oppBfValue = opponent.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
+  const oppBfValue = opponent.battlefield.reduce(() => undefined, 0);
   const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (bfValue + oppBfValue || 1);
 
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 0.35000000000000003 to be close to 0.5, received difference is 0.14999999999999997, but expected 0.005

[Survived] ArithmeticOperator
src/mcts.ts:78:62
 
   // Battlefield presence (number of cards and their total value/health)
   const bfValue = player.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
-  const oppBfValue = opponent.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
+  const oppBfValue = opponent.battlefield.reduce((acc, c) => acc - (c ? c.currentHp : 0), 0);
   const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (bfValue + oppBfValue || 1);
 

[Killed] LogicalOperator
src/mcts.ts:79:72
   // Battlefield presence (number of cards and their total value/health)
   const bfValue = player.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
   const oppBfValue = opponent.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
-  const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (bfValue + oppBfValue || 1);
+  const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (bfValue + oppBfValue && 1);
 
   // Hand advantage
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'forfeit' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:79:72
   // Battlefield presence (number of cards and their total value/health)
   const bfValue = player.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
   const oppBfValue = opponent.battlefield.reduce((acc, c) => acc + (c ? c.currentHp : 0), 0);
-  const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (bfValue + oppBfValue || 1);
+  const bfScore = bfValue === 0 && oppBfValue === 0 ? 0.5 : bfValue / (true);
 
   // Hand advantage
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'forfeit' to be 'attack' // Object.is equality

[Killed] ArithmeticOperator
src/mcts.ts:85:51
   const handCount = player.hand.length;
   const oppHandCount = opponent.hand.length;
   const handScore =
-    handCount === 0 && oppHandCount === 0 ? 0.5 : handCount / (handCount + oppHandCount || 1);
+    handCount === 0 && oppHandCount === 0 ? 0.5 : handCount * (handCount + oppHandCount || 1);
 
   // Card economy (total remaining resources)
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 58 to be close to 0.5, received difference is 57.5, but expected 0.005

[Killed] LogicalOperator
src/mcts.ts:85:64
   const handCount = player.hand.length;
   const oppHandCount = opponent.hand.length;
   const handScore =
-    handCount === 0 && oppHandCount === 0 ? 0.5 : handCount / (handCount + oppHandCount || 1);
+    handCount === 0 && oppHandCount === 0 ? 0.5 : handCount / (handCount + oppHandCount && 1);
 
   // Card economy (total remaining resources)
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 2.8000000000000003 to be close to 0.5, received difference is 2.3000000000000003, but expected 0.005

[Killed] ArithmeticOperator
src/mcts.ts:88:22
     handCount === 0 && oppHandCount === 0 ? 0.5 : handCount / (handCount + oppHandCount || 1);
 
   // Card economy (total remaining resources)
-  const totalCards = player.drawpile.length + player.hand.length;
+  const totalCards = player.drawpile.length - player.hand.length;
   const oppTotalCards = opponent.drawpile.length + opponent.hand.length;
   const economyScore =
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 0.48499999999999993 to be close to 0.5, received difference is 0.015000000000000069, but expected 0.005

[Killed] ArithmeticOperator
src/mcts.ts:89:25
 
   // Card economy (total remaining resources)
   const totalCards = player.drawpile.length + player.hand.length;
-  const oppTotalCards = opponent.drawpile.length + opponent.hand.length;
+  const oppTotalCards = opponent.drawpile.length - opponent.hand.length;
   const economyScore =
     totalCards === 0 && oppTotalCards === 0 ? 0.5 : totalCards / (totalCards + oppTotalCards || 1);
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 0.5149999999999999 to be close to 0.5, received difference is 0.014999999999999902, but expected 0.005

[Killed] EqualityOperator
src/mcts.ts:91:5
   const totalCards = player.drawpile.length + player.hand.length;
   const oppTotalCards = opponent.drawpile.length + opponent.hand.length;
   const economyScore =
-    totalCards === 0 && oppTotalCards === 0 ? 0.5 : totalCards / (totalCards + oppTotalCards || 1);
+    totalCards !== 0 && oppTotalCards === 0 ? 0.5 : totalCards / (totalCards + oppTotalCards || 1);
 
   return lpScore * 0.4 + bfScore * 0.3 + handScore * 0.2 + economyScore * 0.1;
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates zero-Economy state as 0.5
statusReason: expected 0.44999999999999996 to be close to 0.5, received difference is 0.050000000000000044, but expected 0.005

[Killed] ConditionalExpression
src/mcts.ts:91:67
   const totalCards = player.drawpile.length + player.hand.length;
   const oppTotalCards = opponent.drawpile.length + opponent.hand.length;
   const economyScore =
-    totalCards === 0 && oppTotalCards === 0 ? 0.5 : totalCards / (totalCards + oppTotalCards || 1);
+    totalCards === 0 && oppTotalCards === 0 ? 0.5 : totalCards / (false);
 
   return lpScore * 0.4 + bfScore * 0.3 + handScore * 0.2 + economyScore * 0.1;
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected Infinity to be close to 0.5, received difference is Infinity, but expected 0.005

[Killed] ArithmeticOperator
src/mcts.ts:93:42
   const economyScore =
     totalCards === 0 && oppTotalCards === 0 ? 0.5 : totalCards / (totalCards + oppTotalCards || 1);
 
-  return lpScore * 0.4 + bfScore * 0.3 + handScore * 0.2 + economyScore * 0.1;
+  return lpScore * 0.4 + bfScore * 0.3 + handScore / 0.2 + economyScore * 0.1;
 }
 
killedBy: Bot Adversarial Paths The "Moody" path handles evaluateState when both players have massive resources
statusReason: expected 2.9 to be close to 0.5, received difference is 2.4, but expected 0.005

[Killed] ArithmeticOperator
src/mcts.ts:93:10
   const economyScore =
     totalCards === 0 && oppTotalCards === 0 ? 0.5 : totalCards / (totalCards + oppTotalCards || 1);
 
-  return lpScore * 0.4 + bfScore * 0.3 + handScore * 0.2 + economyScore * 0.1;
+  return lpScore * 0.4 + bfScore * 0.3 + handScore * 0.2 - economyScore * 0.1;
 }
 
killedBy: MCTS Strategy Depth Heuristic Evaluation evaluates balanced state as 0.5
statusReason: expected 0.39999999999999997 to be close to 0.5, received difference is 0.10000000000000003, but expected 0.005

[Survived] LogicalOperator
src/mcts.ts:101:26
   playerIndex: number,
   config: MCTSConfig = { iterations: 100, explorationParam: 2.0 },
 ): Action {
-  const rng = mulberry32(config.seed ?? 42);
+  const rng = mulberry32(config.seed && 42);
   const root = new MCTSNode(initialState, playerIndex);
 

[Killed] ConditionalExpression
src/mcts.ts:104:19
   const rng = mulberry32(config.seed ?? 42);
   const root = new MCTSNode(initialState, playerIndex);
 
-  for (let i = 0; i < config.iterations; i++) {
+  for (let i = 0; false; i++) {
     let node = root;
 
killedBy: MCTS Strategy Depth returns a valid action in DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:104:19
   const rng = mulberry32(config.seed ?? 42);
   const root = new MCTSNode(initialState, playerIndex);
 
-  for (let i = 0; i < config.iterations; i++) {
+  for (let i = 0; i >= config.iterations; i++) {
     let node = root;
 
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:108:12
     let node = root;
 
     // 1. Selection
-    while (node.isFullyExpanded() && node.children.size > 0) {
+    while (false) {
       let bestChild: MCTSNode | null = null;
       let maxUCB = -Infinity;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] LogicalOperator
src/mcts.ts:108:12
     let node = root;
 
     // 1. Selection
-    while (node.isFullyExpanded() && node.children.size > 0) {
+    while (node.isFullyExpanded() || node.children.size > 0) {
       let bestChild: MCTSNode | null = null;
       let maxUCB = -Infinity;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] UnaryOperator
src/mcts.ts:110:20
     // 1. Selection
     while (node.isFullyExpanded() && node.children.size > 0) {
       let bestChild: MCTSNode | null = null;
-      let maxUCB = -Infinity;
+      let maxUCB = +Infinity;
 
       for (const { node: child } of node.children.values()) {
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] BlockStatement
src/mcts.ts:112:61
       let bestChild: MCTSNode | null = null;
       let maxUCB = -Infinity;
 
-      for (const { node: child } of node.children.values()) {
-        const ucb = child.getUCB1(config.explorationParam);
-        if (ucb > maxUCB) {
-          maxUCB = ucb;
-          bestChild = child;
-        }
-      }
+      for (const { node: child } of node.children.values()) {}
       if (!bestChild) break;
       node = bestChild;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:114:13
 
       for (const { node: child } of node.children.values()) {
         const ucb = child.getUCB1(config.explorationParam);
-        if (ucb > maxUCB) {
+        if (false) {
           maxUCB = ucb;
           bestChild = child;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:114:13
 
       for (const { node: child } of node.children.values()) {
         const ucb = child.getUCB1(config.explorationParam);
-        if (ucb > maxUCB) {
+        if (ucb <= maxUCB) {
           maxUCB = ucb;
           bestChild = child;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] BooleanLiteral
src/mcts.ts:119:11
           bestChild = child;
         }
       }
-      if (!bestChild) break;
+      if (bestChild) break;
       node = bestChild;
     }
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:119:11
           bestChild = child;
         }
       }
-      if (!bestChild) break;
+      if (true) break;
       node = bestChild;
     }
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:124:9
     }
 
     // 2. Expansion
-    if (!isGameOver(node.state)) {
+    if (false) {
       const validActions = getValidActions(node.state, node.state.activePlayerIndex);
       const untriedActions = validActions.filter((a) => !node.children.has(JSON.stringify(a)));
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] BlockStatement
src/mcts.ts:124:34
     }
 
     // 2. Expansion
-    if (!isGameOver(node.state)) {
-      const validActions = getValidActions(node.state, node.state.activePlayerIndex);
-      const untriedActions = validActions.filter((a) => !node.children.has(JSON.stringify(a)));
-
-      if (untriedActions.length > 0) {
-        const action = untriedActions[Math.floor(rng() * untriedActions.length)]!;
-        const nextState = applyAction(node.state, action);
-        const childNode = new MCTSNode(nextState, playerIndex, node);
-        node.children.set(JSON.stringify(action), { action, node: childNode });
-        node = childNode;
-      }
-    }
+    if (!isGameOver(node.state)) {}
 
     // 3. Simulation
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] BooleanLiteral
src/mcts.ts:126:57
     // 2. Expansion
     if (!isGameOver(node.state)) {
       const validActions = getValidActions(node.state, node.state.activePlayerIndex);
-      const untriedActions = validActions.filter((a) => !node.children.has(JSON.stringify(a)));
+      const untriedActions = validActions.filter((a) => node.children.has(JSON.stringify(a)));
 
       if (untriedActions.length > 0) {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ArrowFunction
src/mcts.ts:126:50
     // 2. Expansion
     if (!isGameOver(node.state)) {
       const validActions = getValidActions(node.state, node.state.activePlayerIndex);
-      const untriedActions = validActions.filter((a) => !node.children.has(JSON.stringify(a)));
+      const untriedActions = validActions.filter(() => undefined);
 
       if (untriedActions.length > 0) {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality
