[Killed] BlockStatement
src/deck.ts:20:29
  */
 export function createDeck(): Omit<Card, 'id'>[] {
   const deck: Omit<Card, 'id'>[] = [];
-  for (const suit of SUITS) {
-    for (const rank of RANKS) {
-      let type: Card['type'] = 'number';
-      if (rank === 'A') type = 'ace';
-      else if (rank === 'J') type = 'jack';
-      else if (rank === 'Q') type = 'queen';
-      else if (rank === 'K') type = 'king';
-
-      const value =
-        rank === 'A'
-          ? 1
-          : rank === 'T'
-            ? 10
-            : rank === 'J' || rank === 'Q' || rank === 'K'
-              ? 11
-              : Number(rank);
-
-      deck.push({
-        suit,
-        face: rank,
-        value,
-        type,
-      });
-    }
-  }
+  for (const suit of SUITS) {}
   return deck;
 }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: Action "system:init" is not allowed in phase "gameOver"

[Killed] BlockStatement
src/deck.ts:21:31
 export function createDeck(): Omit<Card, 'id'>[] {
   const deck: Omit<Card, 'id'>[] = [];
   for (const suit of SUITS) {
-    for (const rank of RANKS) {
-      let type: Card['type'] = 'number';
-      if (rank === 'A') type = 'ace';
-      else if (rank === 'J') type = 'jack';
-      else if (rank === 'Q') type = 'queen';
-      else if (rank === 'K') type = 'king';
-
-      const value =
-        rank === 'A'
-          ? 1
-          : rank === 'T'
-            ? 10
-            : rank === 'J' || rank === 'Q' || rank === 'K'
-              ? 11
-              : Number(rank);
-
-      deck.push({
-        suit,
-        face: rank,
-        value,
-        type,
-      });
-    }
+    for (const rank of RANKS) {}
   }
   return deck;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Action "system:init" is not allowed in phase "gameOver"

[Survived] EqualityOperator
src/deck.ts:23:11
   for (const suit of SUITS) {
     for (const rank of RANKS) {
       let type: Card['type'] = 'number';
-      if (rank === 'A') type = 'ace';
+      if (rank !== 'A') type = 'ace';
       else if (rank === 'J') type = 'jack';
       else if (rank === 'Q') type = 'queen';

[Survived] ConditionalExpression
src/deck.ts:23:11
   for (const suit of SUITS) {
     for (const rank of RANKS) {
       let type: Card['type'] = 'number';
-      if (rank === 'A') type = 'ace';
+      if (true) type = 'ace';
       else if (rank === 'J') type = 'jack';
       else if (rank === 'Q') type = 'queen';

[Survived] EqualityOperator
src/deck.ts:24:16
     for (const rank of RANKS) {
       let type: Card['type'] = 'number';
       if (rank === 'A') type = 'ace';
-      else if (rank === 'J') type = 'jack';
+      else if (rank !== 'J') type = 'jack';
       else if (rank === 'Q') type = 'queen';
       else if (rank === 'K') type = 'king';

[Survived] ConditionalExpression
src/deck.ts:24:16
     for (const rank of RANKS) {
       let type: Card['type'] = 'number';
       if (rank === 'A') type = 'ace';
-      else if (rank === 'J') type = 'jack';
+      else if (false) type = 'jack';
       else if (rank === 'Q') type = 'queen';
       else if (rank === 'K') type = 'king';

[Survived] EqualityOperator
src/deck.ts:25:16
       let type: Card['type'] = 'number';
       if (rank === 'A') type = 'ace';
       else if (rank === 'J') type = 'jack';
-      else if (rank === 'Q') type = 'queen';
+      else if (rank !== 'Q') type = 'queen';
       else if (rank === 'K') type = 'king';
 

[Survived] ConditionalExpression
src/deck.ts:25:16
       let type: Card['type'] = 'number';
       if (rank === 'A') type = 'ace';
       else if (rank === 'J') type = 'jack';
-      else if (rank === 'Q') type = 'queen';
+      else if (true) type = 'queen';
       else if (rank === 'K') type = 'king';
 

[Survived] ConditionalExpression
src/deck.ts:26:16
       if (rank === 'A') type = 'ace';
       else if (rank === 'J') type = 'jack';
       else if (rank === 'Q') type = 'queen';
-      else if (rank === 'K') type = 'king';
+      else if (false) type = 'king';
 
       const value =

[Survived] ConditionalExpression
src/deck.ts:26:16
       if (rank === 'A') type = 'ace';
       else if (rank === 'J') type = 'jack';
       else if (rank === 'Q') type = 'queen';
-      else if (rank === 'K') type = 'king';
+      else if (true) type = 'king';
 
       const value =

[Killed] EqualityOperator
src/deck.ts:29:9
       else if (rank === 'K') type = 'king';
 
       const value =
-        rank === 'A'
+        rank !== 'A'
           ? 1
           : rank === 'T'
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=61: p1 card hp=NaN < 0: expected NaN to be greater than or equal to 0

[Killed] ConditionalExpression
src/deck.ts:29:9
       else if (rank === 'K') type = 'king';
 
       const value =
-        rank === 'A'
+        false
           ? 1
           : rank === 'T'
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=63: p1 card hp=NaN < 0: expected NaN to be greater than or equal to 0

[Killed] ConditionalExpression
src/deck.ts:31:13
       const value =
         rank === 'A'
           ? 1
-          : rank === 'T'
+          : true
             ? 10
             : rank === 'J' || rank === 'Q' || rank === 'K'
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/deck.ts:31:13
       const value =
         rank === 'A'
           ? 1
-          : rank === 'T'
+          : false
             ? 10
             : rank === 'J' || rank === 'Q' || rank === 'K'
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=13: p1 card hp=NaN < 0: expected NaN to be greater than or equal to 0

[Killed] LogicalOperator
src/deck.ts:33:15
           ? 1
           : rank === 'T'
             ? 10
-            : rank === 'J' || rank === 'Q' || rank === 'K'
+            : rank === 'J' && rank === 'Q' || rank === 'K'
               ? 11
               : Number(rank);
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: pickRandom called on empty array

[Killed] ConditionalExpression
src/deck.ts:33:31
           ? 1
           : rank === 'T'
             ? 10
-            : rank === 'J' || rank === 'Q' || rank === 'K'
+            : rank === 'J' || false || rank === 'K'
               ? 11
               : Number(rank);
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: pickRandom called on empty array

[Killed] ObjectLiteral
src/deck.ts:37:17
               ? 11
               : Number(rank);
 
-      deck.push({
-        suit,
-        face: rank,
-        value,
-        type,
-      });
+      deck.push({});
     }
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/deck.ts:54:62
  *
  * Seed 0 is reserved for an identity transform (returns unshuffled deck).
  */
-export function shuffleDeck<T>(deck: T[], seed: number): T[] {
-  if (seed === 0) {
-    return [...deck];
-  }
-
-  const shuffled = [...deck];
-  let s = seed >>> 0;
-  for (let i = shuffled.length - 1; i > 0; i--) {
-    // mulberry32 step
-    s = (s + 0x6d2b79f5) | 0;
-    let t = Math.imul(s ^ (s >>> 15), 1 | s);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    const rand = ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-    const j = Math.floor(rand * (i + 1));
-    const si = shuffled[i],
-      sj = shuffled[j];
-    if (si !== undefined && sj !== undefined) {
-      shuffled[i] = sj;
-      shuffled[j] = si;
-    }
-  }
-  return shuffled;
-}
+export function shuffleDeck<T>(deck: T[], seed: number): T[] {}
 
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/deck.ts:55:7
  * Seed 0 is reserved for an identity transform (returns unshuffled deck).
  */
 export function shuffleDeck<T>(deck: T[], seed: number): T[] {
-  if (seed === 0) {
+  if (false) {
     return [...deck];
   }
killedBy: Engine shuffleDeck should return identity transform for Seed 0 (testing purposes)
statusReason: expected [ …(52) ] to deeply equal [ { suit: 'spades', …(3) }, …(51) ]

[Killed] ConditionalExpression
src/deck.ts:55:7
  * Seed 0 is reserved for an identity transform (returns unshuffled deck).
  */
 export function shuffleDeck<T>(deck: T[], seed: number): T[] {
-  if (seed === 0) {
+  if (true) {
     return [...deck];
   }
killedBy: Engine shuffleDeck should produce different order for different seeds
statusReason: expected [ { suit: 'spades', …(3) }, …(51) ] to not deeply equal [ { suit: 'spades', …(3) }, …(51) ]

[Killed] EqualityOperator
src/deck.ts:61:37
 
   const shuffled = [...deck];
   let s = seed >>> 0;
-  for (let i = shuffled.length - 1; i > 0; i--) {
+  for (let i = shuffled.length - 1; i <= 0; i--) {
     // mulberry32 step
     s = (s + 0x6d2b79f5) | 0;
killedBy: Engine shuffleDeck should produce different order for different seeds
statusReason: expected [ { suit: 'spades', …(3) }, …(51) ] to not deeply equal [ { suit: 'spades', …(3) }, …(51) ]

[Killed] ConditionalExpression
src/deck.ts:61:37
 
   const shuffled = [...deck];
   let s = seed >>> 0;
-  for (let i = shuffled.length - 1; i > 0; i--) {
+  for (let i = shuffled.length - 1; false; i--) {
     // mulberry32 step
     s = (s + 0x6d2b79f5) | 0;
killedBy: Engine shuffleDeck should produce different order for different seeds
statusReason: expected [ { suit: 'spades', …(3) }, …(51) ] to not deeply equal [ { suit: 'spades', …(3) }, …(51) ]

[Survived] ArithmeticOperator
src/deck.ts:63:10
   let s = seed >>> 0;
   for (let i = shuffled.length - 1; i > 0; i--) {
     // mulberry32 step
-    s = (s + 0x6d2b79f5) | 0;
+    s = (s - 0x6d2b79f5) | 0;
     let t = Math.imul(s ^ (s >>> 15), 1 | s);
     t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;

[Killed] ArithmeticOperator
src/deck.ts:66:18
     s = (s + 0x6d2b79f5) | 0;
     let t = Math.imul(s ^ (s >>> 15), 1 | s);
     t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    const rand = ((t ^ (t >>> 14)) >>> 0) / 4294967296;
+    const rand = ((t ^ t >>> 14) >>> 0) * 4294967296;
     const j = Math.floor(rand * (i + 1));
     const si = shuffled[i],
killedBy: Engine shuffleDeck should produce different order for different seeds
statusReason: expected [ { suit: 'spades', …(3) }, …(51) ] to not deeply equal [ { suit: 'spades', …(3) }, …(51) ]

[Killed] ArithmeticOperator
src/deck.ts:67:26
     let t = Math.imul(s ^ (s >>> 15), 1 | s);
     t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
     const rand = ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-    const j = Math.floor(rand * (i + 1));
+    const j = Math.floor(rand / (i + 1));
     const si = shuffled[i],
       sj = shuffled[j];
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Survived] ArithmeticOperator
src/deck.ts:67:34
     let t = Math.imul(s ^ (s >>> 15), 1 | s);
     t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
     const rand = ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-    const j = Math.floor(rand * (i + 1));
+    const j = Math.floor(rand * (i - 1));
     const si = shuffled[i],
       sj = shuffled[j];

[Killed] BlockStatement
src/deck.ts:70:47
     const j = Math.floor(rand * (i + 1));
     const si = shuffled[i],
       sj = shuffled[j];
-    if (si !== undefined && sj !== undefined) {
-      shuffled[i] = sj;
-      shuffled[j] = si;
-    }
+    if (si !== undefined && sj !== undefined) {}
   }
   return shuffled;
killedBy: Engine shuffleDeck should produce different order for different seeds
statusReason: expected [ { suit: 'spades', …(3) }, …(51) ] to not deeply equal [ { suit: 'spades', …(3) }, …(51) ]

[Killed] ConditionalExpression
src/deck.ts:70:9
     const j = Math.floor(rand * (i + 1));
     const si = shuffled[i],
       sj = shuffled[j];
-    if (si !== undefined && sj !== undefined) {
+    if (false) {
       shuffled[i] = sj;
       shuffled[j] = si;
killedBy: Engine shuffleDeck should produce different order for different seeds
statusReason: expected [ { suit: 'spades', …(3) }, …(51) ] to not deeply equal [ { suit: 'spades', …(3) }, …(51) ]
