[Killed] BlockStatement
src/mcts.ts:128:38
       const validActions = getValidActions(node.state, node.state.activePlayerIndex);
       const untriedActions = validActions.filter((a) => !node.children.has(JSON.stringify(a)));
 
-      if (untriedActions.length > 0) {
-        const action = untriedActions[Math.floor(rng() * untriedActions.length)]!;
-        const nextState = applyAction(node.state, action);
-        const childNode = new MCTSNode(nextState, playerIndex, node);
-        node.children.set(JSON.stringify(action), { action, node: childNode });
-        node = childNode;
-      }
+      if (untriedActions.length > 0) {}
     }
 
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:128:11
       const validActions = getValidActions(node.state, node.state.activePlayerIndex);
       const untriedActions = validActions.filter((a) => !node.children.has(JSON.stringify(a)));
 
-      if (untriedActions.length > 0) {
+      if (false) {
         const action = untriedActions[Math.floor(rng() * untriedActions.length)]!;
         const nextState = applyAction(node.state, action);
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ArithmeticOperator
src/mcts.ts:129:50
       const untriedActions = validActions.filter((a) => !node.children.has(JSON.stringify(a)));
 
       if (untriedActions.length > 0) {
-        const action = untriedActions[Math.floor(rng() * untriedActions.length)]!;
+        const action = untriedActions[Math.floor(rng() / untriedActions.length)]!;
         const nextState = applyAction(node.state, action);
         const childNode = new MCTSNode(nextState, playerIndex, node);
killedBy: MCTS Strategy Depth returns a valid action in DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ObjectLiteral
src/mcts.ts:132:51
         const action = untriedActions[Math.floor(rng() * untriedActions.length)]!;
         const nextState = applyAction(node.state, action);
         const childNode = new MCTSNode(nextState, playerIndex, node);
-        node.children.set(JSON.stringify(action), { action, node: childNode });
+        node.children.set(JSON.stringify(action), {});
         node = childNode;
       }
killedBy: MCTS Strategy Depth returns a valid action in DeploymentPhase
statusReason: Cannot read properties of undefined (reading 'visits')

[Timeout] BlockStatement
src/mcts.ts:141:62
     let simulationState = node.state;
     let depth = 0;
     const maxDepth = 100; // Prevent infinite loops
-    while (!isGameOver(simulationState) && depth < maxDepth) {
-      const actions = getValidActions(simulationState, simulationState.activePlayerIndex);
-      if (actions.length === 0) break;
-      const randomAction = actions[Math.floor(rng() * actions.length)]!;
-      simulationState = applyAction(simulationState, randomAction);
-      depth++;
-    }
+    while (!isGameOver(simulationState) && depth < maxDepth) {}
 
     // 4. Backpropagation

[Survived] EqualityOperator
src/mcts.ts:141:44
     let simulationState = node.state;
     let depth = 0;
     const maxDepth = 100; // Prevent infinite loops
-    while (!isGameOver(simulationState) && depth < maxDepth) {
+    while (!isGameOver(simulationState) && depth >= maxDepth) {
       const actions = getValidActions(simulationState, simulationState.activePlayerIndex);
       if (actions.length === 0) break;

[Survived] ConditionalExpression
src/mcts.ts:143:11
     const maxDepth = 100; // Prevent infinite loops
     while (!isGameOver(simulationState) && depth < maxDepth) {
       const actions = getValidActions(simulationState, simulationState.activePlayerIndex);
-      if (actions.length === 0) break;
+      if (false) break;
       const randomAction = actions[Math.floor(rng() * actions.length)]!;
       simulationState = applyAction(simulationState, randomAction);

[Survived] EqualityOperator
src/mcts.ts:143:11
     const maxDepth = 100; // Prevent infinite loops
     while (!isGameOver(simulationState) && depth < maxDepth) {
       const actions = getValidActions(simulationState, simulationState.activePlayerIndex);
-      if (actions.length === 0) break;
+      if (actions.length !== 0) break;
       const randomAction = actions[Math.floor(rng() * actions.length)]!;
       simulationState = applyAction(simulationState, randomAction);

[Survived] ArithmeticOperator
src/mcts.ts:144:47
     while (!isGameOver(simulationState) && depth < maxDepth) {
       const actions = getValidActions(simulationState, simulationState.activePlayerIndex);
       if (actions.length === 0) break;
-      const randomAction = actions[Math.floor(rng() * actions.length)]!;
+      const randomAction = actions[Math.floor(rng() / actions.length)]!;
       simulationState = applyAction(simulationState, randomAction);
       depth++;

[Survived] UpdateOperator
src/mcts.ts:146:7
       if (actions.length === 0) break;
       const randomAction = actions[Math.floor(rng() * actions.length)]!;
       simulationState = applyAction(simulationState, randomAction);
-      depth++;
+      depth--;
     }
 

[Survived] ConditionalExpression
src/mcts.ts:151:27
 
     // 4. Backpropagation
     const victory = checkVictory(simulationState);
-    const won = victory ? victory.winnerIndex === playerIndex : false;
+    const won = victory ? true : false;
     const hValue = evaluateState(simulationState, playerIndex);
 

[Survived] BooleanLiteral
src/mcts.ts:151:65
 
     // 4. Backpropagation
     const victory = checkVictory(simulationState);
-    const won = victory ? victory.winnerIndex === playerIndex : false;
+    const won = victory ? victory.winnerIndex === playerIndex : true;
     const hValue = evaluateState(simulationState, playerIndex);
 

[Killed] ConditionalExpression
src/mcts.ts:155:12
     const hValue = evaluateState(simulationState, playerIndex);
 
     let backpropNode: MCTSNode | null = node;
-    while (backpropNode) {
+    while (false) {
       backpropNode.visits++;
       if (won) backpropNode.wins++;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Timeout] BlockStatement
src/mcts.ts:155:26
     const hValue = evaluateState(simulationState, playerIndex);
 
     let backpropNode: MCTSNode | null = node;
-    while (backpropNode) {
-      backpropNode.visits++;
-      if (won) backpropNode.wins++;
-      backpropNode.totalValue += hValue;
-      backpropNode = backpropNode.parent;
-    }
+    while (backpropNode) {}
   }
 

[Killed] UpdateOperator
src/mcts.ts:156:7
 
     let backpropNode: MCTSNode | null = node;
     while (backpropNode) {
-      backpropNode.visits++;
+      backpropNode.visits--;
       if (won) backpropNode.wins++;
       backpropNode.totalValue += hValue;
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] UpdateOperator
src/mcts.ts:157:16
     let backpropNode: MCTSNode | null = node;
     while (backpropNode) {
       backpropNode.visits++;
-      if (won) backpropNode.wins++;
+      if (won) backpropNode.wins--;
       backpropNode.totalValue += hValue;
       backpropNode = backpropNode.parent;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'forfeit' to be 'attack' // Object.is equality

[Survived] ConditionalExpression
src/mcts.ts:157:11
     let backpropNode: MCTSNode | null = node;
     while (backpropNode) {
       backpropNode.visits++;
-      if (won) backpropNode.wins++;
+      if (false) backpropNode.wins++;
       backpropNode.totalValue += hValue;
       backpropNode = backpropNode.parent;

[Survived] AssignmentOperator
src/mcts.ts:158:7
     while (backpropNode) {
       backpropNode.visits++;
       if (won) backpropNode.wins++;
-      backpropNode.totalValue += hValue;
+      backpropNode.totalValue -= hValue;
       backpropNode = backpropNode.parent;
     }

[Killed] UnaryOperator
src/mcts.ts:165:19
 
   // Choose the best action (most visited child)
   let bestAction: Action | null = null;
-  let maxVisits = -1;
+  let maxVisits = +1;
 
   for (const { action, node: child } of root.children.values()) {
killedBy: MCTS Strategy Depth returns a valid action in DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] BlockStatement
src/mcts.ts:167:65
   let bestAction: Action | null = null;
   let maxVisits = -1;
 
-  for (const { action, node: child } of root.children.values()) {
-    if (child.visits > maxVisits) {
-      maxVisits = child.visits;
-      bestAction = action;
-    }
-  }
+  for (const { action, node: child } of root.children.values()) {}
 
   if (!bestAction) {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:168:9
   let maxVisits = -1;
 
   for (const { action, node: child } of root.children.values()) {
-    if (child.visits > maxVisits) {
+    if (false) {
       maxVisits = child.visits;
       bestAction = action;
killedBy: MCTS Strategy Depth returns a valid action in DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] EqualityOperator
src/mcts.ts:168:9
   let maxVisits = -1;
 
   for (const { action, node: child } of root.children.values()) {
-    if (child.visits > maxVisits) {
+    if (child.visits <= maxVisits) {
       maxVisits = child.visits;
       bestAction = action;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'forfeit' to be 'attack' // Object.is equality

[Killed] ConditionalExpression
src/mcts.ts:174:7
     }
   }
 
-  if (!bestAction) {
+  if (false) {
     const fallbackActions = getValidActions(initialState, initialState.activePlayerIndex);
     return (
killedBy: MCTS Strategy Depth handles game over state gracefully
statusReason: Cannot read properties of null (reading 'type')

[Killed] BlockStatement
src/mcts.ts:174:20
     }
   }
 
-  if (!bestAction) {
-    const fallbackActions = getValidActions(initialState, initialState.activePlayerIndex);
-    return (
-      fallbackActions[0] || { type: 'pass', playerIndex, timestamp: '1970-01-01T00:00:00.000Z' }
-    );
-  }
+  if (!bestAction) {}
 
   return bestAction;
killedBy: Bot Adversarial Paths The "What are you doing here" path handles computeBotAction when phase is gameOver
statusReason: Cannot read properties of null (reading 'type')

[Killed] ConditionalExpression
src/mcts.ts:177:7
   if (!bestAction) {
     const fallbackActions = getValidActions(initialState, initialState.activePlayerIndex);
     return (
-      fallbackActions[0] || { type: 'pass', playerIndex, timestamp: '1970-01-01T00:00:00.000Z' }
+      true
     );
   }
killedBy: Bot Adversarial Paths The "What are you doing here" path handles computeBotAction when phase is gameOver
statusReason: expected undefined to be 'pass' // Object.is equality

[Killed] LogicalOperator
src/mcts.ts:177:7
   if (!bestAction) {
     const fallbackActions = getValidActions(initialState, initialState.activePlayerIndex);
     return (
-      fallbackActions[0] || { type: 'pass', playerIndex, timestamp: '1970-01-01T00:00:00.000Z' }
+      fallbackActions[0] && {
+  type: 'pass',
+  playerIndex,
+  timestamp: '1970-01-01T00:00:00.000Z'
+}
     );
   }
killedBy: MCTS Strategy Depth handles game over state gracefully
statusReason: Cannot read properties of undefined (reading 'type')
