[NoCoverage] BlockStatement
src/events.ts:12:39
 import type { TransactionLogEntry, PhalanxEvent } from '@phalanxduel/shared';
 import { TelemetryName, deriveCombatResolution } from '@phalanxduel/shared';
 
-function assertNever(x: never): never {
-  throw new Error(`Unhandled details type: ${JSON.stringify(x)}`);
-}
+function assertNever(x: never): never {}
 
 /**

[NoCoverage] StringLiteral
src/events.ts:13:19
 import { TelemetryName, deriveCombatResolution } from '@phalanxduel/shared';
 
 function assertNever(x: never): never {
-  throw new Error(`Unhandled details type: ${JSON.stringify(x)}`);
+  throw new Error(``);
 }
 

[Killed] ArrowFunction
src/events.ts:28:18
   const events: PhalanxEvent[] = [];
   let idx = 0;
 
-  const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx++}`;
+  const makeId = () => undefined;
   const turnSpanId = `${matchId}:seq${entry.sequenceNumber}:turn`;
   const phaseSpanIds = (entry.phaseTrace ?? []).map(
killedBy: PHX-EV-001: deriveEventsFromEntry AC #4 + #1: deterministic IDs and function signature assigns IDs following ${matchId}:seq${seqNum}:ev${index} pattern
statusReason: expected undefined to be 'test-match-id:seq2:ev0' // Object.is equality

[Killed] UpdateOperator
src/events.ts:28:75
   const events: PhalanxEvent[] = [];
   let idx = 0;
 
-  const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx++}`;
+  const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx--}`;
   const turnSpanId = `${matchId}:seq${entry.sequenceNumber}:turn`;
   const phaseSpanIds = (entry.phaseTrace ?? []).map(
killedBy: PHX-EV-001: deriveEventsFromEntry AC #4 + #1: deterministic IDs and function signature assigns IDs following ${matchId}:seq${seqNum}:ev${index} pattern
statusReason: expected 'test-match-id:seq2:ev-1' to be 'test-match-id:seq2:ev1' // Object.is equality

[Killed] StringLiteral
src/events.ts:29:22
   let idx = 0;
 
   const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx++}`;
-  const turnSpanId = `${matchId}:seq${entry.sequenceNumber}:turn`;
+  const turnSpanId = ``;
   const phaseSpanIds = (entry.phaseTrace ?? []).map(
     (_hop, hopIndex) => `${turnSpanId}:phase${hopIndex}`,
killedBy: PHX-EV-001: deriveEventsFromEntry timestamp and parentId span events have turnSpanId as parentId
statusReason: expected '' to be 'test-match-id:seq2:turn' // Object.is equality

[Killed] LogicalOperator
src/events.ts:30:25
 
   const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx++}`;
   const turnSpanId = `${matchId}:seq${entry.sequenceNumber}:turn`;
-  const phaseSpanIds = (entry.phaseTrace ?? []).map(
+  const phaseSpanIds = (entry.phaseTrace && []).map(
     (_hop, hopIndex) => `${turnSpanId}:phase${hopIndex}`,
   );
killedBy: PHX-EV-001: deriveEventsFromEntry timestamp and parentId phase spans include a stable spanId payload so starts and ends can be paired
statusReason: expected [ undefined, undefined ] to deeply equal [ …(2) ]

[NoCoverage] ArrayDeclaration
src/events.ts:30:45
 
   const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx++}`;
   const turnSpanId = `${matchId}:seq${entry.sequenceNumber}:turn`;
-  const phaseSpanIds = (entry.phaseTrace ?? []).map(
+  const phaseSpanIds = (entry.phaseTrace ?? ["Stryker was here"]).map(
     (_hop, hopIndex) => `${turnSpanId}:phase${hopIndex}`,
   );

[Killed] ArrowFunction
src/events.ts:31:5
   const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx++}`;
   const turnSpanId = `${matchId}:seq${entry.sequenceNumber}:turn`;
   const phaseSpanIds = (entry.phaseTrace ?? []).map(
-    (_hop, hopIndex) => `${turnSpanId}:phase${hopIndex}`,
+    () => undefined,
   );
 
killedBy: PHX-EV-001: deriveEventsFromEntry timestamp and parentId phase spans include a stable spanId payload so starts and ends can be paired
statusReason: expected [ undefined, undefined ] to deeply equal [ …(2) ]

[Killed] StringLiteral
src/events.ts:31:25
   const makeId = (): string => `${matchId}:seq${entry.sequenceNumber}:ev${idx++}`;
   const turnSpanId = `${matchId}:seq${entry.sequenceNumber}:turn`;
   const phaseSpanIds = (entry.phaseTrace ?? []).map(
-    (_hop, hopIndex) => `${turnSpanId}:phase${hopIndex}`,
+    (_hop, hopIndex) => ``,
   );
 
killedBy: PHX-EV-001: deriveEventsFromEntry timestamp and parentId phase spans include a stable spanId payload so starts and ends can be paired
statusReason: expected [ '', '' ] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/events.ts:34:17
     (_hop, hopIndex) => `${turnSpanId}:phase${hopIndex}`,
   );
 
-  const trace = entry.phaseTrace ?? [];
+  const trace = entry.phaseTrace && [];
 
   const pushPhaseStart = (hopIndex: number): void => {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PHASE_START for span_started events
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/events.ts:36:54
 
   const trace = entry.phaseTrace ?? [];
 
-  const pushPhaseStart = (hopIndex: number): void => {
-    const hop = trace[hopIndex];
-    if (!hop) return;
-    events.push({
-      id: makeId(),
-      parentId: turnSpanId,
-      type: 'span_started',
-      name: TelemetryName.EVENT_PHASE_START,
-      timestamp: entry.timestamp,
-      payload: {
-        spanId: phaseSpanIds[hopIndex],
-        from: hop.from,
-        trigger: hop.trigger,
-        to: hop.to,
-      },
-      status: 'ok',
-    });
-  };
+  const pushPhaseStart = (hopIndex: number): void => {};
 
   const pushPhaseEnd = (hopIndex: number): void => {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PHASE_START for span_started events
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/events.ts:38:9
 
   const pushPhaseStart = (hopIndex: number): void => {
     const hop = trace[hopIndex];
-    if (!hop) return;
+    if (true) return;
     events.push({
       id: makeId(),
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PHASE_START for span_started events
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/events.ts:38:9
 
   const pushPhaseStart = (hopIndex: number): void => {
     const hop = trace[hopIndex];
-    if (!hop) return;
+    if (hop) return;
     events.push({
       id: makeId(),
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PHASE_START for span_started events
statusReason: expected 0 to be greater than 0

[Killed] ObjectLiteral
src/events.ts:39:17
   const pushPhaseStart = (hopIndex: number): void => {
     const hop = trace[hopIndex];
     if (!hop) return;
-    events.push({
-      id: makeId(),
-      parentId: turnSpanId,
-      type: 'span_started',
-      name: TelemetryName.EVENT_PHASE_START,
-      timestamp: entry.timestamp,
-      payload: {
-        spanId: phaseSpanIds[hopIndex],
-        from: hop.from,
-        trigger: hop.trigger,
-        to: hop.to,
-      },
-      status: 'ok',
-    });
+    events.push({});
   };
 
killedBy: PHX-EV-001: deriveEventsFromEntry AC #4 + #1: deterministic IDs and function signature assigns IDs following ${matchId}:seq${seqNum}:ev${index} pattern
statusReason: expected undefined to be 'test-match-id:seq2:ev0' // Object.is equality

[Killed] ObjectLiteral
src/events.ts:45:16
       type: 'span_started',
       name: TelemetryName.EVENT_PHASE_START,
       timestamp: entry.timestamp,
-      payload: {
-        spanId: phaseSpanIds[hopIndex],
-        from: hop.from,
-        trigger: hop.trigger,
-        to: hop.to,
-      },
+      payload: {},
       status: 'ok',
     });
killedBy: PHX-EV-001: deriveEventsFromEntry timestamp and parentId phase spans include a stable spanId payload so starts and ends can be paired
statusReason: expected [ undefined, undefined ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/events.ts:55:52
     });
   };
 
-  const pushPhaseEnd = (hopIndex: number): void => {
-    const hop = trace[hopIndex];
-    if (!hop) return;
-    events.push({
-      id: makeId(),
-      parentId: turnSpanId,
-      type: 'span_ended',
-      name: TelemetryName.EVENT_PHASE_END,
-      timestamp: entry.timestamp,
-      payload: {
-        spanId: phaseSpanIds[hopIndex],
-        from: hop.from,
-        trigger: hop.trigger,
-        to: hop.to,
-      },
-      status: 'ok',
-    });
-  };
+  const pushPhaseEnd = (hopIndex: number): void => {};
 
   const currentPhaseParentId = phaseSpanIds[0] ?? turnSpanId;
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PHASE_END for span_ended events
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/events.ts:74:32
     });
   };
 
-  const currentPhaseParentId = phaseSpanIds[0] ?? turnSpanId;
+  const currentPhaseParentId = phaseSpanIds[0] && turnSpanId;
 
   if (trace.length > 0) {
killedBy: PHX-EV-001: deriveEventsFromEntry timestamp and parentId functional updates attach to the active phase span when a phase trace exists
statusReason: expected 'test-match-id:seq2:turn' to be 'test-match-id:seq2:turn:phase0' // Object.is equality

[Killed] ConditionalExpression
src/events.ts:76:7
 
   const currentPhaseParentId = phaseSpanIds[0] ?? turnSpanId;
 
-  if (trace.length > 0) {
+  if (false) {
     pushPhaseStart(0);
   }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved emits span_started for each phase hop
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/events.ts:76:7
 
   const currentPhaseParentId = phaseSpanIds[0] ?? turnSpanId;
 
-  if (trace.length > 0) {
+  if (trace.length <= 0) {
     pushPhaseStart(0);
   }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved emits span_started for each phase hop
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/events.ts:83:7
   // --- Functional update(s) based on action / detail type ---
 
   // system:init reuses details.type === 'pass' — detect via action.type first
-  if (entry.action.type === 'system:init') {
+  if (true) {
     events.push({
       id: makeId(),
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_DEPLOY for deploy functional_update
statusReason: expected 'game.init' to be 'game.deploy' // Object.is equality

[Killed] ConditionalExpression
src/events.ts:83:7
   // --- Functional update(s) based on action / detail type ---
 
   // system:init reuses details.type === 'pass' — detect via action.type first
-  if (entry.action.type === 'system:init') {
+  if (false) {
     events.push({
       id: makeId(),
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_INIT for system:init functional_update
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/events.ts:91:15
       name: TelemetryName.EVENT_INIT,
       timestamp: entry.timestamp,
       payload: {},
-      status: 'ok',
+      status: "",
     });
   } else {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from system:init pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/events.ts:103:15
             target: step.target,
             damage: step.damage,
           };
-          if (step.card !== undefined) payload.card = step.card;
+          if (true) payload.card = step.card;
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;

[Survived] EqualityOperator
src/events.ts:103:15
             target: step.target,
             damage: step.damage,
           };
-          if (step.card !== undefined) payload.card = step.card;
+          if (step.card === undefined) payload.card = step.card;
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;

[Survived] ConditionalExpression
src/events.ts:104:15
             damage: step.damage,
           };
           if (step.card !== undefined) payload.card = step.card;
-          if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
+          if (true) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;

[Survived] EqualityOperator
src/events.ts:104:15
             damage: step.damage,
           };
           if (step.card !== undefined) payload.card = step.card;
-          if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
+          if (step.incomingDamage === undefined) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;

[Survived] ConditionalExpression
src/events.ts:105:15
           };
           if (step.card !== undefined) payload.card = step.card;
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
-          if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
+          if (false) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;

[Survived] ConditionalExpression
src/events.ts:105:15
           };
           if (step.card !== undefined) payload.card = step.card;
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
-          if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
+          if (true) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;

[Survived] ConditionalExpression
src/events.ts:106:15
           if (step.card !== undefined) payload.card = step.card;
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
-          if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
+          if (false) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;

[Survived] ConditionalExpression
src/events.ts:106:15
           if (step.card !== undefined) payload.card = step.card;
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
-          if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
+          if (true) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;

[Survived] ConditionalExpression
src/events.ts:107:15
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
-          if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
+          if (true) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;

[Survived] ConditionalExpression
src/events.ts:107:15
           if (step.incomingDamage !== undefined) payload.incomingDamage = step.incomingDamage;
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
-          if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
+          if (false) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;

[Survived] EqualityOperator
src/events.ts:108:15
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
-          if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
+          if (step.lpBefore === undefined) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;

[Survived] ConditionalExpression
src/events.ts:108:15
           if (step.effectiveHp !== undefined) payload.effectiveHp = step.effectiveHp;
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
-          if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
+          if (true) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;

[Survived] ConditionalExpression
src/events.ts:109:15
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
-          if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
+          if (false) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;

[Survived] EqualityOperator
src/events.ts:109:15
           if (step.hpBefore !== undefined) payload.hpBefore = step.hpBefore;
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
-          if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
+          if (step.lpAfter === undefined) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;

[Survived] ConditionalExpression
src/events.ts:110:15
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
-          if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
+          if (false) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;
           if (step.destroyed !== undefined) payload.destroyed = step.destroyed;

[Survived] ConditionalExpression
src/events.ts:110:15
           if (step.hpAfter !== undefined) payload.hpAfter = step.hpAfter;
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
-          if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
+          if (true) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;
           if (step.destroyed !== undefined) payload.destroyed = step.destroyed;

[Survived] ConditionalExpression
src/events.ts:111:15
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
-          if (step.overflow !== undefined) payload.overflow = step.overflow;
+          if (false) payload.overflow = step.overflow;
           if (step.destroyed !== undefined) payload.destroyed = step.destroyed;
           if (step.bonuses !== undefined) payload.bonuses = step.bonuses;

[Survived] EqualityOperator
src/events.ts:111:15
           if (step.lpBefore !== undefined) payload.lpBefore = step.lpBefore;
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
-          if (step.overflow !== undefined) payload.overflow = step.overflow;
+          if (step.overflow === undefined) payload.overflow = step.overflow;
           if (step.destroyed !== undefined) payload.destroyed = step.destroyed;
           if (step.bonuses !== undefined) payload.bonuses = step.bonuses;

[Killed] EqualityOperator
src/events.ts:112:15
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;
-          if (step.destroyed !== undefined) payload.destroyed = step.destroyed;
+          if (step.destroyed === undefined) payload.destroyed = step.destroyed;
           if (step.bonuses !== undefined) payload.bonuses = step.bonuses;
 
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved includes target, damage, destroyed, and bonuses in combat step payload
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/events.ts:112:15
           if (step.lpAfter !== undefined) payload.lpAfter = step.lpAfter;
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;
-          if (step.destroyed !== undefined) payload.destroyed = step.destroyed;
+          if (false) payload.destroyed = step.destroyed;
           if (step.bonuses !== undefined) payload.bonuses = step.bonuses;
 
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved includes target, damage, destroyed, and bonuses in combat step payload
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/events.ts:113:15
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;
           if (step.destroyed !== undefined) payload.destroyed = step.destroyed;
-          if (step.bonuses !== undefined) payload.bonuses = step.bonuses;
+          if (true) payload.bonuses = step.bonuses;
 
           events.push({
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved omits optional fields when undefined (no bonuses on second step)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/events.ts:113:15
           if (step.absorbed !== undefined) payload.absorbed = step.absorbed;
           if (step.overflow !== undefined) payload.overflow = step.overflow;
           if (step.destroyed !== undefined) payload.destroyed = step.destroyed;
-          if (step.bonuses !== undefined) payload.bonuses = step.bonuses;
+          if (false) payload.bonuses = step.bonuses;
 
           events.push({
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved includes target, damage, destroyed, and bonuses in combat step payload
statusReason: expected undefined to deeply equal []

[Killed] ObjectLiteral
src/events.ts:115:23
           if (step.destroyed !== undefined) payload.destroyed = step.destroyed;
           if (step.bonuses !== undefined) payload.bonuses = step.bonuses;
 
-          events.push({
-            id: makeId(),
-            parentId: currentPhaseParentId,
-            type: 'functional_update',
-            name: TelemetryName.EVENT_COMBAT_STEP,
-            timestamp: entry.timestamp,
-            payload,
-            status: 'ok',
-          });
+          events.push({});
         }
 
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from attack pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/events.ts:118:19
           events.push({
             id: makeId(),
             parentId: currentPhaseParentId,
-            type: 'functional_update',
+            type: "",
             name: TelemetryName.EVENT_COMBAT_STEP,
             timestamp: entry.timestamp,
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from attack pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/events.ts:127:67
         }
 
         // Rolled-up resolution summary — one per attack, after all per-step events.
-        const resolution = deriveCombatResolution(details.combat, {
-          reinforcementTriggered: details.reinforcementTriggered,
-          victoryTriggered: details.victoryTriggered,
-        });
+        const resolution = deriveCombatResolution(details.combat, {});
         events.push({
           id: makeId(),
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] StringLiteral
src/events.ts:138:19
           name: TelemetryName.EVENT_ATTACK_RESOLVED,
           timestamp: entry.timestamp,
           payload: resolution as unknown as Record<string, unknown>,
-          status: 'ok',
+          status: "",
         });
         break;
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from attack pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/events.ts:143:22
         break;
       }
 
-      case 'deploy': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_DEPLOY,
-          timestamp: entry.timestamp,
-          payload: { gridIndex: details.gridIndex, phaseAfter: details.phaseAfter },
-          status: 'ok',
-        });
-        break;
-      }
+      case 'deploy': {}
 
       case 'reinforce': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_DEPLOY for deploy functional_update
statusReason: expected 'game.reinforce.action' to be 'game.deploy' // Object.is equality

[Killed] ConditionalExpression
src/events.ts:143:7
         break;
       }
 
-      case 'deploy': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_DEPLOY,
-          timestamp: entry.timestamp,
-          payload: { gridIndex: details.gridIndex, phaseAfter: details.phaseAfter },
-          status: 'ok',
-        });
-        break;
-      }
+      case 'deploy':
 
       case 'reinforce': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_DEPLOY for deploy functional_update
statusReason: expected 'game.reinforce.action' to be 'game.deploy' // Object.is equality

[Killed] ObjectLiteral
src/events.ts:150:20
           type: 'functional_update',
           name: TelemetryName.EVENT_DEPLOY,
           timestamp: entry.timestamp,
-          payload: { gridIndex: details.gridIndex, phaseAfter: details.phaseAfter },
+          payload: {},
           status: 'ok',
         });
killedBy: PHX-EV-001: deriveEventsFromEntry AC #3: non-attack actions emit functional_update + phase spans deploy: emits functional_update with gridIndex and phaseAfter
statusReason: expected 'undefined' to be 'number' // Object.is equality

[Killed] BlockStatement
src/events.ts:156:25
         break;
       }
 
-      case 'reinforce': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_REINFORCE,
-          timestamp: entry.timestamp,
-          payload: {
-            column: details.column,
-            gridIndex: details.gridIndex,
-            cardsDrawn: details.cardsDrawn,
-          },
-          status: 'ok',
-        });
-        break;
-      }
+      case 'reinforce': {}
 
       case 'pass': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_REINFORCE for reinforce functional_update
statusReason: expected 'game.pass' to be 'game.reinforce.action' // Object.is equality
