[Killed] ConditionalExpression
src/events.ts:156:7
         break;
       }
 
-      case 'reinforce': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_REINFORCE,
-          timestamp: entry.timestamp,
-          payload: {
-            column: details.column,
-            gridIndex: details.gridIndex,
-            cardsDrawn: details.cardsDrawn,
-          },
-          status: 'ok',
-        });
-        break;
-      }
+      case 'reinforce':
 
       case 'pass': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_REINFORCE for reinforce functional_update
statusReason: expected 'game.pass' to be 'game.reinforce.action' // Object.is equality

[Killed] ObjectLiteral
src/events.ts:157:21
       }
 
       case 'reinforce': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_REINFORCE,
-          timestamp: entry.timestamp,
-          payload: {
-            column: details.column,
-            gridIndex: details.gridIndex,
-            cardsDrawn: details.cardsDrawn,
-          },
-          status: 'ok',
-        });
+        events.push({});
         break;
       }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from reinforce pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/events.ts:168:19
             gridIndex: details.gridIndex,
             cardsDrawn: details.cardsDrawn,
           },
-          status: 'ok',
+          status: "",
         });
         break;
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from reinforce pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/events.ts:173:7
         break;
       }
 
-      case 'pass': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_PASS,
-          timestamp: entry.timestamp,
-          payload: {},
-          status: 'ok',
-        });
-        break;
-      }
+      case 'pass':
 
       case 'forfeit': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PASS for pass functional_update
statusReason: expected 'game.forfeit' to be 'game.pass' // Object.is equality

[Killed] BlockStatement
src/events.ts:173:20
         break;
       }
 
-      case 'pass': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_PASS,
-          timestamp: entry.timestamp,
-          payload: {},
-          status: 'ok',
-        });
-        break;
-      }
+      case 'pass': {}
 
       case 'forfeit': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PASS for pass functional_update
statusReason: expected 'game.forfeit' to be 'game.pass' // Object.is equality

[Killed] ConditionalExpression
src/events.ts:186:7
         break;
       }
 
-      case 'forfeit': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_FORFEIT,
-          timestamp: entry.timestamp,
-          payload: { winnerIndex: details.winnerIndex },
-          status: 'ok',
-        });
-        break;
-      }
+      case 'forfeit':
 
       case 'system:init': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_FORFEIT for forfeit functional_update
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/events.ts:186:23
         break;
       }
 
-      case 'forfeit': {
-        events.push({
-          id: makeId(),
-          parentId: currentPhaseParentId,
-          type: 'functional_update',
-          name: TelemetryName.EVENT_FORFEIT,
-          timestamp: entry.timestamp,
-          payload: { winnerIndex: details.winnerIndex },
-          status: 'ok',
-        });
-        break;
-      }
+      case 'forfeit': {}
 
       case 'system:init': {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_FORFEIT for forfeit functional_update
statusReason: expected +0 to be 1 // Object.is equality

[NoCoverage] ConditionalExpression
src/events.ts:199:7
         break;
       }
 
-      case 'system:init': {
-        // system:init doesn't produce specific functional events yet,
-        // but it moves phases which is handled by the trace loop below.
-        break;
-      }
+      case 'system:init':
 
       default:

[NoCoverage] BlockStatement
src/events.ts:199:27
         break;
       }
 
-      case 'system:init': {
-        // system:init doesn't produce specific functional events yet,
-        // but it moves phases which is handled by the trace loop below.
-        break;
-      }
+      case 'system:init': {}
 
       default:

[NoCoverage] ConditionalExpression
src/events.ts:205:7
         break;
       }
 
-      default:
-        assertNever(details);
+      default:
     }
   }

[Killed] BlockStatement
src/events.ts:210:63
     }
   }
 
-  for (let hopIndex = 0; hopIndex < trace.length; hopIndex++) {
-    if (hopIndex > 0) {
-      pushPhaseStart(hopIndex);
-    }
-    pushPhaseEnd(hopIndex);
-  }
+  for (let hopIndex = 0; hopIndex < trace.length; hopIndex++) {}
 
   return events;
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PHASE_END for span_ended events
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/events.ts:210:26
     }
   }
 
-  for (let hopIndex = 0; hopIndex < trace.length; hopIndex++) {
+  for (let hopIndex = 0; hopIndex >= trace.length; hopIndex++) {
     if (hopIndex > 0) {
       pushPhaseStart(hopIndex);
killedBy: PHX-EV-001: deriveEventsFromEntry AC #5: TelemetryName constants (no freehand strings) uses TelemetryName.EVENT_PHASE_END for span_ended events
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/events.ts:211:9
   }
 
   for (let hopIndex = 0; hopIndex < trace.length; hopIndex++) {
-    if (hopIndex > 0) {
+    if (hopIndex >= 0) {
       pushPhaseStart(hopIndex);
     }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved emits span_started for each phase hop
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/events.ts:211:9
   }
 
   for (let hopIndex = 0; hopIndex < trace.length; hopIndex++) {
-    if (hopIndex > 0) {
+    if (true) {
       pushPhaseStart(hopIndex);
     }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #2: attack action emits spans + functional_updates per CombatLogStep + resolved emits span_started for each phase hop
statusReason: expected 3 to be 2 // Object.is equality
