[Killed] BlockStatement
src/projection.ts:11:32
 export class GameProjection {
   constructor(private readonly state: GameState) {}
 
-  public get matchId(): string {
-    return this.state.matchId;
-  }
+  public get matchId(): string {}
 
   public get isGameOver(): boolean {
killedBy: GameProjection exposes matchId
statusReason: expected undefined to be '00000000-0000-0000-0000-000000000001' // Object.is equality

[Killed] BlockStatement
src/projection.ts:15:36
     return this.state.matchId;
   }
 
-  public get isGameOver(): boolean {
-    return this.state.phase === 'gameOver';
-  }
+  public get isGameOver(): boolean {}
 
   public get outcome(): GameState['outcome'] {
killedBy: GameProjection reports isGameOver as false for an active match
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/projection.ts:16:12
   }
 
   public get isGameOver(): boolean {
-    return this.state.phase === 'gameOver';
+    return this.state.phase !== 'gameOver';
   }
 
killedBy: GameProjection reports isGameOver as false for an active match
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:16:12
   }
 
   public get isGameOver(): boolean {
-    return this.state.phase === 'gameOver';
+    return true;
   }
 
killedBy: GameProjection reports isGameOver as false for an active match
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/projection.ts:19:46
     return this.state.phase === 'gameOver';
   }
 
-  public get outcome(): GameState['outcome'] {
-    return this.state.outcome ?? null;
-  }
+  public get outcome(): GameState['outcome'] {}
 
   public get winnerIndex(): number | null {
killedBy: GameProjection reports outcome as null for an active match
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/projection.ts:20:12
   }
 
   public get outcome(): GameState['outcome'] {
-    return this.state.outcome ?? null;
+    return this.state.outcome && null;
   }
 
killedBy: GameProjection reports outcome as null for an active match
statusReason: expected undefined to be null

[Killed] BlockStatement
src/projection.ts:23:43
     return this.state.outcome ?? null;
   }
 
-  public get winnerIndex(): number | null {
-    return this.state.outcome?.winnerIndex ?? null;
-  }
+  public get winnerIndex(): number | null {}
 
   public get activePlayerIndex(): number {
killedBy: GameProjection reports winnerIndex as null for an active match
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/projection.ts:24:12
   }
 
   public get winnerIndex(): number | null {
-    return this.state.outcome?.winnerIndex ?? null;
+    return this.state.outcome?.winnerIndex && null;
   }
 
killedBy: GameProjection reports winnerIndex as null for an active match
statusReason: expected undefined to be null

[Killed] OptionalChaining
src/projection.ts:24:12
   }
 
   public get winnerIndex(): number | null {
-    return this.state.outcome?.winnerIndex ?? null;
+    return this.state.outcome.winnerIndex ?? null;
   }
 
killedBy: GameProjection reports winnerIndex as null for an active match
statusReason: Cannot read properties of undefined (reading 'winnerIndex')

[Killed] BlockStatement
src/projection.ts:27:42
     return this.state.outcome?.winnerIndex ?? null;
   }
 
-  public get activePlayerIndex(): number {
-    return this.state.activePlayerIndex;
-  }
+  public get activePlayerIndex(): number {}
 
   public get phase(): string {
killedBy: GameProjection exposes activePlayerIndex
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/projection.ts:31:30
     return this.state.activePlayerIndex;
   }
 
-  public get phase(): string {
-    return this.state.phase;
-  }
+  public get phase(): string {}
 
   public get turnNumber(): number {
killedBy: GameProjection exposes phase
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/projection.ts:35:35
     return this.state.phase;
   }
 
-  public get turnNumber(): number {
-    return this.state.turnNumber;
-  }
+  public get turnNumber(): number {}
 
   public getPlayerId(playerIndex: number): string | null {
killedBy: GameProjection exposes turnNumber
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/projection.ts:39:58
     return this.state.turnNumber;
   }
 
-  public getPlayerId(playerIndex: number): string | null {
-    return this.state.players[playerIndex]?.player.id ?? null;
-  }
+  public getPlayerId(playerIndex: number): string | null {}
 
   public getPlayerName(playerIndex: number): string | null {
killedBy: GameProjection returns player IDs by index
statusReason: expected undefined to be '00000000-0000-0000-0000-000000000010' // Object.is equality

[Killed] OptionalChaining
src/projection.ts:40:12
   }
 
   public getPlayerId(playerIndex: number): string | null {
-    return this.state.players[playerIndex]?.player.id ?? null;
+    return this.state.players[playerIndex].player.id ?? null;
   }
 
killedBy: GameProjection returns null for out-of-range player index
statusReason: Cannot read properties of undefined (reading 'player')

[Killed] LogicalOperator
src/projection.ts:40:12
   }
 
   public getPlayerId(playerIndex: number): string | null {
-    return this.state.players[playerIndex]?.player.id ?? null;
+    return this.state.players[playerIndex]?.player.id && null;
   }
 
killedBy: GameProjection returns player IDs by index
statusReason: expected null to be '00000000-0000-0000-0000-000000000010' // Object.is equality

[Killed] BlockStatement
src/projection.ts:43:60
     return this.state.players[playerIndex]?.player.id ?? null;
   }
 
-  public getPlayerName(playerIndex: number): string | null {
-    return this.state.players[playerIndex]?.player.name ?? null;
-  }
+  public getPlayerName(playerIndex: number): string | null {}
 
   public getPlayerState(playerIndex: number): PlayerState | null {
killedBy: GameProjection returns player names by index
statusReason: expected undefined to be 'Alice' // Object.is equality

[Killed] OptionalChaining
src/projection.ts:44:12
   }
 
   public getPlayerName(playerIndex: number): string | null {
-    return this.state.players[playerIndex]?.player.name ?? null;
+    return this.state.players[playerIndex].player.name ?? null;
   }
 
killedBy: GameProjection returns null for out-of-range player index
statusReason: Cannot read properties of undefined (reading 'player')

[Killed] LogicalOperator
src/projection.ts:44:12
   }
 
   public getPlayerName(playerIndex: number): string | null {
-    return this.state.players[playerIndex]?.player.name ?? null;
+    return this.state.players[playerIndex]?.player.name && null;
   }
 
killedBy: GameProjection returns player names by index
statusReason: expected null to be 'Alice' // Object.is equality

[Killed] BlockStatement
src/projection.ts:47:66
     return this.state.players[playerIndex]?.player.name ?? null;
   }
 
-  public getPlayerState(playerIndex: number): PlayerState | null {
-    return this.state.players[playerIndex] ?? null;
-  }
+  public getPlayerState(playerIndex: number): PlayerState | null {}
 
   public isPlayerTurn(playerId: string): boolean {
killedBy: GameProjection returns null for out-of-range player index
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/projection.ts:48:12
   }
 
   public getPlayerState(playerIndex: number): PlayerState | null {
-    return this.state.players[playerIndex] ?? null;
+    return this.state.players[playerIndex] && null;
   }
 
killedBy: GameProjection returns null for out-of-range player index
statusReason: expected undefined to be null

[Killed] BlockStatement
src/projection.ts:51:50
     return this.state.players[playerIndex] ?? null;
   }
 
-  public isPlayerTurn(playerId: string): boolean {
-    if (this.isGameOver) return false;
-    return this.getPlayerId(this.activePlayerIndex) === playerId;
-  }
+  public isPlayerTurn(playerId: string): boolean {}
 
   public getPlayerIndex(playerId: string): number | null {
killedBy: GameProjection isPlayerTurn returns true for active player
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:52:9
   }
 
   public isPlayerTurn(playerId: string): boolean {
-    if (this.isGameOver) return false;
+    if (true) return false;
     return this.getPlayerId(this.activePlayerIndex) === playerId;
   }
killedBy: GameProjection isPlayerTurn returns true for active player
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:52:9
   }
 
   public isPlayerTurn(playerId: string): boolean {
-    if (this.isGameOver) return false;
+    if (false) return false;
     return this.getPlayerId(this.activePlayerIndex) === playerId;
   }
killedBy: GameProjection game over state isPlayerTurn returns false when game is over
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:53:12
 
   public isPlayerTurn(playerId: string): boolean {
     if (this.isGameOver) return false;
-    return this.getPlayerId(this.activePlayerIndex) === playerId;
+    return true;
   }
 
killedBy: GameProjection isPlayerTurn returns false for inactive player
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:53:12
 
   public isPlayerTurn(playerId: string): boolean {
     if (this.isGameOver) return false;
-    return this.getPlayerId(this.activePlayerIndex) === playerId;
+    return false;
   }
 
killedBy: GameProjection isPlayerTurn returns true for active player
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/projection.ts:56:58
     return this.getPlayerId(this.activePlayerIndex) === playerId;
   }
 
-  public getPlayerIndex(playerId: string): number | null {
-    if (this.getPlayerId(0) === playerId) return 0;
-    if (this.getPlayerId(1) === playerId) return 1;
-    return null;
-  }
+  public getPlayerIndex(playerId: string): number | null {}
 
   public getRawState(): GameState {
killedBy: GameProjection getPlayerIndex resolves player IDs to indices
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:57:9
   }
 
   public getPlayerIndex(playerId: string): number | null {
-    if (this.getPlayerId(0) === playerId) return 0;
+    if (true) return 0;
     if (this.getPlayerId(1) === playerId) return 1;
     return null;
killedBy: GameProjection getPlayerIndex resolves player IDs to indices
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:57:9
   }
 
   public getPlayerIndex(playerId: string): number | null {
-    if (this.getPlayerId(0) === playerId) return 0;
+    if (false) return 0;
     if (this.getPlayerId(1) === playerId) return 1;
     return null;
killedBy: GameProjection getPlayerIndex resolves player IDs to indices
statusReason: expected null to be +0 // Object.is equality

[Killed] ConditionalExpression
src/projection.ts:58:9
 
   public getPlayerIndex(playerId: string): number | null {
     if (this.getPlayerId(0) === playerId) return 0;
-    if (this.getPlayerId(1) === playerId) return 1;
+    if (true) return 1;
     return null;
   }
killedBy: GameProjection getPlayerIndex resolves player IDs to indices
statusReason: expected 1 to be null

[Killed] EqualityOperator
src/projection.ts:58:9
 
   public getPlayerIndex(playerId: string): number | null {
     if (this.getPlayerId(0) === playerId) return 0;
-    if (this.getPlayerId(1) === playerId) return 1;
+    if (this.getPlayerId(1) !== playerId) return 1;
     return null;
   }
killedBy: GameProjection getPlayerIndex resolves player IDs to indices
statusReason: expected null to be 1 // Object.is equality

[Killed] BlockStatement
src/projection.ts:62:35
     return null;
   }
 
-  public getRawState(): GameState {
-    return this.state;
-  }
+  public getRawState(): GameState {}
 }
 
killedBy: GameProjection getRawState returns the underlying GameState
statusReason: expected undefined to be { …(8) } // Object.is equality
