[Killed] BlockStatement
src/replay.ts:21:57
 
 const DEFAULT_REPLAY_TIMESTAMP = '1970-01-01T00:00:00.000Z';
 
-function getReplayTimestamp(config: GameConfig): string {
-  return config.drawTimestamp ?? DEFAULT_REPLAY_TIMESTAMP;
-}
+function getReplayTimestamp(config: GameConfig): string {}
 
 /**
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from system:init pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/replay.ts:22:10
 const DEFAULT_REPLAY_TIMESTAMP = '1970-01-01T00:00:00.000Z';
 
 function getReplayTimestamp(config: GameConfig): string {
-  return config.drawTimestamp ?? DEFAULT_REPLAY_TIMESTAMP;
+  return config.drawTimestamp && DEFAULT_REPLAY_TIMESTAMP;
 }
 
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions reuses deterministic timestamps across repeated empty-action replays
statusReason: expected undefined to be '1970-01-01T00:00:00.000Z' // Object.is equality

[Killed] ObjectLiteral
src/replay.ts:36:34
   options?: { hashFn?: (state: unknown) => string },
 ): ReplayResult {
   const replayTimestamp = getReplayTimestamp(config);
-  let state = createInitialState({ ...config, drawTimestamp: replayTimestamp });
+  let state = createInitialState({});
 
   // Transition from StartTurn to the first action phase via system:init
killedBy: PHX-EV-001: deriveEventsFromEntry AC #6: determinism produces byte-identical results for a real replay entry
statusReason: Cannot read properties of undefined (reading '0')

[Killed] OptionalChaining
src/replay.ts:45:38
       type: 'system:init',
       timestamp: replayTimestamp,
     },
-    { allowSystemInit: true, hashFn: options?.hashFn },
+    { allowSystemInit: true, hashFn: options.hashFn },
   );
 
killedBy: PHX-EV-001: deriveEventsFromEntry AC #6: determinism produces byte-identical results for a real replay entry
statusReason: Cannot read properties of undefined (reading 'hashFn')

[Killed] BooleanLiteral
src/replay.ts:45:24
       type: 'system:init',
       timestamp: replayTimestamp,
     },
-    { allowSystemInit: true, hashFn: options?.hashFn },
+    { allowSystemInit: false, hashFn: options?.hashFn },
   );
 
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with empty actions list returns valid initial state
statusReason: system:init is an internal action

[Killed] OptionalChaining
src/replay.ts:48:56
     { allowSystemInit: true, hashFn: options?.hashFn },
   );
 
-  const applyOptions: ApplyActionOptions | undefined = options?.hashFn
+  const applyOptions: ApplyActionOptions | undefined = options.hashFn
     ? { hashFn: options.hashFn }
     : undefined;
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with empty actions list returns valid initial state
statusReason: Cannot read properties of undefined (reading 'hashFn')

[Killed] UpdateOperator
src/replay.ts:52:39
     ? { hashFn: options.hashFn }
     : undefined;
 
-  for (let i = 0; i < actions.length; i++) {
+  for (let i = 0; i < actions.length; i--) {
     try {
       const action = actions[i];
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with deploy actions produces matching state
statusReason: Replay failed at index -1: Missing action at index -1: expected 'Missing action at index -1' to be undefined

[Killed] ConditionalExpression
src/replay.ts:52:19
     ? { hashFn: options.hashFn }
     : undefined;
 
-  for (let i = 0; i < actions.length; i++) {
+  for (let i = 0; false; i++) {
     try {
       const action = actions[i];
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with deploy actions produces matching state
statusReason: expected null not to be null

[Killed] BlockStatement
src/replay.ts:53:9
     : undefined;
 
   for (let i = 0; i < actions.length; i++) {
-    try {
-      const action = actions[i];
-      if (!action) throw new Error(`Missing action at index ${i}`);
-      state = applyAction(state, action, applyOptions);
-    } catch (err) {
+    try {} catch (err) {
       return {
         finalState: state,
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with deploy actions produces matching state
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/replay.ts:55:11
   for (let i = 0; i < actions.length; i++) {
     try {
       const action = actions[i];
-      if (!action) throw new Error(`Missing action at index ${i}`);
+      if (true) throw new Error(`Missing action at index ${i}`);
       state = applyAction(state, action, applyOptions);
     } catch (err) {
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with deploy actions produces matching state
statusReason: Replay failed at index 0: Missing action at index 0: expected 'Missing action at index 0' to be undefined

[Killed] BooleanLiteral
src/replay.ts:55:11
   for (let i = 0; i < actions.length; i++) {
     try {
       const action = actions[i];
-      if (!action) throw new Error(`Missing action at index ${i}`);
+      if (action) throw new Error(`Missing action at index ${i}`);
       state = applyAction(state, action, applyOptions);
     } catch (err) {
killedBy: Property: replayGame hash matches iterative state at action prefixes standard config prefix consistency (seed=1)
statusReason: seed=1 prefix=1: replay failed at index 0: Missing action at index 0: expected false to be true // Object.is equality

[Killed] BlockStatement
src/replay.ts:57:19
       const action = actions[i];
       if (!action) throw new Error(`Missing action at index ${i}`);
       state = applyAction(state, action, applyOptions);
-    } catch (err) {
-      return {
-        finalState: state,
-        valid: false,
-        failedAtIndex: i,
-        error: err instanceof Error ? err.message : 'Unknown error',
-      };
-    }
+    } catch (err) {}
   }
 
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with invalid action returns valid: false at correct index
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/replay.ts:60:16
     } catch (err) {
       return {
         finalState: state,
-        valid: false,
+        valid: true,
         failedAtIndex: i,
         error: err instanceof Error ? err.message : 'Unknown error',
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with invalid action returns valid: false at correct index
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/replay.ts:67:38
     }
   }
 
-  return { finalState: state, valid: true };
+  return { finalState: state, valid: false };
 }
 
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with empty actions list returns valid initial state
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/replay.ts:67:10
     }
   }
 
-  return { finalState: state, valid: true };
+  return {};
 }
 
killedBy: PHX-TXLOG-003: Game is replayable from initial config + ordered actions replayGame with empty actions list returns valid initial state
statusReason: expected undefined to be true // Object.is equality
