[Killed] BlockStatement
src/state-machine.ts:240:70
 /**
  * Returns all transitions that originate from a given phase.
  */
-export function transitionsFrom(phase: GamePhase): StateTransition[] {
-  return STATE_MACHINE.filter((t) => t.from === phase);
-}
+export function transitionsFrom(phase: GamePhase): StateTransition[] {}
 
 /**
killedBy: STATE_MACHINE graph integrity StartTurn exposes init, turn-advance, and post-turn victory transitions
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/state-machine.ts:241:31
  * Returns all transitions that originate from a given phase.
  */
 export function transitionsFrom(phase: GamePhase): StateTransition[] {
-  return STATE_MACHINE.filter((t) => t.from === phase);
+  return STATE_MACHINE.filter(() => undefined);
 }
 
killedBy: STATE_MACHINE graph integrity StartTurn exposes init, turn-advance, and post-turn victory transitions
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/state-machine.ts:241:38
  * Returns all transitions that originate from a given phase.
  */
 export function transitionsFrom(phase: GamePhase): StateTransition[] {
-  return STATE_MACHINE.filter((t) => t.from === phase);
+  return STATE_MACHINE.filter((t) => t.from !== phase);
 }
 
killedBy: STATE_MACHINE graph integrity StartTurn exposes init, turn-advance, and post-turn victory transitions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/state-machine.ts:247:68
 /**
  * Returns all transitions that end in a given phase.
  */
-export function transitionsTo(phase: GamePhase): StateTransition[] {
-  return STATE_MACHINE.filter((t) => t.to === phase);
-}
+export function transitionsTo(phase: GamePhase): StateTransition[] {}
 
 /**
killedBy: STATE_MACHINE graph integrity gameOver is reachable from every non-terminal phase via forfeit
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
src/state-machine.ts:248:38
  * Returns all transitions that end in a given phase.
  */
 export function transitionsTo(phase: GamePhase): StateTransition[] {
-  return STATE_MACHINE.filter((t) => t.to === phase);
+  return STATE_MACHINE.filter((t) => false);
 }
 
killedBy: STATE_MACHINE graph integrity gameOver is reachable from every non-terminal phase via forfeit
statusReason: phase StartTurn is missing a forfeit transition to gameOver: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/state-machine.ts:248:31
  * Returns all transitions that end in a given phase.
  */
 export function transitionsTo(phase: GamePhase): StateTransition[] {
-  return STATE_MACHINE.filter((t) => t.to === phase);
+  return STATE_MACHINE.filter(() => undefined);
 }
 
killedBy: STATE_MACHINE graph integrity gameOver is reachable from every non-terminal phase via forfeit
statusReason: phase StartTurn is missing a forfeit transition to gameOver: expected false to be true // Object.is equality

[Killed] BlockStatement
src/state-machine.ts:257:32
 export function findTransition(
   from: GamePhase,
   trigger: TransitionTrigger,
-): StateTransition | undefined {
-  return STATE_MACHINE.find((t) => t.from === from && t.trigger === trigger);
-}
+): StateTransition | undefined {}
 
 /**
killedBy: STATE_MACHINE graph integrity findTransition returns the correct edge or undefined
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/state-machine.ts:258:36
   from: GamePhase,
   trigger: TransitionTrigger,
 ): StateTransition | undefined {
-  return STATE_MACHINE.find((t) => t.from === from && t.trigger === trigger);
+  return STATE_MACHINE.find((t) => true);
 }
 
killedBy: STATE_MACHINE graph integrity findTransition returns the correct edge or undefined
statusReason: expected 'DeploymentPhase' to be 'AttackResolution' // Object.is equality

[Killed] ConditionalExpression
src/state-machine.ts:258:36
   from: GamePhase,
   trigger: TransitionTrigger,
 ): StateTransition | undefined {
-  return STATE_MACHINE.find((t) => t.from === from && t.trigger === trigger);
+  return STATE_MACHINE.find((t) => true && t.trigger === trigger);
 }
 
killedBy: STATE_MACHINE graph integrity findTransition returns the correct edge or undefined
statusReason: expected { from: 'AttackPhase', …(4) } to be undefined

[Killed] BlockStatement
src/state-machine.ts:264:100
 /**
  * Returns true if an exact (from, trigger, to) transition exists.
  */
-export function hasTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): boolean {
-  return STATE_MACHINE.some((t) => t.from === from && t.trigger === trigger && t.to === to);
-}
+export function hasTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): boolean {}
 
 /**
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition StartTurn --system:init--> DeploymentPhase. Allowed: system:init->DeploymentPhase, system:init->AttackPhase, system:advance->AttackPhase, system:victory->gameOver, forfeit->gameOver

[Killed] ConditionalExpression
src/state-machine.ts:265:36
  * Returns true if an exact (from, trigger, to) transition exists.
  */
 export function hasTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): boolean {
-  return STATE_MACHINE.some((t) => t.from === from && t.trigger === trigger && t.to === to);
+  return STATE_MACHINE.some((t) => true);
 }
 
killedBy: Engine Coverage & Permutations State Machine Helpers assertTransition throws on invalid transition
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/state-machine.ts:265:36
  * Returns true if an exact (from, trigger, to) transition exists.
  */
 export function hasTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): boolean {
-  return STATE_MACHINE.some((t) => t.from === from && t.trigger === trigger && t.to === to);
+  return STATE_MACHINE.some((t) => true && t.to === to);
 }
 
killedBy: Engine Coverage & Permutations State Machine Helpers assertTransition throws on invalid transition
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/state-machine.ts:271:100
 /**
  * Throws when an exact (from, trigger, to) transition is not declared.
  */
-export function assertTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): void {
-  if (hasTransition(from, trigger, to)) return;
-
-  const allowed = transitionsFrom(from)
-    .map((t) => `${t.trigger}->${t.to}`)
-    .join(', ');
-
-  throw new Error(
-    `Invalid phase transition ${from} --${trigger}--> ${to}. Allowed: ${allowed || '(none)'}`,
-  );
-}
+export function assertTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): void {}
 
 /**
killedBy: Engine Coverage & Permutations State Machine Helpers assertTransition throws on invalid transition
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/state-machine.ts:272:7
  * Throws when an exact (from, trigger, to) transition is not declared.
  */
 export function assertTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): void {
-  if (hasTransition(from, trigger, to)) return;
+  if (true) return;
 
   const allowed = transitionsFrom(from)
killedBy: Engine Coverage & Permutations State Machine Helpers assertTransition throws on invalid transition
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/state-machine.ts:272:7
  * Throws when an exact (from, trigger, to) transition is not declared.
  */
 export function assertTransition(from: GamePhase, trigger: TransitionTrigger, to: GamePhase): void {
-  if (hasTransition(from, trigger, to)) return;
+  if (false) return;
 
   const allowed = transitionsFrom(from)
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: Invalid phase transition StartTurn --system:init--> DeploymentPhase. Allowed: system:init->DeploymentPhase, system:init->AttackPhase, system:advance->AttackPhase, system:victory->gameOver, forfeit->gameOver

[Survived] ArrowFunction
src/state-machine.ts:275:10
   if (hasTransition(from, trigger, to)) return;
 
   const allowed = transitionsFrom(from)
-    .map((t) => `${t.trigger}->${t.to}`)
+    .map(() => undefined)
     .join(', ');
 

[NoCoverage] StringLiteral
src/state-machine.ts:275:17
   if (hasTransition(from, trigger, to)) return;
 
   const allowed = transitionsFrom(from)
-    .map((t) => `${t.trigger}->${t.to}`)
+    .map((t) => ``)
     .join(', ');
 

[Survived] ConditionalExpression
src/state-machine.ts:279:73
     .join(', ');
 
   throw new Error(
-    `Invalid phase transition ${from} --${trigger}--> ${to}. Allowed: ${allowed || '(none)'}`,
+    `Invalid phase transition ${from} --${trigger}--> ${to}. Allowed: ${false}`,
   );
 }

[Survived] LogicalOperator
src/state-machine.ts:279:73
     .join(', ');
 
   throw new Error(
-    `Invalid phase transition ${from} --${trigger}--> ${to}. Allowed: ${allowed || '(none)'}`,
+    `Invalid phase transition ${from} --${trigger}--> ${to}. Allowed: ${allowed && '(none)'}`,
   );
 }

[Killed] BlockStatement
src/state-machine.ts:286:79
 /**
  * Returns true if the phase has at least one transition mapped to the given external action.
  */
-export function canHandleAction(from: GamePhase, action: ActionType): boolean {
-  return STATE_MACHINE.some((t) => t.from === from && t.action === action);
-}
+export function canHandleAction(from: GamePhase, action: ActionType): boolean {}
 
killedBy: Engine Coverage & Permutations State Machine Helpers canHandleAction returns true for valid action types
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/state-machine.ts:287:36
  * Returns true if the phase has at least one transition mapped to the given external action.
  */
 export function canHandleAction(from: GamePhase, action: ActionType): boolean {
-  return STATE_MACHINE.some((t) => t.from === from && t.action === action);
+  return STATE_MACHINE.some((t) => false);
 }
 
killedBy: Engine Coverage & Permutations State Machine Helpers canHandleAction returns true for valid action types
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/state-machine.ts:287:10
  * Returns true if the phase has at least one transition mapped to the given external action.
  */
 export function canHandleAction(from: GamePhase, action: ActionType): boolean {
-  return STATE_MACHINE.some((t) => t.from === from && t.action === action);
+  return STATE_MACHINE.every(t => t.from === from && t.action === action);
 }
 
killedBy: Engine Coverage & Permutations State Machine Helpers canHandleAction returns true for valid action types
statusReason: expected false to be true // Object.is equality
