[Killed] BlockStatement
src/state.ts:20:71
 import { DEFAULT_MATCH_PARAMS, isStartTurn } from '@phalanxduel/shared';
 import { createDeck, shuffleDeck } from './deck.js';
 
-function emptyBattlefield(rows: number, columns: number): Battlefield {
-  return Array(rows * columns).fill(null) as Battlefield;
-}
+function emptyBattlefield(rows: number, columns: number): Battlefield {}
 
 function createPlayerState(
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects system:init if not explicitly allowed
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/state.ts:31:16
   startingLifepoints: number,
   rows: number,
   columns: number,
-): PlayerState {
-  const deck = createDeck();
-  const drawpile = shuffleDeck(deck, seed);
-  return {
-    player: { id, name },
-    hand: [],
-    battlefield: emptyBattlefield(rows, columns),
-    drawpile,
-    discardPile: [],
-    lifepoints: startingLifepoints,
-    deckSeed: seed,
-    handCount: 0,
-    drawpileCount: drawpile.length,
-    discardPileCount: 0,
-  };
-}
+): PlayerState {}
 
 export interface GameConfig {
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects system:init if not explicitly allowed
statusReason: Invalid player index: 0

[Survived] ObjectLiteral
src/state.ts:35:13
   const deck = createDeck();
   const drawpile = shuffleDeck(deck, seed);
   return {
-    player: { id, name },
+    player: {},
     hand: [],
     battlefield: emptyBattlefield(rows, columns),

[Killed] ArithmeticOperator
src/state.ts:65:22
  * Cards are placed face-up (revealed) since there is no deployment phase to reveal them.
  */
 function quickDeployPlayer(player: PlayerState, rows: number, columns: number): PlayerState {
-  const totalSlots = rows * columns;
+  const totalSlots = rows / columns;
   const toDeploy = Math.min(player.hand.length, totalSlots);
   const newBattlefield = [...player.battlefield] as Battlefield;
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [ { …(4) } ] to have a length of 8 but got 1

[Survived] MethodExpression
src/state.ts:66:20
  */
 function quickDeployPlayer(player: PlayerState, rows: number, columns: number): PlayerState {
   const totalSlots = rows * columns;
-  const toDeploy = Math.min(player.hand.length, totalSlots);
+  const toDeploy = Math.max(player.hand.length, totalSlots);
   const newBattlefield = [...player.battlefield] as Battlefield;
   const newHand = [...player.hand];

[Killed] ConditionalExpression
src/state.ts:71:21
   const newHand = [...player.hand];
 
   let deployed = 0;
-  for (let col = 0; col < columns && deployed < toDeploy; col++) {
+  for (let col = 0; false; col++) {
     for (let row = 0; row < rows && deployed < toDeploy; row++) {
       const gridIndex = row * columns + col;
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] BlockStatement
src/state.ts:71:66
   const newHand = [...player.hand];
 
   let deployed = 0;
-  for (let col = 0; col < columns && deployed < toDeploy; col++) {
-    for (let row = 0; row < rows && deployed < toDeploy; row++) {
-      const gridIndex = row * columns + col;
-      if (newBattlefield[gridIndex] !== null) continue;
-
-      const card = newHand.splice(0, 1)[0];
-      if (!card) throw new Error('Expected card in hand during quick deploy');
-      const bfCard: BattlefieldCard = {
-        card,
-        position: { row, col },
-        currentHp: card.value,
-        faceDown: false,
-      };
-      newBattlefield[gridIndex] = bfCard;
-      deployed++;
-    }
-  }
+  for (let col = 0; col < columns && deployed < toDeploy; col++) {}
 
   return { ...player, hand: newHand, battlefield: newBattlefield };
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] EqualityOperator
src/state.ts:72:37
 
   let deployed = 0;
   for (let col = 0; col < columns && deployed < toDeploy; col++) {
-    for (let row = 0; row < rows && deployed < toDeploy; row++) {
+    for (let row = 0; row < rows && deployed >= toDeploy; row++) {
       const gridIndex = row * columns + col;
       if (newBattlefield[gridIndex] !== null) continue;
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] EqualityOperator
src/state.ts:72:23
 
   let deployed = 0;
   for (let col = 0; col < columns && deployed < toDeploy; col++) {
-    for (let row = 0; row < rows && deployed < toDeploy; row++) {
+    for (let row = 0; row >= rows && deployed < toDeploy; row++) {
       const gridIndex = row * columns + col;
       if (newBattlefield[gridIndex] !== null) continue;
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] ArithmeticOperator
src/state.ts:73:25
   let deployed = 0;
   for (let col = 0; col < columns && deployed < toDeploy; col++) {
     for (let row = 0; row < rows && deployed < toDeploy; row++) {
-      const gridIndex = row * columns + col;
+      const gridIndex = row * columns - col;
       if (newBattlefield[gridIndex] !== null) continue;
 
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [ { card: { …(5) }, …(3) }, …(4) ] to have a length of 8 but got 5

[Killed] ArithmeticOperator
src/state.ts:73:25
   let deployed = 0;
   for (let col = 0; col < columns && deployed < toDeploy; col++) {
     for (let row = 0; row < rows && deployed < toDeploy; row++) {
-      const gridIndex = row * columns + col;
+      const gridIndex = row / columns + col;
       if (newBattlefield[gridIndex] !== null) continue;
 
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [ { card: { …(5) }, …(3) }, …(3) ] to have a length of 8 but got 4

[Killed] EqualityOperator
src/state.ts:74:11
   for (let col = 0; col < columns && deployed < toDeploy; col++) {
     for (let row = 0; row < rows && deployed < toDeploy; row++) {
       const gridIndex = row * columns + col;
-      if (newBattlefield[gridIndex] !== null) continue;
+      if (newBattlefield[gridIndex] === null) continue;
 
       const card = newHand.splice(0, 1)[0];
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] ConditionalExpression
src/state.ts:74:11
   for (let col = 0; col < columns && deployed < toDeploy; col++) {
     for (let row = 0; row < rows && deployed < toDeploy; row++) {
       const gridIndex = row * columns + col;
-      if (newBattlefield[gridIndex] !== null) continue;
+      if (true) continue;
 
       const card = newHand.splice(0, 1)[0];
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] ConditionalExpression
src/state.ts:77:11
       if (newBattlefield[gridIndex] !== null) continue;
 
       const card = newHand.splice(0, 1)[0];
-      if (!card) throw new Error('Expected card in hand during quick deploy');
+      if (true) throw new Error('Expected card in hand during quick deploy');
       const bfCard: BattlefieldCard = {
         card,
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: Expected card in hand during quick deploy

[Killed] BooleanLiteral
src/state.ts:77:11
       if (newBattlefield[gridIndex] !== null) continue;
 
       const card = newHand.splice(0, 1)[0];
-      if (!card) throw new Error('Expected card in hand during quick deploy');
+      if (card) throw new Error('Expected card in hand during quick deploy');
       const bfCard: BattlefieldCard = {
         card,
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: Expected card in hand during quick deploy

[Killed] BooleanLiteral
src/state.ts:82:19
         card,
         position: { row, col },
         currentHp: card.value,
-        faceDown: false,
+        faceDown: true,
       };
       newBattlefield[gridIndex] = bfCard;
killedBy: quickStart deploys cards face-up (not faceDown)
statusReason: expected true to be false // Object.is equality

[Survived] UpdateOperator
src/state.ts:85:7
         faceDown: false,
       };
       newBattlefield[gridIndex] = bfCard;
-      deployed++;
+      deployed--;
     }
   }

[Killed] ObjectLiteral
src/state.ts:89:10
     }
   }
 
-  return { ...player, hand: newHand, battlefield: newBattlefield };
+  return {};
 }
 
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] OptionalChaining
src/state.ts:105:11
     : ({
         ...DEFAULT_MATCH_PARAMS,
         modeClassicDeployment:
-          gameOptions?.classicDeployment ?? DEFAULT_MATCH_PARAMS.modeClassicDeployment,
+          gameOptions.classicDeployment ?? DEFAULT_MATCH_PARAMS.modeClassicDeployment,
         modeQuickStart: gameOptions?.quickStart ?? DEFAULT_MATCH_PARAMS.modeQuickStart,
         modeDamagePersistence:
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: Cannot read properties of undefined (reading 'classicDeployment')

[Killed] LogicalOperator
src/state.ts:105:11
     : ({
         ...DEFAULT_MATCH_PARAMS,
         modeClassicDeployment:
-          gameOptions?.classicDeployment ?? DEFAULT_MATCH_PARAMS.modeClassicDeployment,
+          gameOptions?.classicDeployment && DEFAULT_MATCH_PARAMS.modeClassicDeployment,
         modeQuickStart: gameOptions?.quickStart ?? DEFAULT_MATCH_PARAMS.modeQuickStart,
         modeDamagePersistence:
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: expected 'AttackPhase' to be 'DeploymentPhase' // Object.is equality

[Killed] LogicalOperator
src/state.ts:106:25
         ...DEFAULT_MATCH_PARAMS,
         modeClassicDeployment:
           gameOptions?.classicDeployment ?? DEFAULT_MATCH_PARAMS.modeClassicDeployment,
-        modeQuickStart: gameOptions?.quickStart ?? DEFAULT_MATCH_PARAMS.modeQuickStart,
+        modeQuickStart: gameOptions?.quickStart && DEFAULT_MATCH_PARAMS.modeQuickStart,
         modeDamagePersistence:
           gameOptions?.damageMode ?? DEFAULT_MATCH_PARAMS.modeDamagePersistence,
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] OptionalChaining
src/state.ts:106:25
         ...DEFAULT_MATCH_PARAMS,
         modeClassicDeployment:
           gameOptions?.classicDeployment ?? DEFAULT_MATCH_PARAMS.modeClassicDeployment,
-        modeQuickStart: gameOptions?.quickStart ?? DEFAULT_MATCH_PARAMS.modeQuickStart,
+        modeQuickStart: gameOptions.quickStart ?? DEFAULT_MATCH_PARAMS.modeQuickStart,
         modeDamagePersistence:
           gameOptions?.damageMode ?? DEFAULT_MATCH_PARAMS.modeDamagePersistence,
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'quickStart')

[Killed] OptionalChaining
src/state.ts:108:11
           gameOptions?.classicDeployment ?? DEFAULT_MATCH_PARAMS.modeClassicDeployment,
         modeQuickStart: gameOptions?.quickStart ?? DEFAULT_MATCH_PARAMS.modeQuickStart,
         modeDamagePersistence:
-          gameOptions?.damageMode ?? DEFAULT_MATCH_PARAMS.modeDamagePersistence,
+          gameOptions.damageMode ?? DEFAULT_MATCH_PARAMS.modeDamagePersistence,
       } satisfies MatchParameters);
   const resolvedGameOptions = gameOptions ?? {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'damageMode')

[Killed] LogicalOperator
src/state.ts:108:11
           gameOptions?.classicDeployment ?? DEFAULT_MATCH_PARAMS.modeClassicDeployment,
         modeQuickStart: gameOptions?.quickStart ?? DEFAULT_MATCH_PARAMS.modeQuickStart,
         modeDamagePersistence:
-          gameOptions?.damageMode ?? DEFAULT_MATCH_PARAMS.modeDamagePersistence,
+          gameOptions?.damageMode && DEFAULT_MATCH_PARAMS.modeDamagePersistence,
       } satisfies MatchParameters);
   const resolvedGameOptions = gameOptions ?? {
killedBy: Core Rules Verification (TASK-Coverage) DEF-001 / TASK-193: Classic Mode HP Reset (§12) resets defender card HP between turns in Classic mode
statusReason: expected 7 to be 10 // Object.is equality

[Killed] LogicalOperator
src/state.ts:110:31
         modeDamagePersistence:
           gameOptions?.damageMode ?? DEFAULT_MATCH_PARAMS.modeDamagePersistence,
       } satisfies MatchParameters);
-  const resolvedGameOptions = gameOptions ?? {
-    damageMode: resolvedMatchParams.modeDamagePersistence,
-    startingLifepoints: 20,
-  };
+  const resolvedGameOptions = gameOptions && {
+  damageMode: resolvedMatchParams.modeDamagePersistence,
+  startingLifepoints: 20
+};
   const startingLifepoints = resolvedGameOptions.startingLifepoints;
   const modeClassicDeployment = resolvedMatchParams.modeClassicDeployment;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'startingLifepoints')

[Killed] ObjectLiteral
src/state.ts:110:46
         modeDamagePersistence:
           gameOptions?.damageMode ?? DEFAULT_MATCH_PARAMS.modeDamagePersistence,
       } satisfies MatchParameters);
-  const resolvedGameOptions = gameOptions ?? {
-    damageMode: resolvedMatchParams.modeDamagePersistence,
-    startingLifepoints: 20,
-  };
+  const resolvedGameOptions = gameOptions ?? {};
   const startingLifepoints = resolvedGameOptions.startingLifepoints;
   const modeClassicDeployment = resolvedMatchParams.modeClassicDeployment;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: actual value must be number or bigint, received "undefined"

[Survived] StringLiteral
src/state.ts:125:18
 
   const baseState: GameState = {
     matchId,
-    specVersion: '1.0',
+    specVersion: "",
     params: resolvedMatchParams,
     players: [

[Killed] ObjectLiteral
src/state.ts:141:16
     activePlayerIndex: 0,
     phase: 'StartTurn',
     turnNumber: 0,
-    passState: {
-      consecutivePasses: [0, 0] as [number, number],
-      totalPasses: [0, 0] as [number, number],
-    },
+    passState: {},
   };
 
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: Cannot read properties of undefined (reading '0')

[Survived] LogicalOperator
src/state.ts:147:25
     },
   };
 
-  const drawTimestamp = config.drawTimestamp ?? '1970-01-01T00:00:00.000Z';
+  const drawTimestamp = config.drawTimestamp && '1970-01-01T00:00:00.000Z';
   let state: GameState = baseState;
   state = drawCards(state, 0, initialDraw, drawTimestamp);

[Killed] BlockStatement
src/state.ts:156:23
   // We do this directly here to ensure the state reflects an immediate end
   // if the configuration is invalid (e.g. deck smaller than initial draw).
   const initialVictory = checkVictory(state);
-  if (initialVictory) {
-    state.phase = 'gameOver';
-    state.outcome = { ...initialVictory, turnNumber: 0 };
-  }
+  if (initialVictory) {}
 
   // Quick start: pre-deploy cards from hand to battlefield, skipping DeploymentPhase
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected 'StartTurn' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:156:7
   // We do this directly here to ensure the state reflects an immediate end
   // if the configuration is invalid (e.g. deck smaller than initial draw).
   const initialVictory = checkVictory(state);
-  if (initialVictory) {
+  if (true) {
     state.phase = 'gameOver';
     state.outcome = { ...initialVictory, turnNumber: 0 };
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: Action "system:init" is not allowed in phase "gameOver"

[Killed] StringLiteral
src/state.ts:157:19
   // if the configuration is invalid (e.g. deck smaller than initial draw).
   const initialVictory = checkVictory(state);
   if (initialVictory) {
-    state.phase = 'gameOver';
+    state.phase = "";
     state.outcome = { ...initialVictory, turnNumber: 0 };
   }
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected '' to be 'gameOver' // Object.is equality

[Killed] ObjectLiteral
src/state.ts:158:21
   const initialVictory = checkVictory(state);
   if (initialVictory) {
     state.phase = 'gameOver';
-    state.outcome = { ...initialVictory, turnNumber: 0 };
+    state.outcome = {};
   }
 
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected undefined to be 'cardDepletion' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:162:7
   }
 
   // Quick start: pre-deploy cards from hand to battlefield, skipping DeploymentPhase
-  if (modeQuickStart && modeClassicDeployment) {
+  if (false) {
     const player0 = state.players[0];
     const player1 = state.players[1];
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] BlockStatement
src/state.ts:162:48
   }
 
   // Quick start: pre-deploy cards from hand to battlefield, skipping DeploymentPhase
-  if (modeQuickStart && modeClassicDeployment) {
-    const player0 = state.players[0];
-    const player1 = state.players[1];
-    if (!player0 || !player1) throw new Error('Missing player state during quick start');
-    const p0 = quickDeployPlayer(player0, rows, columns);
-    const p1 = quickDeployPlayer(player1, rows, columns);
-    state = { ...state, players: [p0, p1] };
-  }
+  if (modeQuickStart && modeClassicDeployment) {}
 
   return state;
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] BooleanLiteral
src/state.ts:165:9
   if (modeQuickStart && modeClassicDeployment) {
     const player0 = state.players[0];
     const player1 = state.players[1];
-    if (!player0 || !player1) throw new Error('Missing player state during quick start');
+    if (player0 || !player1) throw new Error('Missing player state during quick start');
     const p0 = quickDeployPlayer(player0, rows, columns);
     const p1 = quickDeployPlayer(player1, rows, columns);
killedBy: Property: invariants hold at every action step quickStart config (seed=42)
statusReason: Missing player state during quick start

[Killed] BooleanLiteral
src/state.ts:165:21
   if (modeQuickStart && modeClassicDeployment) {
     const player0 = state.players[0];
     const player1 = state.players[1];
-    if (!player0 || !player1) throw new Error('Missing player state during quick start');
+    if (!player0 || player1) throw new Error('Missing player state during quick start');
     const p0 = quickDeployPlayer(player0, rows, columns);
     const p1 = quickDeployPlayer(player1, rows, columns);
killedBy: Property: invariants hold at every action step quickStart config (seed=42)
statusReason: Missing player state during quick start

[Killed] BlockStatement
src/state.ts:174:79
   return state;
 }
 
-export function getPlayer(state: GameState, playerIndex: number): PlayerState {
-  const player = state.players[playerIndex];
-  if (!player) {
-    throw new Error(`Invalid player index: ${playerIndex}`);
-  }
-  return player;
-}
+export function getPlayer(state: GameState, playerIndex: number): PlayerState {}
 
 export function setPlayer(state: GameState, playerIndex: number, player: PlayerState): GameState {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'drawpile')

[Killed] ConditionalExpression
src/state.ts:176:7
 
 export function getPlayer(state: GameState, playerIndex: number): PlayerState {
   const player = state.players[playerIndex];
-  if (!player) {
+  if (false) {
     throw new Error(`Invalid player index: ${playerIndex}`);
   }
killedBy: Engine Coverage & Permutations State Manipulator Throws getPlayer throws on invalid index
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/state.ts:176:7
 
 export function getPlayer(state: GameState, playerIndex: number): PlayerState {
   const player = state.players[playerIndex];
-  if (!player) {
+  if (player) {
     throw new Error(`Invalid player index: ${playerIndex}`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid player index: 0

[Killed] BlockStatement
src/state.ts:182:98
   return player;
 }
 
-export function setPlayer(state: GameState, playerIndex: number, player: PlayerState): GameState {
-  const p0 = state.players[0];
-  const p1 = state.players[1];
-  if (!p0 || !p1) throw new Error('Missing player state in setPlayer');
-
-  const syncedPlayer: PlayerState = {
-    ...player,
-    handCount: player.hand.length,
-    drawpileCount: player.drawpile.length,
-    discardPileCount: player.discardPile.length,
-  };
-
-  const players: [PlayerState, PlayerState] = [p0, p1];
-  players[playerIndex] = syncedPlayer;
-  return { ...state, players };
-}
+export function setPlayer(state: GameState, playerIndex: number, player: PlayerState): GameState {}
 
 /**
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: Cannot read properties of undefined (reading 'players')

[Killed] BooleanLiteral
src/state.ts:185:14
 export function setPlayer(state: GameState, playerIndex: number, player: PlayerState): GameState {
   const p0 = state.players[0];
   const p1 = state.players[1];
-  if (!p0 || !p1) throw new Error('Missing player state in setPlayer');
+  if (!p0 || p1) throw new Error('Missing player state in setPlayer');
 
   const syncedPlayer: PlayerState = {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Missing player state in setPlayer

[Killed] BooleanLiteral
src/state.ts:185:7
 export function setPlayer(state: GameState, playerIndex: number, player: PlayerState): GameState {
   const p0 = state.players[0];
   const p1 = state.players[1];
-  if (!p0 || !p1) throw new Error('Missing player state in setPlayer');
+  if (p0 || !p1) throw new Error('Missing player state in setPlayer');
 
   const syncedPlayer: PlayerState = {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Missing player state in setPlayer

[Killed] ObjectLiteral
src/state.ts:187:37
   const p1 = state.players[1];
   if (!p0 || !p1) throw new Error('Missing player state in setPlayer');
 
-  const syncedPlayer: PlayerState = {
-    ...player,
-    handCount: player.hand.length,
-    drawpileCount: player.drawpile.length,
-    discardPileCount: player.discardPile.length,
-  };
+  const syncedPlayer: PlayerState = {};
 
   const players: [PlayerState, PlayerState] = [p0, p1];
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrayDeclaration
src/state.ts:194:47
     discardPileCount: player.discardPile.length,
   };
 
-  const players: [PlayerState, PlayerState] = [p0, p1];
+  const players: [PlayerState, PlayerState] = [];
   players[playerIndex] = syncedPlayer;
   return { ...state, players };
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid player index: 1

[Killed] BlockStatement
src/state.ts:209:14
   playerIndex: number,
   count: number,
   timestamp: string,
-): GameState {
-  const player = getPlayer(state, playerIndex);
-  const actualCount = Math.min(count, player.drawpile.length);
-  if (actualCount === 0) return state;
-
-  const drawnPartial = player.drawpile.slice(0, actualCount);
-  const remainingPile = player.drawpile.slice(actualCount);
-
-  const drawn = drawnPartial.map((p: PartialCard, i: number) => {
-    // Opaque ID: no card info encoded — prevents information leakage on face-down cards.
-    // Deterministic for replay: same inputs always produce the same ID.
-    const id = `${timestamp}::${state.matchId}::${player.player.id}::${state.turnNumber}::${i}`;
-    return { ...p, id };
-  });
-
-  return setPlayer(state, playerIndex, {
-    ...player,
-    hand: [...player.hand, ...drawn],
-    drawpile: remainingPile,
-  });
-}
+): GameState {}
 
 /**
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'passState')

[Killed] MethodExpression
src/state.ts:211:23
   timestamp: string,
 ): GameState {
   const player = getPlayer(state, playerIndex);
-  const actualCount = Math.min(count, player.drawpile.length);
+  const actualCount = Math.max(count, player.drawpile.length);
   if (actualCount === 0) return state;
 
killedBy: quickStart leaves 4 cards in hand after deploying 8 (initialDraw=12, slots=8)
statusReason: expected [ { suit: 'diamonds', …(4) }, …(43) ] to have a length of 4 but got 44

[Killed] EqualityOperator
src/state.ts:212:7
 ): GameState {
   const player = getPlayer(state, playerIndex);
   const actualCount = Math.min(count, player.drawpile.length);
-  if (actualCount === 0) return state;
+  if (actualCount !== 0) return state;
 
   const drawnPartial = player.drawpile.slice(0, actualCount);
killedBy: quickStart pre-fills both battlefields with 8 cards each (2x4 grid)
statusReason: expected [] to have a length of 8 but got +0

[Killed] ConditionalExpression
src/state.ts:212:7
 ): GameState {
   const player = getPlayer(state, playerIndex);
   const actualCount = Math.min(count, player.drawpile.length);
-  if (actualCount === 0) return state;
+  if (true) return state;
 
   const drawnPartial = player.drawpile.slice(0, actualCount);
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] MethodExpression
src/state.ts:214:24
   const actualCount = Math.min(count, player.drawpile.length);
   if (actualCount === 0) return state;
 
-  const drawnPartial = player.drawpile.slice(0, actualCount);
+  const drawnPartial = player.drawpile;
   const remainingPile = player.drawpile.slice(actualCount);
 
killedBy: quickStart leaves 4 cards in hand after deploying 8 (initialDraw=12, slots=8)
statusReason: expected [ { suit: 'diamonds', …(4) }, …(43) ] to have a length of 4 but got 44

[Killed] MethodExpression
src/state.ts:215:25
   if (actualCount === 0) return state;
 
   const drawnPartial = player.drawpile.slice(0, actualCount);
-  const remainingPile = player.drawpile.slice(actualCount);
+  const remainingPile = player.drawpile;
 
   const drawn = drawnPartial.map((p: PartialCard, i: number) => {
killedBy: Property-based testing with fast-check initial state should always satisfy invariants
statusReason: Property failed after 1 tests
{ seed: -429748501, path: "0:0:0", endOnFailure: true }
Counterexample: [0,false,false]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/state.ts:217:65
   const drawnPartial = player.drawpile.slice(0, actualCount);
   const remainingPile = player.drawpile.slice(actualCount);
 
-  const drawn = drawnPartial.map((p: PartialCard, i: number) => {
-    // Opaque ID: no card info encoded — prevents information leakage on face-down cards.
-    // Deterministic for replay: same inputs always produce the same ID.
-    const id = `${timestamp}::${state.matchId}::${player.player.id}::${state.turnNumber}::${i}`;
-    return { ...p, id };
-  });
+  const drawn = drawnPartial.map((p: PartialCard, i: number) => {});
 
   return setPlayer(state, playerIndex, {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/state.ts:224:40
     return { ...p, id };
   });
 
-  return setPlayer(state, playerIndex, {
-    ...player,
-    hand: [...player.hand, ...drawn],
-    drawpile: remainingPile,
-  });
+  return setPlayer(state, playerIndex, {});
 }
 
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/state.ts:242:7
 ): GameState {
   const player = getPlayer(state, playerIndex);
 
-  if (handCardIndex < 0 || handCardIndex >= player.hand.length) {
+  if (handCardIndex >= 0 || handCardIndex >= player.hand.length) {
     throw new Error(`Invalid hand card index: ${handCardIndex}`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid hand card index: 0

[Killed] ConditionalExpression
src/state.ts:242:7
 ): GameState {
   const player = getPlayer(state, playerIndex);
 
-  if (handCardIndex < 0 || handCardIndex >= player.hand.length) {
+  if (true) {
     throw new Error(`Invalid hand card index: ${handCardIndex}`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid hand card index: 0
