[Killed] ArithmeticOperator
src/state.ts:245:22
   if (handCardIndex < 0 || handCardIndex >= player.hand.length) {
     throw new Error(`Invalid hand card index: ${handCardIndex}`);
   }
-  const totalSlots = state.params.rows * state.params.columns;
+  const totalSlots = state.params.rows / state.params.columns;
   if (gridIndex < 0 || gridIndex >= totalSlots) {
     throw new Error(`Invalid grid index: ${gridIndex} (must be 0-${totalSlots - 1})`);
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 2 tests
{ seed: -1882724415, path: "1:1:0:0:0:0:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [1648802]
Shrunk 29 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/state.ts:246:7
     throw new Error(`Invalid hand card index: ${handCardIndex}`);
   }
   const totalSlots = state.params.rows * state.params.columns;
-  if (gridIndex < 0 || gridIndex >= totalSlots) {
+  if (true) {
     throw new Error(`Invalid grid index: ${gridIndex} (must be 0-${totalSlots - 1})`);
   }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Invalid grid index: 0 (must be 0-7)

[Killed] EqualityOperator
src/state.ts:246:24
     throw new Error(`Invalid hand card index: ${handCardIndex}`);
   }
   const totalSlots = state.params.rows * state.params.columns;
-  if (gridIndex < 0 || gridIndex >= totalSlots) {
+  if (gridIndex < 0 || gridIndex < totalSlots) {
     throw new Error(`Invalid grid index: ${gridIndex} (must be 0-${totalSlots - 1})`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid grid index: 0 (must be 0-7)

[NoCoverage] ArithmeticOperator
src/state.ts:247:68
   }
   const totalSlots = state.params.rows * state.params.columns;
   if (gridIndex < 0 || gridIndex >= totalSlots) {
-    throw new Error(`Invalid grid index: ${gridIndex} (must be 0-${totalSlots - 1})`);
+    throw new Error(`Invalid grid index: ${gridIndex} (must be 0-${totalSlots + 1})`);
   }
   if (player.battlefield[gridIndex] !== null) {

[Killed] ConditionalExpression
src/state.ts:249:7
   if (gridIndex < 0 || gridIndex >= totalSlots) {
     throw new Error(`Invalid grid index: ${gridIndex} (must be 0-${totalSlots - 1})`);
   }
-  if (player.battlefield[gridIndex] !== null) {
+  if (true) {
     throw new Error(`Grid position ${gridIndex} is already occupied`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Grid position 0 is already occupied

[Killed] EqualityOperator
src/state.ts:249:7
   if (gridIndex < 0 || gridIndex >= totalSlots) {
     throw new Error(`Invalid grid index: ${gridIndex} (must be 0-${totalSlots - 1})`);
   }
-  if (player.battlefield[gridIndex] !== null) {
+  if (player.battlefield[gridIndex] === null) {
     throw new Error(`Grid position ${gridIndex} is already occupied`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Grid position 0 is already occupied

[Killed] ConditionalExpression
src/state.ts:254:7
   }
 
   const card = player.hand[handCardIndex];
-  if (!card) {
+  if (true) {
     throw new Error(`No card at hand index: ${handCardIndex}`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No card at hand index: 0

[Killed] BooleanLiteral
src/state.ts:254:7
   }
 
   const card = player.hand[handCardIndex];
-  if (!card) {
+  if (card) {
     throw new Error(`No card at hand index: ${handCardIndex}`);
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No card at hand index: 0

[NoCoverage] StringLiteral
src/state.ts:255:21
 
   const card = player.hand[handCardIndex];
   if (!card) {
-    throw new Error(`No card at hand index: ${handCardIndex}`);
+    throw new Error(``);
   }
 

[Survived] ArithmeticOperator
src/state.ts:259:26
   }
 
   const columns = state.params.columns;
-  const row = Math.floor(gridIndex / columns);
+  const row = Math.floor(gridIndex * columns);
   const col = gridIndex % columns;
   const hp = card.value;

[Survived] ArithmeticOperator
src/state.ts:260:15
 
   const columns = state.params.columns;
   const row = Math.floor(gridIndex / columns);
-  const col = gridIndex % columns;
+  const col = gridIndex * columns;
   const hp = card.value;
 

[Killed] ObjectLiteral
src/state.ts:267:31
   newHand.splice(handCardIndex, 1);
 
   const newBattlefield = [...player.battlefield] as Battlefield;
-  newBattlefield[gridIndex] = {
-    card,
-    position: { row, col },
-    currentHp: hp,
-    faceDown: false,
-  };
+  newBattlefield[gridIndex] = {};
 
   return setPlayer(state, playerIndex, {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'value')

[Survived] BooleanLiteral
src/state.ts:271:15
     card,
     position: { row, col },
     currentHp: hp,
-    faceDown: false,
+    faceDown: true,
   };
 

[Killed] ObjectLiteral
src/state.ts:274:40
     faceDown: false,
   };
 
-  return setPlayer(state, playerIndex, {
-    ...player,
-    hand: newHand,
-    battlefield: newBattlefield,
-  });
+  return setPlayer(state, playerIndex, {});
 }
 
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/state.ts:291:18
   column: number,
   rows = 2,
   columns = 4,
-): number | null {
-  for (let row = 0; row < rows; row++) {
-    const idx = row * columns + column;
-    if (battlefield[idx] === null) return idx;
-  }
-  return null;
-}
+): number | null {}
 
 /**
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Grid position undefined is already occupied

[Killed] BlockStatement
src/state.ts:292:40
   rows = 2,
   columns = 4,
 ): number | null {
-  for (let row = 0; row < rows; row++) {
-    const idx = row * columns + column;
-    if (battlefield[idx] === null) return idx;
-  }
+  for (let row = 0; row < rows; row++) {}
   return null;
 }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is full

[Killed] EqualityOperator
src/state.ts:292:21
   rows = 2,
   columns = 4,
 ): number | null {
-  for (let row = 0; row < rows; row++) {
+  for (let row = 0; row >= rows; row++) {
     const idx = row * columns + column;
     if (battlefield[idx] === null) return idx;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is full

[Killed] ArithmeticOperator
src/state.ts:293:17
   columns = 4,
 ): number | null {
   for (let row = 0; row < rows; row++) {
-    const idx = row * columns + column;
+    const idx = row / columns + column;
     if (battlefield[idx] === null) return idx;
   }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Column is full

[Killed] ArithmeticOperator
src/state.ts:293:17
   columns = 4,
 ): number | null {
   for (let row = 0; row < rows; row++) {
-    const idx = row * columns + column;
+    const idx = row * columns - column;
     if (battlefield[idx] === null) return idx;
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is full

[Killed] ConditionalExpression
src/state.ts:294:9
 ): number | null {
   for (let row = 0; row < rows; row++) {
     const idx = row * columns + column;
-    if (battlefield[idx] === null) return idx;
+    if (false) return idx;
   }
   return null;
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: expected 'pass' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:294:9
 ): number | null {
   for (let row = 0; row < rows; row++) {
     const idx = row * columns + column;
-    if (battlefield[idx] === null) return idx;
+    if (true) return idx;
   }
   return null;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Grid position 0 is already occupied

[Killed] BlockStatement
src/state.ts:307:16
   column: number,
   rows = 2,
   columns = 4,
-): Battlefield {
-  const newBf = [...battlefield] as Battlefield;
-  for (let row = 0; row < rows - 1; row++) {
-    const idx = row * columns + column;
-    if (newBf[idx] === null) {
-      for (let behindRow = row + 1; behindRow < rows; behindRow++) {
-        const behindIdx = behindRow * columns + column;
-        const behindCard = newBf[behindIdx];
-        if (behindCard) {
-          newBf[idx] = { ...behindCard, position: { row, col: column } };
-          newBf[behindIdx] = null;
-          break;
-        }
-      }
-    }
-  }
-  return newBf;
-}
+): Battlefield {}
 
 /**
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Cannot read properties of undefined (reading '1')

[Killed] BlockStatement
src/state.ts:309:44
   columns = 4,
 ): Battlefield {
   const newBf = [...battlefield] as Battlefield;
-  for (let row = 0; row < rows - 1; row++) {
-    const idx = row * columns + column;
-    if (newBf[idx] === null) {
-      for (let behindRow = row + 1; behindRow < rows; behindRow++) {
-        const behindIdx = behindRow * columns + column;
-        const behindCard = newBf[behindIdx];
-        if (behindCard) {
-          newBf[idx] = { ...behindCard, position: { row, col: column } };
-          newBf[behindIdx] = null;
-          break;
-        }
-      }
-    }
-  }
+  for (let row = 0; row < rows - 1; row++) {}
   return newBf;
 }
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/state.ts:309:21
   columns = 4,
 ): Battlefield {
   const newBf = [...battlefield] as Battlefield;
-  for (let row = 0; row < rows - 1; row++) {
+  for (let row = 0; false; row++) {
     const idx = row * columns + column;
     if (newBf[idx] === null) {
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Survived] ArithmeticOperator
src/state.ts:310:17
 ): Battlefield {
   const newBf = [...battlefield] as Battlefield;
   for (let row = 0; row < rows - 1; row++) {
-    const idx = row * columns + column;
+    const idx = row * columns - column;
     if (newBf[idx] === null) {
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {

[Survived] ArithmeticOperator
src/state.ts:310:17
 ): Battlefield {
   const newBf = [...battlefield] as Battlefield;
   for (let row = 0; row < rows - 1; row++) {
-    const idx = row * columns + column;
+    const idx = row / columns + column;
     if (newBf[idx] === null) {
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {

[Killed] EqualityOperator
src/state.ts:311:9
   const newBf = [...battlefield] as Battlefield;
   for (let row = 0; row < rows - 1; row++) {
     const idx = row * columns + column;
-    if (newBf[idx] === null) {
+    if (newBf[idx] !== null) {
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {
         const behindIdx = behindRow * columns + column;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=18: p1 card total = 51, want 52: expected 51 to be 52 // Object.is equality

[Killed] ConditionalExpression
src/state.ts:311:9
   const newBf = [...battlefield] as Battlefield;
   for (let row = 0; row < rows - 1; row++) {
     const idx = row * columns + column;
-    if (newBf[idx] === null) {
+    if (true) {
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {
         const behindIdx = behindRow * columns + column;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=18: p1 card total = 51, want 52: expected 51 to be 52 // Object.is equality

[Killed] BlockStatement
src/state.ts:312:68
   for (let row = 0; row < rows - 1; row++) {
     const idx = row * columns + column;
     if (newBf[idx] === null) {
-      for (let behindRow = row + 1; behindRow < rows; behindRow++) {
-        const behindIdx = behindRow * columns + column;
-        const behindCard = newBf[behindIdx];
-        if (behindCard) {
-          newBf[idx] = { ...behindCard, position: { row, col: column } };
-          newBf[behindIdx] = null;
-          break;
-        }
-      }
+      for (let behindRow = row + 1; behindRow < rows; behindRow++) {}
     }
   }
killedBy: advanceBackRow with rows promotes row 1 to row 0 in 3-row grid
statusReason: expected null to be truthy

[Killed] UpdateOperator
src/state.ts:312:55
   for (let row = 0; row < rows - 1; row++) {
     const idx = row * columns + column;
     if (newBf[idx] === null) {
-      for (let behindRow = row + 1; behindRow < rows; behindRow++) {
+      for (let behindRow = row + 1; behindRow < rows; behindRow--) {
         const behindIdx = behindRow * columns + column;
         const behindCard = newBf[behindIdx];
killedBy: advanceBackRow with rows promotes row 1 to row 0 in 3-row grid
statusReason: expected null to be truthy

[Killed] ArithmeticOperator
src/state.ts:313:27
     const idx = row * columns + column;
     if (newBf[idx] === null) {
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {
-        const behindIdx = behindRow * columns + column;
+        const behindIdx = behindRow / columns + column;
         const behindCard = newBf[behindIdx];
         if (behindCard) {
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Survived] ArithmeticOperator
src/state.ts:313:27
     const idx = row * columns + column;
     if (newBf[idx] === null) {
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {
-        const behindIdx = behindRow * columns + column;
+        const behindIdx = behindRow * columns - column;
         const behindCard = newBf[behindIdx];
         if (behindCard) {

[Killed] ConditionalExpression
src/state.ts:315:13
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {
         const behindIdx = behindRow * columns + column;
         const behindCard = newBf[behindIdx];
-        if (behindCard) {
+        if (true) {
           newBf[idx] = { ...behindCard, position: { row, col: column } };
           newBf[behindIdx] = null;
killedBy: Golden Scenarios (TASK-205) Scenario 1: Heart shield — no stacking two hearts destroyed in same column — only last shields LP
statusReason: expected { position: { row: +0, col: +0 } } to be null

[Killed] ConditionalExpression
src/state.ts:315:13
       for (let behindRow = row + 1; behindRow < rows; behindRow++) {
         const behindIdx = behindRow * columns + column;
         const behindCard = newBf[behindIdx];
-        if (behindCard) {
+        if (false) {
           newBf[idx] = { ...behindCard, position: { row, col: column } };
           newBf[behindIdx] = null;
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Killed] ObjectLiteral
src/state.ts:316:24
         const behindIdx = behindRow * columns + column;
         const behindCard = newBf[behindIdx];
         if (behindCard) {
-          newBf[idx] = { ...behindCard, position: { row, col: column } };
+          newBf[idx] = {};
           newBf[behindIdx] = null;
           break;
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: Cannot read properties of undefined (reading 'face')

[Killed] BlockStatement
src/state.ts:334:12
   column: number,
   rows = 2,
   columns = 4,
-): boolean {
-  for (let row = 0; row < rows; row++) {
-    if (battlefield[row * columns + column] === null) return false;
-  }
-  return true;
-}
+): boolean {}
 
 /**
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is already full

[Killed] EqualityOperator
src/state.ts:335:21
   rows = 2,
   columns = 4,
 ): boolean {
-  for (let row = 0; row < rows; row++) {
+  for (let row = 0; row >= rows; row++) {
     if (battlefield[row * columns + column] === null) return false;
   }
killedBy: isColumnFull with rows returns false when 3-row column has empty slot
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/state.ts:335:40
   rows = 2,
   columns = 4,
 ): boolean {
-  for (let row = 0; row < rows; row++) {
-    if (battlefield[row * columns + column] === null) return false;
-  }
+  for (let row = 0; row < rows; row++) {}
   return true;
 }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is full

[Killed] BooleanLiteral
src/state.ts:336:62
   columns = 4,
 ): boolean {
   for (let row = 0; row < rows; row++) {
-    if (battlefield[row * columns + column] === null) return false;
+    if (battlefield[row * columns + column] === null) return true;
   }
   return true;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is full

[Killed] ConditionalExpression
src/state.ts:336:9
   columns = 4,
 ): boolean {
   for (let row = 0; row < rows; row++) {
-    if (battlefield[row * columns + column] === null) return false;
+    if (true) return false;
   }
   return true;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is already full

[Killed] BlockStatement
src/state.ts:350:18
   column: number,
   rows = 2,
   columns = 4,
-): number | null {
-  for (let row = rows - 1; row >= 0; row--) {
-    const idx = row * columns + column;
-    if (battlefield[idx] === null) return idx;
-  }
-  return null;
-}
+): number | null {}
 
 /**
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Grid position undefined is already occupied

[Killed] EqualityOperator
src/state.ts:351:28
   rows = 2,
   columns = 4,
 ): number | null {
-  for (let row = rows - 1; row >= 0; row--) {
+  for (let row = rows - 1; row < 0; row--) {
     const idx = row * columns + column;
     if (battlefield[idx] === null) return idx;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is already full

[Killed] ConditionalExpression
src/state.ts:351:28
   rows = 2,
   columns = 4,
 ): number | null {
-  for (let row = rows - 1; row >= 0; row--) {
+  for (let row = rows - 1; false; row--) {
     const idx = row * columns + column;
     if (battlefield[idx] === null) return idx;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is already full

[Killed] ArithmeticOperator
src/state.ts:352:17
   columns = 4,
 ): number | null {
   for (let row = rows - 1; row >= 0; row--) {
-    const idx = row * columns + column;
+    const idx = row / columns + column;
     if (battlefield[idx] === null) return idx;
   }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Column is already full

[Killed] ArithmeticOperator
src/state.ts:352:17
   columns = 4,
 ): number | null {
   for (let row = rows - 1; row >= 0; row--) {
-    const idx = row * columns + column;
+    const idx = row * columns - column;
     if (battlefield[idx] === null) return idx;
   }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Column is already full

[Killed] BlockStatement
src/state.ts:365:24
   state: GameState,
 ): { winnerIndex: number; victoryType: VictoryType } | null {
   // Victory by Pass Limit
-  if (state.passState) {
-    const rules = state.params.modePassRules;
-    for (let i = 0; i < 2; i++) {
-      const consecutive = state.passState.consecutivePasses[i] ?? 0;
-      const total = state.passState.totalPasses[i] ?? 0;
-      if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
-        return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'passLimit' };
-      }
-    }
-  }
+  if (state.passState) {}
 
   for (let i = 0; i < 2; i++) {
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:365:7
   state: GameState,
 ): { winnerIndex: number; victoryType: VictoryType } | null {
   // Victory by Pass Limit
-  if (state.passState) {
+  if (true) {
     const rules = state.params.modePassRules;
     for (let i = 0; i < 2; i++) {
killedBy: Targeted edge case probes attack into completely empty column sends all damage to LP
statusReason: Cannot read properties of undefined (reading 'consecutivePasses')

[Killed] BlockStatement
src/state.ts:367:33
   // Victory by Pass Limit
   if (state.passState) {
     const rules = state.params.modePassRules;
-    for (let i = 0; i < 2; i++) {
-      const consecutive = state.passState.consecutivePasses[i] ?? 0;
-      const total = state.passState.totalPasses[i] ?? 0;
-      if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
-        return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'passLimit' };
-      }
-    }
+    for (let i = 0; i < 2; i++) {}
   }
 
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:367:21
   // Victory by Pass Limit
   if (state.passState) {
     const rules = state.params.modePassRules;
-    for (let i = 0; i < 2; i++) {
+    for (let i = 0; false; i++) {
       const consecutive = state.passState.consecutivePasses[i] ?? 0;
       const total = state.passState.totalPasses[i] ?? 0;
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] LogicalOperator
src/state.ts:368:27
   if (state.passState) {
     const rules = state.params.modePassRules;
     for (let i = 0; i < 2; i++) {
-      const consecutive = state.passState.consecutivePasses[i] ?? 0;
+      const consecutive = state.passState.consecutivePasses[i] && 0;
       const total = state.passState.totalPasses[i] ?? 0;
       if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] LogicalOperator
src/state.ts:369:21
     const rules = state.params.modePassRules;
     for (let i = 0; i < 2; i++) {
       const consecutive = state.passState.consecutivePasses[i] ?? 0;
-      const total = state.passState.totalPasses[i] ?? 0;
+      const total = state.passState.totalPasses[i] && 0;
       if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
         return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'passLimit' };
killedBy: Pass limit enforcement total pass limit triggers gameOver with passLimit victory
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] EqualityOperator
src/state.ts:370:56
     for (let i = 0; i < 2; i++) {
       const consecutive = state.passState.consecutivePasses[i] ?? 0;
       const total = state.passState.totalPasses[i] ?? 0;
-      if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
+      if (consecutive >= rules.maxConsecutivePasses || total > rules.maxTotalPassesPerPlayer) {
         return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'passLimit' };
       }
killedBy: Pass limit enforcement total pass limit triggers gameOver with passLimit victory
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] EqualityOperator
src/state.ts:370:11
     for (let i = 0; i < 2; i++) {
       const consecutive = state.passState.consecutivePasses[i] ?? 0;
       const total = state.passState.totalPasses[i] ?? 0;
-      if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
+      if (consecutive < rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
         return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'passLimit' };
       }
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Action "system:init" is not allowed in phase "gameOver"

[Killed] ConditionalExpression
src/state.ts:371:31
       const consecutive = state.passState.consecutivePasses[i] ?? 0;
       const total = state.passState.totalPasses[i] ?? 0;
       if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
-        return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'passLimit' };
+        return { winnerIndex: false ? 1 : 0, victoryType: 'passLimit' };
       }
     }
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/state.ts:371:31
       const consecutive = state.passState.consecutivePasses[i] ?? 0;
       const total = state.passState.totalPasses[i] ?? 0;
       if (consecutive >= rules.maxConsecutivePasses || total >= rules.maxTotalPassesPerPlayer) {
-        return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'passLimit' };
+        return { winnerIndex: i !== 0 ? 1 : 0, victoryType: 'passLimit' };
       }
     }
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/state.ts:376:19
     }
   }
 
-  for (let i = 0; i < 2; i++) {
+  for (let i = 0; false; i++) {
     const opponent = state.players[i === 0 ? 1 : 0];
     if (!opponent) continue;
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
AttackResolution|attack:victory|gameOver

[Killed] BlockStatement
src/state.ts:376:31
     }
   }
 
-  for (let i = 0; i < 2; i++) {
-    const opponent = state.players[i === 0 ? 1 : 0];
-    if (!opponent) continue;
-
-    if (opponent.lifepoints <= 0) {
-      return { winnerIndex: i, victoryType: 'lpDepletion' };
-    }
-
-    const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
-    const hasHand = opponent.hand.length > 0;
-    const hasDrawpile = opponent.drawpile.length > 0;
-    if (!hasBattlefield && !hasHand && !hasDrawpile) {
-      return { winnerIndex: i, victoryType: 'cardDepletion' };
-    }
-  }
+  for (let i = 0; i < 2; i++) {}
 
   // TASK-201: Check for deck exhaustion during initialization
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
AttackResolution|attack:victory|gameOver

[Killed] ConditionalExpression
src/state.ts:377:36
   }
 
   for (let i = 0; i < 2; i++) {
-    const opponent = state.players[i === 0 ? 1 : 0];
+    const opponent = state.players[false ? 1 : 0];
     if (!opponent) continue;
 
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
AttackResolution|attack:victory|gameOver

[Survived] ConditionalExpression
src/state.ts:377:36
   }
 
   for (let i = 0; i < 2; i++) {
-    const opponent = state.players[i === 0 ? 1 : 0];
+    const opponent = state.players[true ? 1 : 0];
     if (!opponent) continue;
 

[Killed] ConditionalExpression
src/state.ts:378:9
 
   for (let i = 0; i < 2; i++) {
     const opponent = state.players[i === 0 ? 1 : 0];
-    if (!opponent) continue;
+    if (true) continue;
 
     if (opponent.lifepoints <= 0) {
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S6 DIRECT_DAMAGE_RISK: victory triggered when defender LP depleted, preview equals real event
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/state.ts:378:9
 
   for (let i = 0; i < 2; i++) {
     const opponent = state.players[i === 0 ? 1 : 0];
-    if (!opponent) continue;
+    if (opponent) continue;
 
     if (opponent.lifepoints <= 0) {
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
AttackResolution|attack:victory|gameOver

[Killed] ConditionalExpression
src/state.ts:380:9
     const opponent = state.players[i === 0 ? 1 : 0];
     if (!opponent) continue;
 
-    if (opponent.lifepoints <= 0) {
+    if (true) {
       return { winnerIndex: i, victoryType: 'lpDepletion' };
     }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality
