[Killed] EqualityOperator
src/state.ts:380:9
     const opponent = state.players[i === 0 ? 1 : 0];
     if (!opponent) continue;
 
-    if (opponent.lifepoints <= 0) {
+    if (opponent.lifepoints > 0) {
       return { winnerIndex: i, victoryType: 'lpDepletion' };
     }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Action "system:init" is not allowed in phase "gameOver"

[Killed] MethodExpression
src/state.ts:384:28
       return { winnerIndex: i, victoryType: 'lpDepletion' };
     }
 
-    const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
+    const hasBattlefield = opponent.battlefield.every((s: BattlefieldCard | null) => s !== null);
     const hasHand = opponent.hand.length > 0;
     const hasDrawpile = opponent.drawpile.length > 0;
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] ArrowFunction
src/state.ts:384:54
       return { winnerIndex: i, victoryType: 'lpDepletion' };
     }
 
-    const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
+    const hasBattlefield = opponent.battlefield.some(() => undefined);
     const hasHand = opponent.hand.length > 0;
     const hasDrawpile = opponent.drawpile.length > 0;
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] EqualityOperator
src/state.ts:385:21
     }
 
     const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
-    const hasHand = opponent.hand.length > 0;
+    const hasHand = opponent.hand.length <= 0;
     const hasDrawpile = opponent.drawpile.length > 0;
     if (!hasBattlefield && !hasHand && !hasDrawpile) {
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:385:21
     }
 
     const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
-    const hasHand = opponent.hand.length > 0;
+    const hasHand = false;
     const hasDrawpile = opponent.drawpile.length > 0;
     if (!hasBattlefield && !hasHand && !hasDrawpile) {
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] EqualityOperator
src/state.ts:386:25
 
     const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
     const hasHand = opponent.hand.length > 0;
-    const hasDrawpile = opponent.drawpile.length > 0;
+    const hasDrawpile = opponent.drawpile.length <= 0;
     if (!hasBattlefield && !hasHand && !hasDrawpile) {
       return { winnerIndex: i, victoryType: 'cardDepletion' };
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'EVEN_EXCHANGE' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:386:25
 
     const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
     const hasHand = opponent.hand.length > 0;
-    const hasDrawpile = opponent.drawpile.length > 0;
+    const hasDrawpile = false;
     if (!hasBattlefield && !hasHand && !hasDrawpile) {
       return { winnerIndex: i, victoryType: 'cardDepletion' };
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S2 EVEN_EXCHANGE: front destroyed exactly, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'EVEN_EXCHANGE' // Object.is equality

[Killed] BooleanLiteral
src/state.ts:387:28
     const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
     const hasHand = opponent.hand.length > 0;
     const hasDrawpile = opponent.drawpile.length > 0;
-    if (!hasBattlefield && !hasHand && !hasDrawpile) {
+    if (!hasBattlefield && hasHand && !hasDrawpile) {
       return { winnerIndex: i, victoryType: 'cardDepletion' };
     }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S7 reinforcementTriggered: defender hand non-empty, preview reinforcementRequired matches real
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] LogicalOperator
src/state.ts:387:9
     const hasBattlefield = opponent.battlefield.some((s: BattlefieldCard | null) => s !== null);
     const hasHand = opponent.hand.length > 0;
     const hasDrawpile = opponent.drawpile.length > 0;
-    if (!hasBattlefield && !hasHand && !hasDrawpile) {
+    if (!hasBattlefield || !hasHand && !hasDrawpile) {
       return { winnerIndex: i, victoryType: 'cardDepletion' };
     }
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected 'DIRECT_DAMAGE_RISK' to be 'LOSING_EXCHANGE' // Object.is equality

[Killed] ObjectLiteral
src/state.ts:388:14
     const hasHand = opponent.hand.length > 0;
     const hasDrawpile = opponent.drawpile.length > 0;
     if (!hasBattlefield && !hasHand && !hasDrawpile) {
-      return { winnerIndex: i, victoryType: 'cardDepletion' };
+      return {};
     }
   }
killedBy: Engine Coverage & Permutations Permutations: Grid & Rules victory by card depletion
statusReason: expected undefined to be 'cardDepletion' // Object.is equality

[Killed] BlockStatement
src/state.ts:395:27
   // TASK-201: Check for deck exhaustion during initialization
   // If either player has zero cards in their drawpile at match start (and not yet in DeploymentPhase),
   // they cannot proceed.
-  if (isStartTurn(state)) {
-    for (let i = 0; i < 2; i++) {
-      const p = state.players[i];
-      if (p?.drawpile.length === 0 && p.hand.length < state.params.initialDraw) {
-        return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'cardDepletion' };
-      }
-    }
-  }
+  if (isStartTurn(state)) {}
 
   return null;
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected 'StartTurn' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:395:7
   // TASK-201: Check for deck exhaustion during initialization
   // If either player has zero cards in their drawpile at match start (and not yet in DeploymentPhase),
   // they cannot proceed.
-  if (isStartTurn(state)) {
+  if (false) {
     for (let i = 0; i < 2; i++) {
       const p = state.players[i];
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected 'StartTurn' to be 'gameOver' // Object.is equality

[Killed] EqualityOperator
src/state.ts:396:21
   // If either player has zero cards in their drawpile at match start (and not yet in DeploymentPhase),
   // they cannot proceed.
   if (isStartTurn(state)) {
-    for (let i = 0; i < 2; i++) {
+    for (let i = 0; i >= 2; i++) {
       const p = state.players[i];
       if (p?.drawpile.length === 0 && p.hand.length < state.params.initialDraw) {
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected 'StartTurn' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:396:21
   // If either player has zero cards in their drawpile at match start (and not yet in DeploymentPhase),
   // they cannot proceed.
   if (isStartTurn(state)) {
-    for (let i = 0; i < 2; i++) {
+    for (let i = 0; false; i++) {
       const p = state.players[i];
       if (p?.drawpile.length === 0 && p.hand.length < state.params.initialDraw) {
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected 'StartTurn' to be 'gameOver' // Object.is equality

[Killed] EqualityOperator
src/state.ts:398:39
   if (isStartTurn(state)) {
     for (let i = 0; i < 2; i++) {
       const p = state.players[i];
-      if (p?.drawpile.length === 0 && p.hand.length < state.params.initialDraw) {
+      if (p?.drawpile.length === 0 && p.hand.length >= state.params.initialDraw) {
         return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'cardDepletion' };
       }
killedBy: Deck Exhaustion Reproduction (TASK-201) should reproduce crash on deck exhaustion during initialization
statusReason: expected 'StartTurn' to be 'gameOver' // Object.is equality

[Killed] EqualityOperator
src/state.ts:398:11
   if (isStartTurn(state)) {
     for (let i = 0; i < 2; i++) {
       const p = state.players[i];
-      if (p?.drawpile.length === 0 && p.hand.length < state.params.initialDraw) {
+      if (p?.drawpile.length !== 0 && p.hand.length < state.params.initialDraw) {
         return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'cardDepletion' };
       }
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Action "attack" is not allowed in phase "gameOver"

[Survived] ConditionalExpression
src/state.ts:399:31
     for (let i = 0; i < 2; i++) {
       const p = state.players[i];
       if (p?.drawpile.length === 0 && p.hand.length < state.params.initialDraw) {
-        return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'cardDepletion' };
+        return { winnerIndex: true ? 1 : 0, victoryType: 'cardDepletion' };
       }
     }

[Survived] ConditionalExpression
src/state.ts:399:31
     for (let i = 0; i < 2; i++) {
       const p = state.players[i];
       if (p?.drawpile.length === 0 && p.hand.length < state.params.initialDraw) {
-        return { winnerIndex: i === 0 ? 1 : 0, victoryType: 'cardDepletion' };
+        return { winnerIndex: false ? 1 : 0, victoryType: 'cardDepletion' };
       }
     }
