[Killed] BlockStatement
src/turns.ts:30:66
 import { isGameOver, isReinforcementPhase, isActionPhase } from '@phalanxduel/shared';
 
 /** Safely retrieve a player from state, throwing if missing. */
-function getPlayer(state: GameState, index: number): PlayerState {
-  const player = state.players[index];
-  if (!player) throw new Error(`No player at index ${index}`);
-  return player;
-}
+function getPlayer(state: GameState, index: number): PlayerState {}
 
 /**
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'hand')

[Killed] ConditionalExpression
src/turns.ts:32:7
 /** Safely retrieve a player from state, throwing if missing. */
 function getPlayer(state: GameState, index: number): PlayerState {
   const player = state.players[index];
-  if (!player) throw new Error(`No player at index ${index}`);
+  if (true) throw new Error(`No player at index ${index}`);
   return player;
 }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No player at index 1

[Killed] BooleanLiteral
src/turns.ts:32:7
 /** Safely retrieve a player from state, throwing if missing. */
 function getPlayer(state: GameState, index: number): PlayerState {
   const player = state.players[index];
-  if (!player) throw new Error(`No player at index ${index}`);
+  if (player) throw new Error(`No player at index ${index}`);
   return player;
 }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No player at index 1

[Killed] BlockStatement
src/turns.ts:40:84
  * Reset HP for all cards on a battlefield to their face value.
  * Used in Classic mode (RULES.md section 12: "No defense persists between turns").
  */
-function resetAllColumnsHp(battlefield: Battlefield, columns: number): Battlefield {
-  let bf = battlefield;
-  for (let col = 0; col < columns; col++) {
-    bf = resetColumnHp(bf, col, columns);
-  }
-  return bf;
-}
+function resetAllColumnsHp(battlefield: Battlefield, columns: number): Battlefield {}
 
 /**
killedBy: Property: invariants hold at every action step quickStart config (seed=42)
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/turns.ts:42:43
  */
 function resetAllColumnsHp(battlefield: Battlefield, columns: number): Battlefield {
   let bf = battlefield;
-  for (let col = 0; col < columns; col++) {
-    bf = resetColumnHp(bf, col, columns);
-  }
+  for (let col = 0; col < columns; col++) {}
   return bf;
 }
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: expected 5 to be 8 // Object.is equality

[Killed] EqualityOperator
src/turns.ts:42:21
  */
 function resetAllColumnsHp(battlefield: Battlefield, columns: number): Battlefield {
   let bf = battlefield;
-  for (let col = 0; col < columns; col++) {
+  for (let col = 0; col >= columns; col++) {
     bf = resetColumnHp(bf, col, columns);
   }
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: expected 5 to be 8 // Object.is equality

[Killed] BlockStatement
src/turns.ts:52:59
  * Apply Classic-mode HP reset to both players' battlefields.
  * In Classic mode, no card damage persists between turns.
  */
-function applyClassicHpReset(state: GameState): GameState {
-  if (state.params.modeDamagePersistence === 'cumulative') return state;
-  const columns = state.params.columns;
-  const players = [...state.players] as [PlayerState, PlayerState];
-  for (let i = 0; i < 2; i++) {
-    const p = players[i]!;
-    players[i] = { ...p, battlefield: resetAllColumnsHp(p.battlefield, columns) };
-  }
-  return { ...state, players };
-}
+function applyClassicHpReset(state: GameState): GameState {}
 
 /**
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] EqualityOperator
src/turns.ts:53:7
  * In Classic mode, no card damage persists between turns.
  */
 function applyClassicHpReset(state: GameState): GameState {
-  if (state.params.modeDamagePersistence === 'cumulative') return state;
+  if (state.params.modeDamagePersistence !== 'cumulative') return state;
   const columns = state.params.columns;
   const players = [...state.players] as [PlayerState, PlayerState];
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: expected 5 to be 8 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:53:7
  * In Classic mode, no card damage persists between turns.
  */
 function applyClassicHpReset(state: GameState): GameState {
-  if (state.params.modeDamagePersistence === 'cumulative') return state;
+  if (false) return state;
   const columns = state.params.columns;
   const players = [...state.players] as [PlayerState, PlayerState];
killedBy: Core Rules Verification (TASK-Coverage) DEF-001 / TASK-193: Classic Mode HP Reset (§12) does NOT reset defender card HP in Cumulative mode
statusReason: expected 10 to be 7 // Object.is equality

[Killed] UpdateOperator
src/turns.ts:56:26
   if (state.params.modeDamagePersistence === 'cumulative') return state;
   const columns = state.params.columns;
   const players = [...state.players] as [PlayerState, PlayerState];
-  for (let i = 0; i < 2; i++) {
+  for (let i = 0; i < 2; i--) {
     const p = players[i]!;
     players[i] = { ...p, battlefield: resetAllColumnsHp(p.battlefield, columns) };
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: Cannot read properties of undefined (reading 'battlefield')

[Killed] EqualityOperator
src/turns.ts:56:19
   if (state.params.modeDamagePersistence === 'cumulative') return state;
   const columns = state.params.columns;
   const players = [...state.players] as [PlayerState, PlayerState];
-  for (let i = 0; i < 2; i++) {
+  for (let i = 0; i <= 2; i++) {
     const p = players[i]!;
     players[i] = { ...p, battlefield: resetAllColumnsHp(p.battlefield, columns) };
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: Cannot read properties of undefined (reading 'battlefield')

[Killed] ObjectLiteral
src/turns.ts:58:18
   const players = [...state.players] as [PlayerState, PlayerState];
   for (let i = 0; i < 2; i++) {
     const p = players[i]!;
-    players[i] = { ...p, battlefield: resetAllColumnsHp(p.battlefield, columns) };
+    players[i] = {};
   }
   return { ...state, players };
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/turns.ts:66:96
 /**
  * Draw cards for a specific player up to maxHandSize.
  */
-function performDrawPhase(state: GameState, playerIndex: number, timestamp: string): GameState {
-  const player = getPlayer(state, playerIndex);
-  const maxHand = state.params.maxHandSize;
-  const currentHand = player.hand.length;
-  const toDraw = Math.max(0, maxHand - currentHand);
-
-  if (toDraw > 0 && player.drawpile.length > 0) {
-    // Limit by drawpile size
-    const count = Math.min(toDraw, player.drawpile.length);
-    return drawCards(state, playerIndex, count, timestamp);
-  }
-  return state;
-}
+function performDrawPhase(state: GameState, playerIndex: number, timestamp: string): GameState {}
 
 /**
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace cannot be destroyed if it is NOT at rank 0 (targetIndex == 0 rule)
statusReason: Cannot read properties of undefined (reading 'phase')

[Survived] MethodExpression
src/turns.ts:70:18
   const player = getPlayer(state, playerIndex);
   const maxHand = state.params.maxHandSize;
   const currentHand = player.hand.length;
-  const toDraw = Math.max(0, maxHand - currentHand);
+  const toDraw = Math.min(0, maxHand - currentHand);
 
   if (toDraw > 0 && player.drawpile.length > 0) {

[Survived] ArithmeticOperator
src/turns.ts:70:30
   const player = getPlayer(state, playerIndex);
   const maxHand = state.params.maxHandSize;
   const currentHand = player.hand.length;
-  const toDraw = Math.max(0, maxHand - currentHand);
+  const toDraw = Math.max(0, maxHand + currentHand);
 
   if (toDraw > 0 && player.drawpile.length > 0) {

[Survived] BlockStatement
src/turns.ts:72:49
   const currentHand = player.hand.length;
   const toDraw = Math.max(0, maxHand - currentHand);
 
-  if (toDraw > 0 && player.drawpile.length > 0) {
-    // Limit by drawpile size
-    const count = Math.min(toDraw, player.drawpile.length);
-    return drawCards(state, playerIndex, count, timestamp);
-  }
+  if (toDraw > 0 && player.drawpile.length > 0) {}
   return state;
 }

[Survived] EqualityOperator
src/turns.ts:72:7
   const currentHand = player.hand.length;
   const toDraw = Math.max(0, maxHand - currentHand);
 
-  if (toDraw > 0 && player.drawpile.length > 0) {
+  if (toDraw <= 0 && player.drawpile.length > 0) {
     // Limit by drawpile size
     const count = Math.min(toDraw, player.drawpile.length);

[Survived] MethodExpression
src/turns.ts:74:19
 
   if (toDraw > 0 && player.drawpile.length > 0) {
     // Limit by drawpile size
-    const count = Math.min(toDraw, player.drawpile.length);
+    const count = Math.max(toDraw, player.drawpile.length);
     return drawCards(state, playerIndex, count, timestamp);
   }

[Killed] BlockStatement
src/turns.ts:83:80
 /**
  * Strip transactionLog from state before hashing to avoid circular dependency.
  */
-function gameStateForHash(state: GameState): Omit<GameState, 'transactionLog'> {
-  const { transactionLog, ...rest } = state;
-  void transactionLog;
-  return rest;
-}
+function gameStateForHash(state: GameState): Omit<GameState, 'transactionLog'> {}
 
 function isSpecialStartWindowOpen(state: GameState): boolean {
killedBy: Golden Scenarios (TASK-205) Scenario 6: Replay equivalence replaying a deployment sequence produces identical state hash
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
src/turns.ts:89:62
   return rest;
 }
 
-function isSpecialStartWindowOpen(state: GameState): boolean {
-  if (!state.params.modeSpecialStart.enabled) return false;
-  return state.players.some((player: PlayerState) =>
-    player.battlefield.every((card: BattlefieldCard | null) => card === null),
-  );
-}
+function isSpecialStartWindowOpen(state: GameState): boolean {}
 
 function stepPhase(
killedBy: PHX-PASS-001: Pass Rule Enforcement does not count pass as a pass inside the Special Start window
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:90:7
 }
 
 function isSpecialStartWindowOpen(state: GameState): boolean {
-  if (!state.params.modeSpecialStart.enabled) return false;
+  if (false) return false;
   return state.players.some((player: PlayerState) =>
     player.battlefield.every((card: BattlefieldCard | null) => card === null),
killedBy: PHX-PASS-001: Pass Rule Enforcement treats pass as a pass outside the Special Start window
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:90:7
 }
 
 function isSpecialStartWindowOpen(state: GameState): boolean {
-  if (!state.params.modeSpecialStart.enabled) return false;
+  if (state.params.modeSpecialStart.enabled) return false;
   return state.players.some((player: PlayerState) =>
     player.battlefield.every((card: BattlefieldCard | null) => card === null),
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ArrowFunction
src/turns.ts:91:29
 
 function isSpecialStartWindowOpen(state: GameState): boolean {
   if (!state.params.modeSpecialStart.enabled) return false;
-  return state.players.some((player: PlayerState) =>
-    player.battlefield.every((card: BattlefieldCard | null) => card === null),
+  return state.players.some(() => undefined,
   );
 }
killedBy: PHX-PASS-001: Pass Rule Enforcement does not count pass as a pass inside the Special Start window
statusReason: expected 1 to be +0 // Object.is equality

[Survived] MethodExpression
src/turns.ts:91:10
 
 function isSpecialStartWindowOpen(state: GameState): boolean {
   if (!state.params.modeSpecialStart.enabled) return false;
-  return state.players.some((player: PlayerState) =>
-    player.battlefield.every((card: BattlefieldCard | null) => card === null),
-  );
+  return state.players.every((player: PlayerState) => player.battlefield.every((card: BattlefieldCard | null) => card === null));
 }
 

[Killed] ArrowFunction
src/turns.ts:92:30
 function isSpecialStartWindowOpen(state: GameState): boolean {
   if (!state.params.modeSpecialStart.enabled) return false;
   return state.players.some((player: PlayerState) =>
-    player.battlefield.every((card: BattlefieldCard | null) => card === null),
+    player.battlefield.every(() => undefined),
   );
 }
killedBy: PHX-PASS-001: Pass Rule Enforcement does not count pass as a pass inside the Special Start window
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:92:64
 function isSpecialStartWindowOpen(state: GameState): boolean {
   if (!state.params.modeSpecialStart.enabled) return false;
   return state.players.some((player: PlayerState) =>
-    player.battlefield.every((card: BattlefieldCard | null) => card === null),
+    player.battlefield.every((card: BattlefieldCard | null) => false),
   );
 }
killedBy: PHX-PASS-001: Pass Rule Enforcement does not count pass as a pass inside the Special Start window
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/turns.ts:102:14
   to: GamePhase,
   patch: Omit<Partial<GameState>, 'phase'> = {},
   onPhaseHop?: (from: GamePhase, trigger: TransitionTrigger, to: GamePhase) => void,
-): GameState {
-  assertTransition(state.phase, trigger, to);
-  onPhaseHop?.(state.phase, trigger, to);
-  return { ...state, ...patch, phase: to };
-}
+): GameState {}
 
 /**
killedBy: PHX-PASS-001: Pass Rule Enforcement increments pass counters when a player passes
statusReason: Action "pass" is not allowed in phase "undefined"

[Survived] OptionalChaining
src/turns.ts:104:3
   onPhaseHop?: (from: GamePhase, trigger: TransitionTrigger, to: GamePhase) => void,
 ): GameState {
   assertTransition(state.phase, trigger, to);
-  onPhaseHop?.(state.phase, trigger, to);
+  onPhaseHop(state.phase, trigger, to);
   return { ...state, ...patch, phase: to };
 }

[Killed] ConditionalExpression
src/turns.ts:128:7
   action: Action,
   options?: ApplyActionOptions,
 ): { valid: boolean; error?: string; implicitPass?: boolean } {
-  if (action.type === 'system:init') {
+  if (false) {
     if (!options?.allowSystemInit) {
       return { valid: false, error: 'system:init is an internal action' };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects system:init if not explicitly allowed
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:128:7
   action: Action,
   options?: ApplyActionOptions,
 ): { valid: boolean; error?: string; implicitPass?: boolean } {
-  if (action.type === 'system:init') {
+  if (true) {
     if (!options?.allowSystemInit) {
       return { valid: false, error: 'system:init is an internal action' };
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: system:init is an internal action

[Killed] BlockStatement
src/turns.ts:129:36
   options?: ApplyActionOptions,
 ): { valid: boolean; error?: string; implicitPass?: boolean } {
   if (action.type === 'system:init') {
-    if (!options?.allowSystemInit) {
-      return { valid: false, error: 'system:init is an internal action' };
-    }
+    if (!options?.allowSystemInit) {}
   }
 
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects system:init if not explicitly allowed
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:129:9
   options?: ApplyActionOptions,
 ): { valid: boolean; error?: string; implicitPass?: boolean } {
   if (action.type === 'system:init') {
-    if (!options?.allowSystemInit) {
+    if (true) {
       return { valid: false, error: 'system:init is an internal action' };
     }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: system:init is an internal action

[Killed] BooleanLiteral
src/turns.ts:130:23
 ): { valid: boolean; error?: string; implicitPass?: boolean } {
   if (action.type === 'system:init') {
     if (!options?.allowSystemInit) {
-      return { valid: false, error: 'system:init is an internal action' };
+      return { valid: true, error: 'system:init is an internal action' };
     }
   }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects system:init if not explicitly allowed
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/turns.ts:130:14
 ): { valid: boolean; error?: string; implicitPass?: boolean } {
   if (action.type === 'system:init') {
     if (!options?.allowSystemInit) {
-      return { valid: false, error: 'system:init is an internal action' };
+      return {};
     }
   }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects system:init if not explicitly allowed
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/turns.ts:134:51
     }
   }
 
-  if (!canHandleAction(state.phase, action.type)) {
-    return {
-      valid: false,
-      error: `Action "${action.type}" is not allowed in phase "${state.phase}"`,
-    };
-  }
+  if (!canHandleAction(state.phase, action.type)) {}
 
   if (
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects unknown action type
statusReason: expected 'Unknown action type' to match /is not allowed in phase/

[Killed] ConditionalExpression
src/turns.ts:134:7
     }
   }
 
-  if (!canHandleAction(state.phase, action.type)) {
+  if (false) {
     return {
       valid: false,
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects unknown action type
statusReason: expected 'Unknown action type' to match /is not allowed in phase/

[Killed] ObjectLiteral
src/turns.ts:135:12
   }
 
   if (!canHandleAction(state.phase, action.type)) {
-    return {
-      valid: false,
-      error: `Action "${action.type}" is not allowed in phase "${state.phase}"`,
-    };
+    return {};
   }
 
killedBy: Core Rules Verification (TASK-Coverage) DEF-009 / TASK-205-AC8: Duplicate Action Idempotency (§3) rejects a duplicate action that has already been applied
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/turns.ts:142:5
   }
 
   if (
-    action.type !== 'system:init' &&
-    action.type !== 'forfeit' &&
+    action.type !== 'system:init' || action.type !== 'forfeit' &&
     action.playerIndex !== state.activePlayerIndex
   ) {
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: Not this player's turn

[Killed] LogicalOperator
src/turns.ts:142:5
   }
 
   if (
-    action.type !== 'system:init' &&
-    action.type !== 'forfeit' &&
-    action.playerIndex !== state.activePlayerIndex
+    action.type !== 'system:init' && action.type !== 'forfeit' || action.playerIndex !== state.activePlayerIndex
   ) {
     return { valid: false, error: "Not this player's turn" };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: Not this player's turn

[Killed] EqualityOperator
src/turns.ts:143:5
 
   if (
     action.type !== 'system:init' &&
-    action.type !== 'forfeit' &&
+    action.type === 'forfeit' &&
     action.playerIndex !== state.activePlayerIndex
   ) {
killedBy: Phase guards: actions rejected in wrong phases any action by non-active player is rejected
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/turns.ts:143:5
 
   if (
     action.type !== 'system:init' &&
-    action.type !== 'forfeit' &&
+    true &&
     action.playerIndex !== state.activePlayerIndex
   ) {

[Killed] EqualityOperator
src/turns.ts:144:5
   if (
     action.type !== 'system:init' &&
     action.type !== 'forfeit' &&
-    action.playerIndex !== state.activePlayerIndex
+    action.playerIndex === state.activePlayerIndex
   ) {
     return { valid: false, error: "Not this player's turn" };
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Not this player's turn

[Killed] ConditionalExpression
src/turns.ts:144:5
   if (
     action.type !== 'system:init' &&
     action.type !== 'forfeit' &&
-    action.playerIndex !== state.activePlayerIndex
+    true
   ) {
     return { valid: false, error: "Not this player's turn" };
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Not this player's turn

[Killed] BlockStatement
src/turns.ts:145:5
     action.type !== 'system:init' &&
     action.type !== 'forfeit' &&
     action.playerIndex !== state.activePlayerIndex
-  ) {
-    return { valid: false, error: "Not this player's turn" };
-  }
+  ) {}
 
   switch (action.type) {
killedBy: Phase guards: actions rejected in wrong phases any action by non-active player is rejected
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:146:21
     action.type !== 'forfeit' &&
     action.playerIndex !== state.activePlayerIndex
   ) {
-    return { valid: false, error: "Not this player's turn" };
+    return { valid: true, error: "Not this player's turn" };
   }
 
killedBy: Phase guards: actions rejected in wrong phases any action by non-active player is rejected
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/turns.ts:146:12
     action.type !== 'forfeit' &&
     action.playerIndex !== state.activePlayerIndex
   ) {
-    return { valid: false, error: "Not this player's turn" };
+    return {};
   }
 
killedBy: Phase guards: actions rejected in wrong phases any action by non-active player is rejected
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/turns.ts:150:20
   }
 
   switch (action.type) {
-    case 'deploy': {
-      const player = state.players[action.playerIndex];
-      if (!player) return { valid: false, error: 'Invalid player index' };
-      if (action.column < 0 || action.column >= state.params.columns) {
-        return { valid: false, error: 'Column out of range' };
-      }
-      const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
-      }
-      if (
-        isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
-      ) {
-        return { valid: false, error: 'Column is full' };
-      }
-      return { valid: true };
-    }
+    case 'deploy': {}
 
     case 'attack': {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No attacker at selected column

[Killed] ConditionalExpression
src/turns.ts:150:5
   }
 
   switch (action.type) {
-    case 'deploy': {
-      const player = state.players[action.playerIndex];
-      if (!player) return { valid: false, error: 'Invalid player index' };
-      if (action.column < 0 || action.column >= state.params.columns) {
-        return { valid: false, error: 'Column out of range' };
-      }
-      const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
-      }
-      if (
-        isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
-      ) {
-        return { valid: false, error: 'Column is full' };
-      }
-      return { valid: true };
-    }
+    case 'deploy':
 
     case 'attack': {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No attacker at selected column

[Killed] ConditionalExpression
src/turns.ts:152:11
   switch (action.type) {
     case 'deploy': {
       const player = state.players[action.playerIndex];
-      if (!player) return { valid: false, error: 'Invalid player index' };
+      if (true) return { valid: false, error: 'Invalid player index' };
       if (action.column < 0 || action.column >= state.params.columns) {
         return { valid: false, error: 'Column out of range' };
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid player index

[Killed] BooleanLiteral
src/turns.ts:152:11
   switch (action.type) {
     case 'deploy': {
       const player = state.players[action.playerIndex];
-      if (!player) return { valid: false, error: 'Invalid player index' };
+      if (player) return { valid: false, error: 'Invalid player index' };
       if (action.column < 0 || action.column >= state.params.columns) {
         return { valid: false, error: 'Column out of range' };
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid player index

[Killed] LogicalOperator
src/turns.ts:153:11
     case 'deploy': {
       const player = state.players[action.playerIndex];
       if (!player) return { valid: false, error: 'Invalid player index' };
-      if (action.column < 0 || action.column >= state.params.columns) {
+      if (action.column < 0 && action.column >= state.params.columns) {
         return { valid: false, error: 'Column out of range' };
       }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: expected 'Card not found in hand' to match /Column out of range/

[Killed] EqualityOperator
src/turns.ts:153:11
     case 'deploy': {
       const player = state.players[action.playerIndex];
       if (!player) return { valid: false, error: 'Invalid player index' };
-      if (action.column < 0 || action.column >= state.params.columns) {
+      if (action.column <= 0 || action.column >= state.params.columns) {
         return { valid: false, error: 'Column out of range' };
       }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with card not in hand
statusReason: expected 'Column out of range' to match /Card not found in hand/

[Killed] BooleanLiteral
src/turns.ts:154:25
       const player = state.players[action.playerIndex];
       if (!player) return { valid: false, error: 'Invalid player index' };
       if (action.column < 0 || action.column >= state.params.columns) {
-        return { valid: false, error: 'Column out of range' };
+        return { valid: true, error: 'Column out of range' };
       }
       const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/turns.ts:154:39
       const player = state.players[action.playerIndex];
       if (!player) return { valid: false, error: 'Invalid player index' };
       if (action.column < 0 || action.column >= state.params.columns) {
-        return { valid: false, error: 'Column out of range' };
+        return { valid: false, error: "" };
       }
       const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with invalid column
statusReason: expected '' to match /Column out of range/

[Killed] ConditionalExpression
src/turns.ts:156:53
       if (action.column < 0 || action.column >= state.params.columns) {
         return { valid: false, error: 'Column out of range' };
       }
-      const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
+      const hasCard = player.hand.some((c: Card) => false);
       if (!hasCard) {
         return { valid: false, error: 'Card not found in hand' };
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 1 tests
{ seed: -274479832, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 29 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/turns.ts:156:40
       if (action.column < 0 || action.column >= state.params.columns) {
         return { valid: false, error: 'Column out of range' };
       }
-      const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
+      const hasCard = player.hand.some(() => undefined);
       if (!hasCard) {
         return { valid: false, error: 'Card not found in hand' };
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 1 tests
{ seed: -438404652, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 31 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
