[Killed] ConditionalExpression
src/turns.ts:157:11
         return { valid: false, error: 'Column out of range' };
       }
       const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
+      if (true) {
         return { valid: false, error: 'Card not found in hand' };
       }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy to a full column
statusReason: expected 'Card not found in hand' to match /Column is full/

[Killed] BlockStatement
src/turns.ts:157:21
         return { valid: false, error: 'Column out of range' };
       }
       const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
-      }
+      if (!hasCard) {}
       if (
         isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with card not in hand
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:158:25
       }
       const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
       if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
+        return { valid: true, error: 'Card not found in hand' };
       }
       if (
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with card not in hand
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/turns.ts:158:16
       }
       const hasCard = player.hand.some((c: Card) => c.id === action.cardId);
       if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
+        return {};
       }
       if (
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy with card not in hand
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:161:9
         return { valid: false, error: 'Card not found in hand' };
       }
       if (
-        isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
+        false
       ) {
         return { valid: false, error: 'Column is full' };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy to a full column
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:161:9
         return { valid: false, error: 'Card not found in hand' };
       }
       if (
-        isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
+        true
       ) {
         return { valid: false, error: 'Column is full' };
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Column is full

[Killed] BlockStatement
src/turns.ts:162:9
       }
       if (
         isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
-      ) {
-        return { valid: false, error: 'Column is full' };
-      }
+      ) {}
       return { valid: true };
     }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy to a full column
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:163:25
       if (
         isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
       ) {
-        return { valid: false, error: 'Column is full' };
+        return { valid: true, error: 'Column is full' };
       }
       return { valid: true };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy to a full column
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/turns.ts:163:16
       if (
         isColumnFull(player.battlefield, action.column, state.params.rows, state.params.columns)
       ) {
-        return { valid: false, error: 'Column is full' };
+        return {};
       }
       return { valid: true };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects deploy to a full column
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/turns.ts:168:20
       return { valid: true };
     }
 
-    case 'attack': {
-      const columns = state.params.columns;
-      if (action.attackingColumn < 0 || action.attackingColumn >= columns) {
-        return { valid: false, error: 'Only front-row cards can attack' };
-      }
-      if (action.defendingColumn !== action.attackingColumn) {
-        return { valid: false, error: 'Can only attack the column directly across' };
-      }
-      const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
-      if (!attacker) {
-        return { valid: false, error: 'No attacker at selected column' };
-      }
-      return { valid: true };
-    }
+    case 'attack': {}
 
     case 'reinforce': {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Card not found in hand

[Killed] ConditionalExpression
src/turns.ts:168:5
       return { valid: true };
     }
 
-    case 'attack': {
-      const columns = state.params.columns;
-      if (action.attackingColumn < 0 || action.attackingColumn >= columns) {
-        return { valid: false, error: 'Only front-row cards can attack' };
-      }
-      if (action.defendingColumn !== action.attackingColumn) {
-        return { valid: false, error: 'Can only attack the column directly across' };
-      }
-      const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
-      if (!attacker) {
-        return { valid: false, error: 'No attacker at selected column' };
-      }
-      return { valid: true };
-    }
+    case 'attack':
 
     case 'reinforce': {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Card not found in hand

[Killed] EqualityOperator
src/turns.ts:170:41
 
     case 'attack': {
       const columns = state.params.columns;
-      if (action.attackingColumn < 0 || action.attackingColumn >= columns) {
+      if (action.attackingColumn < 0 || action.attackingColumn < columns) {
         return { valid: false, error: 'Only front-row cards can attack' };
       }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Only front-row cards can attack

[Killed] EqualityOperator
src/turns.ts:170:11
 
     case 'attack': {
       const columns = state.params.columns;
-      if (action.attackingColumn < 0 || action.attackingColumn >= columns) {
+      if (action.attackingColumn >= 0 || action.attackingColumn >= columns) {
         return { valid: false, error: 'Only front-row cards can attack' };
       }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects attack with defendingColumn mismatch
statusReason: expected 'Only front-row cards can attack' to match /directly across/

[Killed] BooleanLiteral
src/turns.ts:171:25
     case 'attack': {
       const columns = state.params.columns;
       if (action.attackingColumn < 0 || action.attackingColumn >= columns) {
-        return { valid: false, error: 'Only front-row cards can attack' };
+        return { valid: true, error: 'Only front-row cards can attack' };
       }
       if (action.defendingColumn !== action.attackingColumn) {
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects attack with attackingColumn out of range
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/turns.ts:173:62
       if (action.attackingColumn < 0 || action.attackingColumn >= columns) {
         return { valid: false, error: 'Only front-row cards can attack' };
       }
-      if (action.defendingColumn !== action.attackingColumn) {
-        return { valid: false, error: 'Can only attack the column directly across' };
-      }
+      if (action.defendingColumn !== action.attackingColumn) {}
       const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
       if (!attacker) {
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects attack with defendingColumn mismatch
statusReason: expected 'No attacker at selected column' to match /directly across/

[Killed] EqualityOperator
src/turns.ts:173:11
       if (action.attackingColumn < 0 || action.attackingColumn >= columns) {
         return { valid: false, error: 'Only front-row cards can attack' };
       }
-      if (action.defendingColumn !== action.attackingColumn) {
+      if (action.defendingColumn === action.attackingColumn) {
         return { valid: false, error: 'Can only attack the column directly across' };
       }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Can only attack the column directly across

[Killed] BooleanLiteral
src/turns.ts:174:25
         return { valid: false, error: 'Only front-row cards can attack' };
       }
       if (action.defendingColumn !== action.attackingColumn) {
-        return { valid: false, error: 'Can only attack the column directly across' };
+        return { valid: true, error: 'Can only attack the column directly across' };
       }
       const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects attack with defendingColumn mismatch
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/turns.ts:174:16
         return { valid: false, error: 'Only front-row cards can attack' };
       }
       if (action.defendingColumn !== action.attackingColumn) {
-        return { valid: false, error: 'Can only attack the column directly across' };
+        return {};
       }
       const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects attack with defendingColumn mismatch
statusReason: expected undefined to be false // Object.is equality

[Survived] OptionalChaining
src/turns.ts:176:24
       if (action.defendingColumn !== action.attackingColumn) {
         return { valid: false, error: 'Can only attack the column directly across' };
       }
-      const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
+      const attacker = state.players[action.playerIndex].battlefield[action.attackingColumn];
       if (!attacker) {
         return { valid: false, error: 'No attacker at selected column' };

[Killed] ConditionalExpression
src/turns.ts:177:11
         return { valid: false, error: 'Can only attack the column directly across' };
       }
       const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
-      if (!attacker) {
+      if (true) {
         return { valid: false, error: 'No attacker at selected column' };
       }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: No attacker at selected column

[Killed] BooleanLiteral
src/turns.ts:177:11
         return { valid: false, error: 'Can only attack the column directly across' };
       }
       const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
-      if (!attacker) {
+      if (attacker) {
         return { valid: false, error: 'No attacker at selected column' };
       }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: No attacker at selected column

[Killed] BooleanLiteral
src/turns.ts:178:25
       }
       const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
       if (!attacker) {
-        return { valid: false, error: 'No attacker at selected column' };
+        return { valid: true, error: 'No attacker at selected column' };
       }
       return { valid: true };
killedBy: Core Rules Verification (TASK-Coverage) DEF-006 / TASK-202: validateAction Contract returns implicitPass for attack with no front-row attacker
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/turns.ts:178:39
       }
       const attacker = state.players[action.playerIndex]?.battlefield[action.attackingColumn];
       if (!attacker) {
-        return { valid: false, error: 'No attacker at selected column' };
+        return { valid: false, error: "" };
       }
       return { valid: true };
killedBy: Core Rules Verification (TASK-Coverage) DEF-006 / TASK-202: validateAction Contract returns implicitPass for attack with no front-row attacker
statusReason: expected '' to contain 'No attacker'

[Killed] ConditionalExpression
src/turns.ts:183:5
       return { valid: true };
     }
 
-    case 'reinforce': {
-      const reinforcePlayer = state.players[action.playerIndex];
-      if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
-      const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
-      }
-      if (!state.reinforcement) {
-        return { valid: false, error: 'No reinforcement context' };
-      }
-      return { valid: true };
-    }
+    case 'reinforce':
 
     case 'pass':
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with card not in hand
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/turns.ts:183:23
       return { valid: true };
     }
 
-    case 'reinforce': {
-      const reinforcePlayer = state.players[action.playerIndex];
-      if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
-      const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
-      }
-      if (!state.reinforcement) {
-        return { valid: false, error: 'No reinforcement context' };
-      }
-      return { valid: true };
-    }
+    case 'reinforce': {}
 
     case 'pass':
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with card not in hand
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:185:11
 
     case 'reinforce': {
       const reinforcePlayer = state.players[action.playerIndex];
-      if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
+      if (reinforcePlayer) return { valid: false, error: 'Invalid player index' };
       const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
       if (!hasCard) {
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with card not in hand
statusReason: expected 'Invalid player index' to match /Card not found in hand/

[Killed] ConditionalExpression
src/turns.ts:185:11
 
     case 'reinforce': {
       const reinforcePlayer = state.players[action.playerIndex];
-      if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
+      if (true) return { valid: false, error: 'Invalid player index' };
       const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
       if (!hasCard) {
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with card not in hand
statusReason: expected 'Invalid player index' to match /Card not found in hand/

[Killed] EqualityOperator
src/turns.ts:186:62
     case 'reinforce': {
       const reinforcePlayer = state.players[action.playerIndex];
       if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
-      const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
+      const hasCard = reinforcePlayer.hand.some((c: Card) => c.id !== action.cardId);
       if (!hasCard) {
         return { valid: false, error: 'Card not found in hand' };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with card not in hand
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:186:62
     case 'reinforce': {
       const reinforcePlayer = state.players[action.playerIndex];
       if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
-      const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
+      const hasCard = reinforcePlayer.hand.some((c: Card) => false);
       if (!hasCard) {
         return { valid: false, error: 'Card not found in hand' };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with no context
statusReason: expected 'Card not found in hand' to match /No reinforcement context/

[Killed] ConditionalExpression
src/turns.ts:187:11
       const reinforcePlayer = state.players[action.playerIndex];
       if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
       const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
+      if (false) {
         return { valid: false, error: 'Card not found in hand' };
       }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with card not in hand
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/turns.ts:187:21
       const reinforcePlayer = state.players[action.playerIndex];
       if (!reinforcePlayer) return { valid: false, error: 'Invalid player index' };
       const hasCard = reinforcePlayer.hand.some((c: Card) => c.id === action.cardId);
-      if (!hasCard) {
-        return { valid: false, error: 'Card not found in hand' };
-      }
+      if (!hasCard) {}
       if (!state.reinforcement) {
         return { valid: false, error: 'No reinforcement context' };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with card not in hand
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:190:11
       if (!hasCard) {
         return { valid: false, error: 'Card not found in hand' };
       }
-      if (!state.reinforcement) {
+      if (false) {
         return { valid: false, error: 'No reinforcement context' };
       }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with no context
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/turns.ts:190:33
       if (!hasCard) {
         return { valid: false, error: 'Card not found in hand' };
       }
-      if (!state.reinforcement) {
-        return { valid: false, error: 'No reinforcement context' };
-      }
+      if (!state.reinforcement) {}
       return { valid: true };
     }
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with no context
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:191:25
         return { valid: false, error: 'Card not found in hand' };
       }
       if (!state.reinforcement) {
-        return { valid: false, error: 'No reinforcement context' };
+        return { valid: true, error: 'No reinforcement context' };
       }
       return { valid: true };
killedBy: Engine Coverage & Permutations Action Validation Gaps rejects reinforce with no context
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/turns.ts:197:10
     }
 
     case 'pass':
-    case 'forfeit':
+    case "":
     case 'system:init':
       return { valid: true };
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Unknown action type

[Killed] ConditionalExpression
src/turns.ts:198:5
 
     case 'pass':
     case 'forfeit':
-    case 'system:init':
-      return { valid: true };
+    case 'system:init':
 
     default:
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: Unknown action type

[Killed] BooleanLiteral
src/turns.ts:199:23
     case 'pass':
     case 'forfeit':
     case 'system:init':
-      return { valid: true };
+      return { valid: false };
 
     default:
killedBy: computeBotAction - random strategy returns a deploy action during DeploymentPhase
statusReason: Invalid action

[NoCoverage] ConditionalExpression
src/turns.ts:201:5
     case 'system:init':
       return { valid: true };
 
-    default:
-      return { valid: false, error: 'Unknown action type' };
+    default:
   }
 }

[NoCoverage] BooleanLiteral
src/turns.ts:202:23
       return { valid: true };
 
     default:
-      return { valid: false, error: 'Unknown action type' };
+      return { valid: true, error: 'Unknown action type' };
   }
 }

[NoCoverage] StringLiteral
src/turns.ts:202:37
       return { valid: true };
 
     default:
-      return { valid: false, error: 'Unknown action type' };
+      return { valid: false, error: "" };
   }
 }

[Killed] ConditionalExpression
src/turns.ts:220:7
   timestamp: string,
   transition: TransitionFn,
 ): { resultState: GameState; details: TransactionDetail } {
-  if (!state.reinforcement) throw new Error('No reinforcement context');
+  if (true) throw new Error('No reinforcement context');
   const ctx = state.reinforcement;
   const player = getPlayer(state, action.playerIndex);
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: No reinforcement context

[Killed] BooleanLiteral
src/turns.ts:220:7
   timestamp: string,
   transition: TransitionFn,
 ): { resultState: GameState; details: TransactionDetail } {
-  if (!state.reinforcement) throw new Error('No reinforcement context');
+  if (state.reinforcement) throw new Error('No reinforcement context');
   const ctx = state.reinforcement;
   const player = getPlayer(state, action.playerIndex);
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: No reinforcement context

[Killed] ConditionalExpression
src/turns.ts:223:56
   if (!state.reinforcement) throw new Error('No reinforcement context');
   const ctx = state.reinforcement;
   const player = getPlayer(state, action.playerIndex);
-  const handIndex = player.hand.findIndex((c: Card) => c.id === action.cardId);
+  const handIndex = player.hand.findIndex((c: Card) => false);
 
   const gridIndex = getReinforcementTarget(
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid hand card index: -1

[Killed] ArrowFunction
src/turns.ts:223:43
   if (!state.reinforcement) throw new Error('No reinforcement context');
   const ctx = state.reinforcement;
   const player = getPlayer(state, action.playerIndex);
-  const handIndex = player.hand.findIndex((c: Card) => c.id === action.cardId);
+  const handIndex = player.hand.findIndex(() => undefined);
 
   const gridIndex = getReinforcementTarget(
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid hand card index: -1

[Killed] EqualityOperator
src/turns.ts:231:7
     state.params.rows,
     state.params.columns,
   );
-  if (gridIndex === null) {
+  if (gridIndex !== null) {
     throw new Error('Column is already full');
   }
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Column is already full

[Killed] ConditionalExpression
src/turns.ts:231:7
     state.params.rows,
     state.params.columns,
   );
-  if (gridIndex === null) {
+  if (true) {
     throw new Error('Column is already full');
   }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is already full

[NoCoverage] StringLiteral
src/turns.ts:232:21
     state.params.columns,
   );
   if (gridIndex === null) {
-    throw new Error('Column is already full');
+    throw new Error("");
   }
 

[Killed] EqualityOperator
src/turns.ts:251:21
     state.params.rows,
     state.params.columns,
   );
-  const handEmpty = updatedDefender.hand.length === 0;
+  const handEmpty = updatedDefender.hand.length !== 0;
 
   let reinforcementComplete = false;
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
ReinforcementPhase|reinforce:complete|DrawPhase

[Killed] ConditionalExpression
src/turns.ts:251:21
     state.params.rows,
     state.params.columns,
   );
-  const handEmpty = updatedDefender.hand.length === 0;
+  const handEmpty = false;
 
   let reinforcementComplete = false;
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
ReinforcementPhase|reinforce:complete|DrawPhase

[Survived] BooleanLiteral
src/turns.ts:253:31
   );
   const handEmpty = updatedDefender.hand.length === 0;
 
-  let reinforcementComplete = false;
+  let reinforcementComplete = true;
   let cardsDrawn = 0;
 

[Killed] ConditionalExpression
src/turns.ts:256:7
   let reinforcementComplete = false;
   let cardsDrawn = 0;
 
-  if (columnFull || handEmpty) {
+  if (false) {
     reinforcementComplete = true;
     newState = transition(newState, 'reinforce:complete', 'DrawPhase');
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 5 tests
{ seed: -1168553234, path: "4", endOnFailure: true }
Counterexample: [-2147483622]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/turns.ts:256:32
   let reinforcementComplete = false;
   let cardsDrawn = 0;
 
-  if (columnFull || handEmpty) {
-    reinforcementComplete = true;
-    newState = transition(newState, 'reinforce:complete', 'DrawPhase');
-    const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;
-    newState = performDrawPhase(newState, action.playerIndex, timestamp);
-    const handAfter = newState.players[action.playerIndex]?.hand.length ?? 0;
-    cardsDrawn = handAfter - handBefore;
-
-    newState = transition(newState, 'system:advance', 'EndTurn', {
-      activePlayerIndex: action.playerIndex,
-      turnNumber: state.turnNumber + 1,
-      reinforcement: undefined,
-    });
-    newState = applyClassicHpReset(newState);
-    newState = transition(newState, 'system:advance', 'StartTurn');
-    const finalVictory = checkVictory(newState);
-    if (finalVictory) {
-      newState = transition(newState, 'system:victory', 'gameOver', {
-        outcome: { ...finalVictory, turnNumber: newState.turnNumber },
-      });
-    } else {
-      newState = transition(newState, 'system:advance', 'AttackPhase');
-    }
-  }
+  if (columnFull || handEmpty) {}
 
   return {
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 27 tests
{ seed: -1181147767, path: "26", endOnFailure: true }
Counterexample: [1451310539]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BooleanLiteral
src/turns.ts:257:29
   let cardsDrawn = 0;
 
   if (columnFull || handEmpty) {
-    reinforcementComplete = true;
+    reinforcementComplete = false;
     newState = transition(newState, 'reinforce:complete', 'DrawPhase');
     const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;

[Killed] StringLiteral
src/turns.ts:258:59
 
   if (columnFull || handEmpty) {
     reinforcementComplete = true;
-    newState = transition(newState, 'reinforce:complete', 'DrawPhase');
+    newState = transition(newState, 'reinforce:complete', "");
     const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition ReinforcementPhase --reinforce:complete--> . Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Survived] LogicalOperator
src/turns.ts:259:24
   if (columnFull || handEmpty) {
     reinforcementComplete = true;
     newState = transition(newState, 'reinforce:complete', 'DrawPhase');
-    const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;
+    const handBefore = newState.players[action.playerIndex]?.hand.length && 0;
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
     const handAfter = newState.players[action.playerIndex]?.hand.length ?? 0;

[Survived] OptionalChaining
src/turns.ts:259:24
   if (columnFull || handEmpty) {
     reinforcementComplete = true;
     newState = transition(newState, 'reinforce:complete', 'DrawPhase');
-    const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;
+    const handBefore = newState.players[action.playerIndex].hand.length ?? 0;
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
     const handAfter = newState.players[action.playerIndex]?.hand.length ?? 0;

[Survived] LogicalOperator
src/turns.ts:261:23
     newState = transition(newState, 'reinforce:complete', 'DrawPhase');
     const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
-    const handAfter = newState.players[action.playerIndex]?.hand.length ?? 0;
+    const handAfter = newState.players[action.playerIndex]?.hand.length && 0;
     cardsDrawn = handAfter - handBefore;
 
