[Survived] OptionalChaining
src/turns.ts:261:23
     newState = transition(newState, 'reinforce:complete', 'DrawPhase');
     const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
-    const handAfter = newState.players[action.playerIndex]?.hand.length ?? 0;
+    const handAfter = newState.players[action.playerIndex].hand.length ?? 0;
     cardsDrawn = handAfter - handBefore;
 

[Survived] ArithmeticOperator
src/turns.ts:262:18
     const handBefore = newState.players[action.playerIndex]?.hand.length ?? 0;
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
     const handAfter = newState.players[action.playerIndex]?.hand.length ?? 0;
-    cardsDrawn = handAfter - handBefore;
+    cardsDrawn = handAfter + handBefore;
 
     newState = transition(newState, 'system:advance', 'EndTurn', {

[Survived] ArithmeticOperator
src/turns.ts:266:19
 
     newState = transition(newState, 'system:advance', 'EndTurn', {
       activePlayerIndex: action.playerIndex,
-      turnNumber: state.turnNumber + 1,
+      turnNumber: state.turnNumber - 1,
       reinforcement: undefined,
     });

[Killed] StringLiteral
src/turns.ts:270:55
       reinforcement: undefined,
     });
     newState = applyClassicHpReset(newState);
-    newState = transition(newState, 'system:advance', 'StartTurn');
+    newState = transition(newState, 'system:advance', "");
     const finalVictory = checkVictory(newState);
     if (finalVictory) {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition EndTurn --system:advance--> . Allowed: system:advance->StartTurn, forfeit->gameOver

[Killed] StringLiteral
src/turns.ts:270:37
       reinforcement: undefined,
     });
     newState = applyClassicHpReset(newState);
-    newState = transition(newState, 'system:advance', 'StartTurn');
+    newState = transition(newState, "", 'StartTurn');
     const finalVictory = checkVictory(newState);
     if (finalVictory) {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition EndTurn ----> StartTurn. Allowed: system:advance->StartTurn, forfeit->gameOver

[Killed] ConditionalExpression
src/turns.ts:272:9
     newState = applyClassicHpReset(newState);
     newState = transition(newState, 'system:advance', 'StartTurn');
     const finalVictory = checkVictory(newState);
-    if (finalVictory) {
+    if (true) {
       newState = transition(newState, 'system:victory', 'gameOver', {
         outcome: { ...finalVictory, turnNumber: newState.turnNumber },
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=18: outcome.winnerIndex invalid: expected [ +0, 1 ] to include undefined

[NoCoverage] BlockStatement
src/turns.ts:272:23
     newState = applyClassicHpReset(newState);
     newState = transition(newState, 'system:advance', 'StartTurn');
     const finalVictory = checkVictory(newState);
-    if (finalVictory) {
-      newState = transition(newState, 'system:victory', 'gameOver', {
-        outcome: { ...finalVictory, turnNumber: newState.turnNumber },
-      });
-    } else {
+    if (finalVictory) {} else {
       newState = transition(newState, 'system:advance', 'AttackPhase');
     }

[Killed] BlockStatement
src/turns.ts:276:12
       newState = transition(newState, 'system:victory', 'gameOver', {
         outcome: { ...finalVictory, turnNumber: newState.turnNumber },
       });
-    } else {
-      newState = transition(newState, 'system:advance', 'AttackPhase');
-    }
+    } else {}
   }
 
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: Unexpected phase in simulation loop: StartTurn

[Killed] ConditionalExpression
src/turns.ts:301:56
 ): { resultState: GameState; details: TransactionDetail } {
   const playerIndex = action.playerIndex;
   const player = getPlayer(state, playerIndex);
-  const handIndex = player.hand.findIndex((c: Card) => c.id === action.cardId);
+  const handIndex = player.hand.findIndex((c: Card) => false);
   const targetColumn = action.column;
 
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from deploy pass PhalanxEventSchema
statusReason: Expected transactionLog[1]

[Killed] ArrowFunction
src/turns.ts:301:43
 ): { resultState: GameState; details: TransactionDetail } {
   const playerIndex = action.playerIndex;
   const player = getPlayer(state, playerIndex);
-  const handIndex = player.hand.findIndex((c: Card) => c.id === action.cardId);
+  const handIndex = player.hand.findIndex(() => undefined);
   const targetColumn = action.column;
 
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from deploy pass PhalanxEventSchema
statusReason: Expected transactionLog[1]

[NoCoverage] StringLiteral
src/turns.ts:311:21
     state.params.columns,
   );
   if (gridIndex === null) {
-    throw new Error('Column is full');
+    throw new Error("");
   }
 

[Killed] ConditionalExpression
src/turns.ts:317:75
   let newState = deployCard(state, playerIndex, handIndex, gridIndex);
 
   const p0Full =
-    newState.players[0]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
+    newState.players[0]?.battlefield.every((s: BattlefieldCard | null) => false) ?? false;
   const p1Full =
     newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
killedBy: Golden Scenarios (TASK-205) Scenario 6: Replay equivalence full deployment + attack replay is deterministic
statusReason: expected 'DeploymentPhase' to be 'AttackPhase' // Object.is equality

[Killed] ArrowFunction
src/turns.ts:317:44
   let newState = deployCard(state, playerIndex, handIndex, gridIndex);
 
   const p0Full =
-    newState.players[0]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
+    newState.players[0]?.battlefield.every(() => undefined) ?? false;
   const p1Full =
     newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
killedBy: Golden Scenarios (TASK-205) Scenario 6: Replay equivalence full deployment + attack replay is deterministic
statusReason: expected 'DeploymentPhase' to be 'AttackPhase' // Object.is equality

[Killed] LogicalOperator
src/turns.ts:319:5
   const p0Full =
     newState.players[0]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
   const p1Full =
-    newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
+    newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) && false;
 
   if (p0Full && p1Full) {
killedBy: Golden Scenarios (TASK-205) Scenario 6: Replay equivalence full deployment + attack replay is deterministic
statusReason: expected 'DeploymentPhase' to be 'AttackPhase' // Object.is equality

[Killed] EqualityOperator
src/turns.ts:319:75
   const p0Full =
     newState.players[0]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
   const p1Full =
-    newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
+    newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s === null) ?? false;
 
   if (p0Full && p1Full) {
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: DeploymentPhase but no empty columns for player 1

[Killed] BlockStatement
src/turns.ts:321:25
   const p1Full =
     newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
 
-  if (p0Full && p1Full) {
-    const attackFirst = newState.params.initiative.attackFirst === 'P1' ? 0 : 1;
-    newState = transition(newState, 'deploy:complete', 'AttackPhase', {
-      activePlayerIndex: attackFirst,
-      turnNumber: 1,
-    });
-  } else {
+  if (p0Full && p1Full) {} else {
     newState = transition(newState, 'deploy', 'DeploymentPhase', {
       activePlayerIndex: playerIndex === 0 ? 1 : 0,
killedBy: Golden Scenarios (TASK-205) Scenario 6: Replay equivalence full deployment + attack replay is deterministic
statusReason: expected 'DeploymentPhase' to be 'AttackPhase' // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:321:7
   const p1Full =
     newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
 
-  if (p0Full && p1Full) {
+  if (false) {
     const attackFirst = newState.params.initiative.attackFirst === 'P1' ? 0 : 1;
     newState = transition(newState, 'deploy:complete', 'AttackPhase', {
killedBy: Golden Scenarios (TASK-205) Scenario 6: Replay equivalence full deployment + attack replay is deterministic
statusReason: expected 'DeploymentPhase' to be 'AttackPhase' // Object.is equality

[Survived] ConditionalExpression
src/turns.ts:322:25
     newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
 
   if (p0Full && p1Full) {
-    const attackFirst = newState.params.initiative.attackFirst === 'P1' ? 0 : 1;
+    const attackFirst = true ? 0 : 1;
     newState = transition(newState, 'deploy:complete', 'AttackPhase', {
       activePlayerIndex: attackFirst,

[Survived] EqualityOperator
src/turns.ts:322:25
     newState.players[1]?.battlefield.every((s: BattlefieldCard | null) => s !== null) ?? false;
 
   if (p0Full && p1Full) {
-    const attackFirst = newState.params.initiative.attackFirst === 'P1' ? 0 : 1;
+    const attackFirst = newState.params.initiative.attackFirst !== 'P1' ? 0 : 1;
     newState = transition(newState, 'deploy:complete', 'AttackPhase', {
       activePlayerIndex: attackFirst,

[Killed] StringLiteral
src/turns.ts:323:37
 
   if (p0Full && p1Full) {
     const attackFirst = newState.params.initiative.attackFirst === 'P1' ? 0 : 1;
-    newState = transition(newState, 'deploy:complete', 'AttackPhase', {
+    newState = transition(newState, "", 'AttackPhase', {
       activePlayerIndex: attackFirst,
       turnNumber: 1,
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 1 tests
{ seed: 1008793881, path: "0:1:1:1:0:6:0:0:0:1:10", endOnFailure: true }
Counterexample: [493030896]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/turns.ts:327:10
       activePlayerIndex: attackFirst,
       turnNumber: 1,
     });
-  } else {
-    newState = transition(newState, 'deploy', 'DeploymentPhase', {
-      activePlayerIndex: playerIndex === 0 ? 1 : 0,
-    });
-  }
+  } else {}
 
   return {
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: DeploymentPhase but no empty columns for player 1

[Killed] ObjectLiteral
src/turns.ts:328:66
       turnNumber: 1,
     });
   } else {
-    newState = transition(newState, 'deploy', 'DeploymentPhase', {
-      activePlayerIndex: playerIndex === 0 ? 1 : 0,
-    });
+    newState = transition(newState, 'deploy', 'DeploymentPhase', {});
   }
 
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: DeploymentPhase but no empty columns for player 1

[Killed] ConditionalExpression
src/turns.ts:329:26
     });
   } else {
     newState = transition(newState, 'deploy', 'DeploymentPhase', {
-      activePlayerIndex: playerIndex === 0 ? 1 : 0,
+      activePlayerIndex: true ? 1 : 0,
     });
   }
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: DeploymentPhase but no empty columns for player 1

[Killed] EqualityOperator
src/turns.ts:329:26
     });
   } else {
     newState = transition(newState, 'deploy', 'DeploymentPhase', {
-      activePlayerIndex: playerIndex === 0 ? 1 : 0,
+      activePlayerIndex: playerIndex !== 0 ? 1 : 0,
     });
   }
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: DeploymentPhase but no empty columns for player 1

[Killed] ObjectLiteral
src/turns.ts:335:14
 
   return {
     resultState: newState,
-    details: { type: 'deploy', gridIndex, phaseAfter: newState.phase },
+    details: {},
   };
 }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from deploy pass PhalanxEventSchema
statusReason: Unhandled details type: {}

[Killed] ConditionalExpression
src/turns.ts:348:25
 ): { resultState: GameState; details: TransactionDetail } {
   const attackerGridIndex = action.attackingColumn;
   const targetGridIndex = action.defendingColumn;
-  const defenderIndex = action.playerIndex === 0 ? 1 : 0;
+  const defenderIndex = true ? 1 : 0;
   const targetCol = targetGridIndex % state.params.columns;
 
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: expected 'AttackPhase' to be 'ReinforcementPhase' // Object.is equality

[Killed] EqualityOperator
src/turns.ts:348:25
 ): { resultState: GameState; details: TransactionDetail } {
   const attackerGridIndex = action.attackingColumn;
   const targetGridIndex = action.defendingColumn;
-  const defenderIndex = action.playerIndex === 0 ? 1 : 0;
+  const defenderIndex = action.playerIndex !== 0 ? 1 : 0;
   const targetCol = targetGridIndex % state.params.columns;
 
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Survived] ArithmeticOperator
src/turns.ts:349:21
   const attackerGridIndex = action.attackingColumn;
   const targetGridIndex = action.defendingColumn;
   const defenderIndex = action.playerIndex === 0 ? 1 : 0;
-  const targetCol = targetGridIndex % state.params.columns;
+  const targetCol = targetGridIndex * state.params.columns;
 
   const attackPassState = state.passState

[Killed] BooleanLiteral
src/turns.ts:375:32
   const combatEntry = attackResult.combatEntry;
 
   const immediateVictory = checkVictory(newState);
-  let reinforcementTriggered = false;
+  let reinforcementTriggered = true;
   let victoryTriggered = false;
 
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: Unexpected phase in simulation loop: DrawPhase

[Killed] BooleanLiteral
src/turns.ts:376:26
 
   const immediateVictory = checkVictory(newState);
   let reinforcementTriggered = false;
-  let victoryTriggered = false;
+  let victoryTriggered = true;
 
   if (immediateVictory) {
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S1 LOSING_EXCHANGE: front survives, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:378:7
   let reinforcementTriggered = false;
   let victoryTriggered = false;
 
-  if (immediateVictory) {
+  if (true) {
     victoryTriggered = true;
     newState = transition(newState, 'attack:victory', 'gameOver', {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=17: outcome.winnerIndex invalid: expected [ +0, 1 ] to include undefined

[Killed] BlockStatement
src/turns.ts:378:25
   let reinforcementTriggered = false;
   let victoryTriggered = false;
 
-  if (immediateVictory) {
-    victoryTriggered = true;
-    newState = transition(newState, 'attack:victory', 'gameOver', {
-      outcome: { ...immediateVictory, turnNumber: state.turnNumber },
-    });
-  } else {
+  if (immediateVictory) {} else {
     newState = transition(newState, 'system:advance', 'CleanupPhase');
     const defenderPlayer = getPlayer(newState, defenderIndex);
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S6 DIRECT_DAMAGE_RISK: victory triggered when defender LP depleted, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:379:24
   let victoryTriggered = false;
 
   if (immediateVictory) {
-    victoryTriggered = true;
+    victoryTriggered = false;
     newState = transition(newState, 'attack:victory', 'gameOver', {
       outcome: { ...immediateVictory, turnNumber: state.turnNumber },
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S6 DIRECT_DAMAGE_RISK: victory triggered when defender LP depleted, preview equals real event
statusReason: expected '{"type":"attack_resolved","turnNumber…' to be '{"type":"attack_resolved","turnNumber…' // Object.is equality

[Killed] StringLiteral
src/turns.ts:380:37
 
   if (immediateVictory) {
     victoryTriggered = true;
-    newState = transition(newState, 'attack:victory', 'gameOver', {
+    newState = transition(newState, "", 'gameOver', {
       outcome: { ...immediateVictory, turnNumber: state.turnNumber },
     });
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S6 DIRECT_DAMAGE_RISK: victory triggered when defender LP depleted, preview equals real event
statusReason: Invalid phase transition AttackResolution ----> gameOver. Allowed: system:advance->CleanupPhase, attack:victory->gameOver, forfeit->gameOver

[Killed] StringLiteral
src/turns.ts:380:55
 
   if (immediateVictory) {
     victoryTriggered = true;
-    newState = transition(newState, 'attack:victory', 'gameOver', {
+    newState = transition(newState, 'attack:victory', "", {
       outcome: { ...immediateVictory, turnNumber: state.turnNumber },
     });
killedBy: PHX-CP-001: simulateAttack resolution matches real attack.resolved payload S6 DIRECT_DAMAGE_RISK: victory triggered when defender LP depleted, preview equals real event
statusReason: Invalid phase transition AttackResolution --attack:victory--> . Allowed: system:advance->CleanupPhase, attack:victory->gameOver, forfeit->gameOver

[Killed] ObjectLiteral
src/turns.ts:381:16
   if (immediateVictory) {
     victoryTriggered = true;
     newState = transition(newState, 'attack:victory', 'gameOver', {
-      outcome: { ...immediateVictory, turnNumber: state.turnNumber },
+      outcome: {},
     });
   } else {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: seed=1 step=97: outcome.winnerIndex invalid: expected [ +0, 1 ] to include undefined

[Killed] BlockStatement
src/turns.ts:387:30
     newState = transition(newState, 'system:advance', 'CleanupPhase');
     const defenderPlayer = getPlayer(newState, defenderIndex);
     const frontAfter = defenderPlayer.battlefield[targetCol];
-    if (frontAfter === null) {
-      defenderPlayer.battlefield = advanceBackRow(
-        defenderPlayer.battlefield,
-        targetCol,
-        newState.params.rows,
-        newState.params.columns,
-      );
-    }
+    if (frontAfter === null) {}
 
     newState = transition(newState, 'system:advance', 'ReinforcementPhase');
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Killed] EqualityOperator
src/turns.ts:387:9
     newState = transition(newState, 'system:advance', 'CleanupPhase');
     const defenderPlayer = getPlayer(newState, defenderIndex);
     const frontAfter = defenderPlayer.battlefield[targetCol];
-    if (frontAfter === null) {
+    if (frontAfter !== null) {
       defenderPlayer.battlefield = advanceBackRow(
         defenderPlayer.battlefield,
killedBy: Golden Scenarios (TASK-205) Scenario 3: Back-rank ace survives ace attacker ace attacker overflow past front card does not destroy back-rank ace
statusReason: expected null not to be null

[Killed] LogicalOperator
src/turns.ts:399:7
     newState = transition(newState, 'system:advance', 'ReinforcementPhase');
     const defender = getPlayer(newState, defenderIndex);
     if (
-      defender.hand.length > 0 &&
-      !isColumnFull(defender.battlefield, targetCol, newState.params.rows, newState.params.columns)
+      defender.hand.length > 0 || !isColumnFull(defender.battlefield, targetCol, newState.params.rows, newState.params.columns)
     ) {
       reinforcementTriggered = true;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is already full

[Killed] ConditionalExpression
src/turns.ts:399:7
     newState = transition(newState, 'system:advance', 'ReinforcementPhase');
     const defender = getPlayer(newState, defenderIndex);
     if (
-      defender.hand.length > 0 &&
-      !isColumnFull(defender.battlefield, targetCol, newState.params.rows, newState.params.columns)
+      false
     ) {
       reinforcementTriggered = true;
killedBy: Core Rules Verification (TASK-Coverage) Rule 9: Suit Boundary Semantics proves Rule 9.1: Diamond (♦) Shield reduces damage to next target
statusReason: expected 10 to be 6 // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:400:7
     const defender = getPlayer(newState, defenderIndex);
     if (
       defender.hand.length > 0 &&
-      !isColumnFull(defender.battlefield, targetCol, newState.params.rows, newState.params.columns)
+      isColumnFull(defender.battlefield, targetCol, newState.params.rows, newState.params.columns)
     ) {
       reinforcementTriggered = true;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Column is already full

[Killed] BlockStatement
src/turns.ts:401:7
     if (
       defender.hand.length > 0 &&
       !isColumnFull(defender.battlefield, targetCol, newState.params.rows, newState.params.columns)
-    ) {
-      reinforcementTriggered = true;
-      newState.reinforcement = { column: targetCol, attackerIndex: action.playerIndex };
-      newState.activePlayerIndex = defenderIndex;
-    } else {
+    ) {} else {
       newState = transition(newState, 'system:advance', 'DrawPhase');
     }
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition ReinforcementPhase --system:advance--> EndTurn. Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Killed] BooleanLiteral
src/turns.ts:402:32
       defender.hand.length > 0 &&
       !isColumnFull(defender.battlefield, targetCol, newState.params.rows, newState.params.columns)
     ) {
-      reinforcementTriggered = true;
+      reinforcementTriggered = false;
       newState.reinforcement = { column: targetCol, attackerIndex: action.playerIndex };
       newState.activePlayerIndex = defenderIndex;
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition ReinforcementPhase --system:advance--> EndTurn. Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Killed] BlockStatement
src/turns.ts:405:12
       reinforcementTriggered = true;
       newState.reinforcement = { column: targetCol, attackerIndex: action.playerIndex };
       newState.activePlayerIndex = defenderIndex;
-    } else {
-      newState = transition(newState, 'system:advance', 'DrawPhase');
-    }
+    } else {}
 
     if (!reinforcementTriggered) {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition ReinforcementPhase --system:advance--> EndTurn. Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Killed] StringLiteral
src/turns.ts:406:39
       newState.reinforcement = { column: targetCol, attackerIndex: action.playerIndex };
       newState.activePlayerIndex = defenderIndex;
     } else {
-      newState = transition(newState, 'system:advance', 'DrawPhase');
+      newState = transition(newState, "", 'DrawPhase');
     }
 
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition ReinforcementPhase ----> DrawPhase. Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Killed] ConditionalExpression
src/turns.ts:409:9
       newState = transition(newState, 'system:advance', 'DrawPhase');
     }
 
-    if (!reinforcementTriggered) {
+    if (false) {
       newState = performDrawPhase(newState, action.playerIndex, timestamp);
       newState = transition(newState, 'system:advance', 'EndTurn', {
killedBy: Full game simulation plays a complete game to conclusion (seed=1)
statusReason: Unexpected phase in simulation loop: DrawPhase

[Killed] BooleanLiteral
src/turns.ts:409:9
       newState = transition(newState, 'system:advance', 'DrawPhase');
     }
 
-    if (!reinforcementTriggered) {
+    if (reinforcementTriggered) {
       newState = performDrawPhase(newState, action.playerIndex, timestamp);
       newState = transition(newState, 'system:advance', 'EndTurn', {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition ReinforcementPhase --system:advance--> EndTurn. Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Killed] ObjectLiteral
src/turns.ts:411:68
 
     if (!reinforcementTriggered) {
       newState = performDrawPhase(newState, action.playerIndex, timestamp);
-      newState = transition(newState, 'system:advance', 'EndTurn', {
-        activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
-        turnNumber: state.turnNumber + 1,
-      });
+      newState = transition(newState, 'system:advance', 'EndTurn', {});
       newState = applyClassicHpReset(newState);
       newState = transition(newState, 'system:advance', 'StartTurn');
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] StringLiteral
src/turns.ts:411:57
 
     if (!reinforcementTriggered) {
       newState = performDrawPhase(newState, action.playerIndex, timestamp);
-      newState = transition(newState, 'system:advance', 'EndTurn', {
+      newState = transition(newState, 'system:advance', "", {
         activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
         turnNumber: state.turnNumber + 1,
killedBy: Golden Scenarios (TASK-205) Scenario 5: Classic HP reset damaged card resets to full HP after turn completes in classic mode
statusReason: Invalid phase transition DrawPhase --system:advance--> . Allowed: system:advance->EndTurn, forfeit->gameOver

[Killed] ConditionalExpression
src/turns.ts:412:28
     if (!reinforcementTriggered) {
       newState = performDrawPhase(newState, action.playerIndex, timestamp);
       newState = transition(newState, 'system:advance', 'EndTurn', {
-        activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
+        activePlayerIndex: false ? 1 : 0,
         turnNumber: state.turnNumber + 1,
       });
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] EqualityOperator
src/turns.ts:412:28
     if (!reinforcementTriggered) {
       newState = performDrawPhase(newState, action.playerIndex, timestamp);
       newState = transition(newState, 'system:advance', 'EndTurn', {
-        activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
+        activePlayerIndex: action.playerIndex !== 0 ? 1 : 0,
         turnNumber: state.turnNumber + 1,
       });
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Survived] ArithmeticOperator
src/turns.ts:413:21
       newState = performDrawPhase(newState, action.playerIndex, timestamp);
       newState = transition(newState, 'system:advance', 'EndTurn', {
         activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
-        turnNumber: state.turnNumber + 1,
+        turnNumber: state.turnNumber - 1,
       });
       newState = applyClassicHpReset(newState);

[Survived] ConditionalExpression
src/turns.ts:418:11
       newState = applyClassicHpReset(newState);
       newState = transition(newState, 'system:advance', 'StartTurn');
       const finalVictory = checkVictory(newState);
-      if (finalVictory) {
+      if (false) {
         newState = transition(newState, 'system:victory', 'gameOver', {
           outcome: { ...finalVictory, turnNumber: newState.turnNumber },

[Killed] StringLiteral
src/turns.ts:423:59
           outcome: { ...finalVictory, turnNumber: newState.turnNumber },
         });
       } else {
-        newState = transition(newState, 'system:advance', 'AttackPhase');
+        newState = transition(newState, 'system:advance', "");
       }
     }
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: Invalid phase transition StartTurn --system:advance--> . Allowed: system:init->DeploymentPhase, system:init->AttackPhase, system:advance->AttackPhase, system:victory->gameOver, forfeit->gameOver
