[Killed] StringLiteral
src/turns.ts:423:41
           outcome: { ...finalVictory, turnNumber: newState.turnNumber },
         });
       } else {
-        newState = transition(newState, 'system:advance', 'AttackPhase');
+        newState = transition(newState, "", 'AttackPhase');
       }
     }
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through a full game
statusReason: Invalid phase transition StartTurn ----> AttackPhase. Allowed: system:init->DeploymentPhase, system:init->AttackPhase, system:advance->AttackPhase, system:victory->gameOver, forfeit->gameOver

[Killed] ObjectLiteral
src/turns.ts:428:26
     }
   }
 
-  const enrichedCombat = {
-    ...combatEntry,
-    causeLabels: [
-      ...(combatEntry.causeLabels ?? []),
-      ...(victoryTriggered ? (['victory'] as const) : []),
-      ...(reinforcementTriggered ? (['reinforce'] as const) : []),
-    ].filter((l, i, a) => a.indexOf(l) === i),
-  };
+  const enrichedCombat = {};
 
   return {
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: details.combat.steps is not iterable

[Survived] MethodExpression
src/turns.ts:430:18
 
   const enrichedCombat = {
     ...combatEntry,
-    causeLabels: [
-      ...(combatEntry.causeLabels ?? []),
-      ...(victoryTriggered ? (['victory'] as const) : []),
-      ...(reinforcementTriggered ? (['reinforce'] as const) : []),
-    ].filter((l, i, a) => a.indexOf(l) === i),
+    causeLabels: [...(combatEntry.causeLabels ?? []), ...(victoryTriggered ? ['victory'] as const : []), ...(reinforcementTriggered ? ['reinforce'] as const : [])],
   };
 

[Killed] LogicalOperator
src/turns.ts:431:11
   const enrichedCombat = {
     ...combatEntry,
     causeLabels: [
-      ...(combatEntry.causeLabels ?? []),
+      ...(combatEntry.causeLabels && []),
       ...(victoryTriggered ? (['victory'] as const) : []),
       ...(reinforcementTriggered ? (['reinforce'] as const) : []),
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Survived] ArrayDeclaration
src/turns.ts:432:55
     ...combatEntry,
     causeLabels: [
       ...(combatEntry.causeLabels ?? []),
-      ...(victoryTriggered ? (['victory'] as const) : []),
+      ...(victoryTriggered ? (['victory'] as const) : ["Stryker was here"]),
       ...(reinforcementTriggered ? (['reinforce'] as const) : []),
     ].filter((l, i, a) => a.indexOf(l) === i),

[Survived] ArrayDeclaration
src/turns.ts:433:63
     causeLabels: [
       ...(combatEntry.causeLabels ?? []),
       ...(victoryTriggered ? (['victory'] as const) : []),
-      ...(reinforcementTriggered ? (['reinforce'] as const) : []),
+      ...(reinforcementTriggered ? (['reinforce'] as const) : ["Stryker was here"]),
     ].filter((l, i, a) => a.indexOf(l) === i),
   };

[Survived] ConditionalExpression
src/turns.ts:434:27
       ...(combatEntry.causeLabels ?? []),
       ...(victoryTriggered ? (['victory'] as const) : []),
       ...(reinforcementTriggered ? (['reinforce'] as const) : []),
-    ].filter((l, i, a) => a.indexOf(l) === i),
+    ].filter((l, i, a) => false),
   };
 

[Survived] EqualityOperator
src/turns.ts:434:27
       ...(combatEntry.causeLabels ?? []),
       ...(victoryTriggered ? (['victory'] as const) : []),
       ...(reinforcementTriggered ? (['reinforce'] as const) : []),
-    ].filter((l, i, a) => a.indexOf(l) === i),
+    ].filter((l, i, a) => a.indexOf(l) !== i),
   };
 

[Killed] ObjectLiteral
src/turns.ts:437:10
     ].filter((l, i, a) => a.indexOf(l) === i),
   };
 
-  return {
-    resultState: newState,
-    details: {
-      type: 'attack',
-      combat: enrichedCombat,
-      reinforcementTriggered,
-      victoryTriggered,
-    },
-  };
+  return {};
 }
 
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Cannot read properties of undefined (reading 'undefined')

[Killed] ObjectLiteral
src/turns.ts:439:14
 
   return {
     resultState: newState,
-    details: {
-      type: 'attack',
-      combat: enrichedCombat,
-      reinforcementTriggered,
-      victoryTriggered,
-    },
+    details: {},
   };
 }
killedBy: PHX-EV-002: fingerprint determinism identical seed produces identical event arrays
statusReason: Unhandled details type: {}

[NoCoverage] BooleanLiteral
src/turns.ts:456:42
   transition: TransitionFn,
   options: { countPass?: boolean } = {},
 ): { resultState: GameState; details: TransactionDetail } {
-  const countPass = options.countPass ?? true;
+  const countPass = options.countPass ?? false;
   let newState: GameState;
   if (isReinforcementPhase(state)) {

[Survived] LogicalOperator
src/turns.ts:456:21
   transition: TransitionFn,
   options: { countPass?: boolean } = {},
 ): { resultState: GameState; details: TransactionDetail } {
-  const countPass = options.countPass ?? true;
+  const countPass = options.countPass && true;
   let newState: GameState;
   if (isReinforcementPhase(state)) {

[Killed] BlockStatement
src/turns.ts:458:36
 ): { resultState: GameState; details: TransactionDetail } {
   const countPass = options.countPass ?? true;
   let newState: GameState;
-  if (isReinforcementPhase(state)) {
-    newState = transition(state, 'pass', 'DrawPhase');
-    newState = performDrawPhase(newState, action.playerIndex, timestamp);
-    newState = transition(newState, 'system:advance', 'EndTurn', {
-      activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
-      turnNumber: state.turnNumber + 1,
-      reinforcement: undefined,
-    });
-    newState = applyClassicHpReset(newState);
-    newState = transition(newState, 'system:advance', 'StartTurn');
-  } else {
+  if (isReinforcementPhase(state)) {} else {
     newState = transition(state, 'pass', 'AttackResolution');
     newState = transition(newState, 'system:advance', 'CleanupPhase');
killedBy: Core Rules Verification (TASK-Coverage) DEF-001 / TASK-193: Classic Mode HP Reset (§12) resets defender card HP between turns in Classic mode
statusReason: Cannot read properties of undefined (reading 'passState')

[Killed] ConditionalExpression
src/turns.ts:458:7
 ): { resultState: GameState; details: TransactionDetail } {
   const countPass = options.countPass ?? true;
   let newState: GameState;
-  if (isReinforcementPhase(state)) {
+  if (true) {
     newState = transition(state, 'pass', 'DrawPhase');
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
killedBy: Engine Coverage & Permutations Permutations: Grid & Rules victory by card depletion
statusReason: Invalid phase transition AttackPhase --pass--> DrawPhase. Allowed: system:init->AttackPhase, attack->AttackResolution, pass->AttackResolution, forfeit->gameOver

[Killed] StringLiteral
src/turns.ts:461:37
   if (isReinforcementPhase(state)) {
     newState = transition(state, 'pass', 'DrawPhase');
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
-    newState = transition(newState, 'system:advance', 'EndTurn', {
+    newState = transition(newState, "", 'EndTurn', {
       activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
       turnNumber: state.turnNumber + 1,
killedBy: Core Rules Verification (TASK-Coverage) DEF-001 / TASK-193: Classic Mode HP Reset (§12) resets defender card HP between turns in Classic mode
statusReason: Invalid phase transition DrawPhase ----> EndTurn. Allowed: system:advance->EndTurn, forfeit->gameOver

[Survived] ConditionalExpression
src/turns.ts:462:26
     newState = transition(state, 'pass', 'DrawPhase');
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
     newState = transition(newState, 'system:advance', 'EndTurn', {
-      activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
+      activePlayerIndex: true ? 1 : 0,
       turnNumber: state.turnNumber + 1,
       reinforcement: undefined,

[Killed] StringLiteral
src/turns.ts:469:34
     newState = applyClassicHpReset(newState);
     newState = transition(newState, 'system:advance', 'StartTurn');
   } else {
-    newState = transition(state, 'pass', 'AttackResolution');
+    newState = transition(state, "", 'AttackResolution');
     newState = transition(newState, 'system:advance', 'CleanupPhase');
     newState = transition(newState, 'system:advance', 'ReinforcementPhase');
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Invalid phase transition AttackPhase ----> AttackResolution. Allowed: system:init->AttackPhase, attack->AttackResolution, pass->AttackResolution, forfeit->gameOver

[Killed] StringLiteral
src/turns.ts:469:42
     newState = applyClassicHpReset(newState);
     newState = transition(newState, 'system:advance', 'StartTurn');
   } else {
-    newState = transition(state, 'pass', 'AttackResolution');
+    newState = transition(state, 'pass', "");
     newState = transition(newState, 'system:advance', 'CleanupPhase');
     newState = transition(newState, 'system:advance', 'ReinforcementPhase');
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Invalid phase transition AttackPhase --pass--> . Allowed: system:init->AttackPhase, attack->AttackResolution, pass->AttackResolution, forfeit->gameOver

[Killed] StringLiteral
src/turns.ts:472:37
     newState = transition(state, 'pass', 'AttackResolution');
     newState = transition(newState, 'system:advance', 'CleanupPhase');
     newState = transition(newState, 'system:advance', 'ReinforcementPhase');
-    newState = transition(newState, 'system:advance', 'DrawPhase');
+    newState = transition(newState, "", 'DrawPhase');
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
     const prevPassState = state.passState ?? {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Invalid phase transition ReinforcementPhase ----> DrawPhase. Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Killed] LogicalOperator
src/turns.ts:474:27
     newState = transition(newState, 'system:advance', 'ReinforcementPhase');
     newState = transition(newState, 'system:advance', 'DrawPhase');
     newState = performDrawPhase(newState, action.playerIndex, timestamp);
-    const prevPassState = state.passState ?? {
-      consecutivePasses: [0, 0] as [number, number],
-      totalPasses: [0, 0] as [number, number],
-    };
+    const prevPassState = state.passState && {
+  consecutivePasses: [0, 0] as [number, number],
+  totalPasses: [0, 0] as [number, number]
+};
     const newConsecutive: [number, number] = [
       prevPassState.consecutivePasses[0],
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:483:9
       prevPassState.consecutivePasses[1],
     ];
     const newTotal: [number, number] = [prevPassState.totalPasses[0], prevPassState.totalPasses[1]];
-    if (countPass) {
+    if (false) {
       const pi = action.playerIndex as 0 | 1;
       newConsecutive[pi] += 1;
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] BlockStatement
src/turns.ts:483:20
       prevPassState.consecutivePasses[1],
     ];
     const newTotal: [number, number] = [prevPassState.totalPasses[0], prevPassState.totalPasses[1]];
-    if (countPass) {
-      const pi = action.playerIndex as 0 | 1;
-      newConsecutive[pi] += 1;
-      newTotal[pi] += 1;
-    }
+    if (countPass) {}
     newState = transition(newState, 'system:advance', 'EndTurn', {
       activePlayerIndex: action.playerIndex === 0 ? 1 : 0,
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] AssignmentOperator
src/turns.ts:485:7
     const newTotal: [number, number] = [prevPassState.totalPasses[0], prevPassState.totalPasses[1]];
     if (countPass) {
       const pi = action.playerIndex as 0 | 1;
-      newConsecutive[pi] += 1;
+      newConsecutive[pi] -= 1;
       newTotal[pi] += 1;
     }
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] AssignmentOperator
src/turns.ts:486:7
     if (countPass) {
       const pi = action.playerIndex as 0 | 1;
       newConsecutive[pi] += 1;
-      newTotal[pi] += 1;
+      newTotal[pi] -= 1;
     }
     newState = transition(newState, 'system:advance', 'EndTurn', {
killedBy: Pass limit enforcement total pass limit triggers gameOver with passLimit victory
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ObjectLiteral
src/turns.ts:506:10
     newState = transition(newState, 'system:advance', 'AttackPhase');
   }
 
-  return {
-    resultState: newState,
-    details: { type: 'pass' },
-  };
+  return {};
 }
 
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/turns.ts:521:7
   options?: ApplyActionOptions,
 ): GameState {
   const validation = validateAction(state, action, options);
-  if (!validation.valid) {
+  if (false) {
     throw new Error(validation.error ?? 'Invalid action');
   }
killedBy: Engine Coverage & Permutations State Manipulator Throws applyAction throws on validation error
statusReason: expected [Function] to throw error matching /not allowed in phase/ but got 'Invalid hand card index: -1'

[Killed] ConditionalExpression
src/turns.ts:521:7
   options?: ApplyActionOptions,
 ): GameState {
   const validation = validateAction(state, action, options);
-  if (!validation.valid) {
+  if (true) {
     throw new Error(validation.error ?? 'Invalid action');
   }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #6: determinism produces byte-identical results for a real replay entry
statusReason: Invalid action

[Killed] LogicalOperator
src/turns.ts:522:21
 ): GameState {
   const validation = validateAction(state, action, options);
   if (!validation.valid) {
-    throw new Error(validation.error ?? 'Invalid action');
+    throw new Error(validation.error && 'Invalid action');
   }
 
killedBy: Engine Coverage & Permutations State Manipulator Throws applyAction throws on validation error
statusReason: expected [Function] to throw error matching /not allowed in phase/ but got 'Invalid action'

[Killed] OptionalChaining
src/turns.ts:525:18
     throw new Error(validation.error ?? 'Invalid action');
   }
 
-  const hashFn = options?.hashFn;
+  const hashFn = options.hashFn;
   const timestamp = options?.timestamp ?? action.timestamp;
   const seqNum = (state.transactionLog ?? []).length;
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from deploy pass PhalanxEventSchema
statusReason: Expected transactionLog[1]

[Killed] LogicalOperator
src/turns.ts:526:21
   }
 
   const hashFn = options?.hashFn;
-  const timestamp = options?.timestamp ?? action.timestamp;
+  const timestamp = options?.timestamp && action.timestamp;
   const seqNum = (state.transactionLog ?? []).length;
   const hashBefore = hashFn ? hashFn(gameStateForHash(state)) : '';
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from system:init pass PhalanxEventSchema
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/turns.ts:526:21
   }
 
   const hashFn = options?.hashFn;
-  const timestamp = options?.timestamp ?? action.timestamp;
+  const timestamp = options.timestamp ?? action.timestamp;
   const seqNum = (state.transactionLog ?? []).length;
   const hashBefore = hashFn ? hashFn(gameStateForHash(state)) : '';
killedBy: PHX-EV-001: deriveEventsFromEntry AC #7: schema validity all events from deploy pass PhalanxEventSchema
statusReason: Expected transactionLog[1]

[Killed] LogicalOperator
src/turns.ts:527:19
 
   const hashFn = options?.hashFn;
   const timestamp = options?.timestamp ?? action.timestamp;
-  const seqNum = (state.transactionLog ?? []).length;
+  const seqNum = (state.transactionLog && []).length;
   const hashBefore = hashFn ? hashFn(gameStateForHash(state)) : '';
   const phaseTrace: PhaseHopTrace[] = [];
killedBy: PHX-EV-001: deriveEventsFromEntry AC #6: determinism produces byte-identical results for a real replay entry
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/turns.ts:527:43
 
   const hashFn = options?.hashFn;
   const timestamp = options?.timestamp ?? action.timestamp;
-  const seqNum = (state.transactionLog ?? []).length;
+  const seqNum = (state.transactionLog ?? ["Stryker was here"]).length;
   const hashBefore = hashFn ? hashFn(gameStateForHash(state)) : '';
   const phaseTrace: PhaseHopTrace[] = [];
killedBy: Audit Trail — Hash Chain Integrity hash chain is continuous through deployment phase
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrayDeclaration
src/turns.ts:529:39
   const timestamp = options?.timestamp ?? action.timestamp;
   const seqNum = (state.transactionLog ?? []).length;
   const hashBefore = hashFn ? hashFn(gameStateForHash(state)) : '';
-  const phaseTrace: PhaseHopTrace[] = [];
+  const phaseTrace: PhaseHopTrace[] = ["Stryker was here"];
   const transition = (
     currentState: GameState,
killedBy: phase trace fixture parity system:init enters DeploymentPhase when classic deployment is enabled
statusReason: expected [ 'Stryker was here', …(1) ] to deeply equal [ { from: 'StartTurn', …(2) } ]

[Killed] ArrowFunction
src/turns.ts:530:22
   const seqNum = (state.transactionLog ?? []).length;
   const hashBefore = hashFn ? hashFn(gameStateForHash(state)) : '';
   const phaseTrace: PhaseHopTrace[] = [];
-  const transition = (
-    currentState: GameState,
-    trigger: TransitionTrigger,
-    to: GamePhase,
-    patch: Omit<Partial<GameState>, 'phase'> = {},
-  ): GameState =>
-    stepPhase(currentState, trigger, to, patch, (from, phaseTrigger, next) => {
-      phaseTrace.push({ from, trigger: phaseTrigger, to: next });
-    });
+  const transition = () => undefined;
 
   let resultState: GameState;
killedBy: Audit Trail — Hash Chain Integrity system:init produces a transaction log entry with valid hashes
statusReason: Cannot destructure property 'transactionLog' of 'state' as it is undefined.

[Killed] BlockStatement
src/turns.ts:536:79
     to: GamePhase,
     patch: Omit<Partial<GameState>, 'phase'> = {},
   ): GameState =>
-    stepPhase(currentState, trigger, to, patch, (from, phaseTrigger, next) => {
-      phaseTrace.push({ from, trigger: phaseTrigger, to: next });
-    });
+    stepPhase(currentState, trigger, to, patch, (from, phaseTrigger, next) => {});
 
   let resultState: GameState;
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
StartTurn|system:init|DeploymentPhase
StartTurn|system:init|AttackPhase
StartTurn|system:advance|AttackPhase
StartTurn|system:victory|gameOver
StartTurn|forfeit|gameOver
DeploymentPhase|system:init|DeploymentPhase
AttackPhase|system:init|AttackPhase

[Killed] ConditionalExpression
src/turns.ts:544:5
   let details: TransactionDetail;
 
   switch (action.type) {
-    case 'deploy': {
-      const result = applyDeploy(state, action, transition);
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'deploy':
 
     case 'attack': {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition DeploymentPhase --attack--> AttackResolution. Allowed: system:init->DeploymentPhase, deploy->DeploymentPhase, deploy:complete->AttackPhase, forfeit->gameOver

[Killed] BlockStatement
src/turns.ts:544:20
   let details: TransactionDetail;
 
   switch (action.type) {
-    case 'deploy': {
-      const result = applyDeploy(state, action, transition);
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'deploy': {}
 
     case 'attack': {
killedBy: Property: invariants hold at every action step standard config (seed=1)
statusReason: Invalid phase transition DeploymentPhase --attack--> AttackResolution. Allowed: system:init->DeploymentPhase, deploy->DeploymentPhase, deploy:complete->AttackPhase, forfeit->gameOver

[Killed] BlockStatement
src/turns.ts:551:20
       break;
     }
 
-    case 'attack': {
-      const result = applyAttack(state, action, timestamp, transition);
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'attack': {}
 
     case 'pass': {
killedBy: Targeted edge case probes attack into completely empty column sends all damage to LP
statusReason: expected 20 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:551:5
       break;
     }
 
-    case 'attack': {
-      const result = applyAttack(state, action, timestamp, transition);
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'attack':
 
     case 'pass': {
killedBy: Targeted edge case probes attack into completely empty column sends all damage to LP
statusReason: expected 20 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:558:5
       break;
     }
 
-    case 'pass': {
-      const specialStartWindowOpen = isSpecialStartWindowOpen(state);
-      const result = applyPass(state, action, timestamp, transition, {
-        countPass: !specialStartWindowOpen,
-      });
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'pass':
 
     case 'reinforce': {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: No reinforcement context

[Killed] BlockStatement
src/turns.ts:558:18
       break;
     }
 
-    case 'pass': {
-      const specialStartWindowOpen = isSpecialStartWindowOpen(state);
-      const result = applyPass(state, action, timestamp, transition, {
-        countPass: !specialStartWindowOpen,
-      });
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'pass': {}
 
     case 'reinforce': {
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: No reinforcement context

[Killed] BooleanLiteral
src/turns.ts:561:20
     case 'pass': {
       const specialStartWindowOpen = isSpecialStartWindowOpen(state);
       const result = applyPass(state, action, timestamp, transition, {
-        countPass: !specialStartWindowOpen,
+        countPass: specialStartWindowOpen,
       });
       resultState = result.resultState;
killedBy: Pass limit enforcement consecutive pass limit triggers gameOver with passLimit victory (loser is the passer)
statusReason: expected 'AttackPhase' to be 'gameOver' // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:568:5
       break;
     }
 
-    case 'reinforce': {
-      const result = applyReinforce(state, action, timestamp, transition);
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'reinforce':
 
     case 'forfeit': {
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
ReinforcementPhase|reinforce|ReinforcementPhase
ReinforcementPhase|reinforce:complete|DrawPhase

[Killed] BlockStatement
src/turns.ts:568:23
       break;
     }
 
-    case 'reinforce': {
-      const result = applyReinforce(state, action, timestamp, transition);
-      resultState = result.resultState;
-      details = result.details;
-      break;
-    }
+    case 'reinforce': {}
 
     case 'forfeit': {
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Missing Transitions:
ReinforcementPhase|reinforce|ReinforcementPhase
ReinforcementPhase|reinforce:complete|DrawPhase

[Killed] ConditionalExpression
src/turns.ts:575:5
       break;
     }
 
-    case 'forfeit': {
-      const winnerIndex = action.playerIndex === 0 ? 1 : 0;
-      resultState = transition(state, 'forfeit', 'gameOver', {
-        outcome: {
-          winnerIndex,
-          victoryType: 'forfeit',
-          turnNumber: state.turnNumber,
-        },
-      });
-      details = { type: 'forfeit', winnerIndex };
-      // Ensure the action recorded in the log is fully schema-compliant
-      action = {
-        ...action,
-        playerIndex: action.playerIndex,
-      };
-      break;
-    }
+    case 'forfeit':
 
     case 'system:init': {
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Invalid phase transition AttackResolution --system:init--> DeploymentPhase. Allowed: system:advance->CleanupPhase, attack:victory->gameOver, forfeit->gameOver

[Killed] BlockStatement
src/turns.ts:575:21
       break;
     }
 
-    case 'forfeit': {
-      const winnerIndex = action.playerIndex === 0 ? 1 : 0;
-      resultState = transition(state, 'forfeit', 'gameOver', {
-        outcome: {
-          winnerIndex,
-          victoryType: 'forfeit',
-          turnNumber: state.turnNumber,
-        },
-      });
-      details = { type: 'forfeit', winnerIndex };
-      // Ensure the action recorded in the log is fully schema-compliant
-      action = {
-        ...action,
-        playerIndex: action.playerIndex,
-      };
-      break;
-    }
+    case 'forfeit': {}
 
     case 'system:init': {
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Invalid phase transition AttackResolution --system:init--> DeploymentPhase. Allowed: system:advance->CleanupPhase, attack:victory->gameOver, forfeit->gameOver

[Survived] ConditionalExpression
src/turns.ts:576:27
     }
 
     case 'forfeit': {
-      const winnerIndex = action.playerIndex === 0 ? 1 : 0;
+      const winnerIndex = true ? 1 : 0;
       resultState = transition(state, 'forfeit', 'gameOver', {
         outcome: {

[Survived] EqualityOperator
src/turns.ts:576:27
     }
 
     case 'forfeit': {
-      const winnerIndex = action.playerIndex === 0 ? 1 : 0;
+      const winnerIndex = action.playerIndex !== 0 ? 1 : 0;
       resultState = transition(state, 'forfeit', 'gameOver', {
         outcome: {

[Killed] StringLiteral
src/turns.ts:577:39
 
     case 'forfeit': {
       const winnerIndex = action.playerIndex === 0 ? 1 : 0;
-      resultState = transition(state, 'forfeit', 'gameOver', {
+      resultState = transition(state, "", 'gameOver', {
         outcome: {
           winnerIndex,
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Invalid phase transition ReinforcementPhase ----> gameOver. Allowed: system:init->ReinforcementPhase, reinforce->ReinforcementPhase, system:advance->DrawPhase, reinforce:complete->DrawPhase, pass->DrawPhase, forfeit->gameOver

[Killed] ObjectLiteral
src/turns.ts:578:18
     case 'forfeit': {
       const winnerIndex = action.playerIndex === 0 ? 1 : 0;
       resultState = transition(state, 'forfeit', 'gameOver', {
-        outcome: {
-          winnerIndex,
-          victoryType: 'forfeit',
-          turnNumber: state.turnNumber,
-        },
+        outcome: {},
       });
       details = { type: 'forfeit', winnerIndex };
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 1 tests
{ seed: 1044172616, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] StringLiteral
src/turns.ts:584:25
           turnNumber: state.turnNumber,
         },
       });
-      details = { type: 'forfeit', winnerIndex };
+      details = { type: "", winnerIndex };
       // Ensure the action recorded in the log is fully schema-compliant
       action = {

[Survived] ObjectLiteral
src/turns.ts:586:16
       });
       details = { type: 'forfeit', winnerIndex };
       // Ensure the action recorded in the log is fully schema-compliant
-      action = {
-        ...action,
-        playerIndex: action.playerIndex,
-      };
+      action = {};
       break;
     }
