[Killed] BlockStatement
src/turns.ts:593:25
       break;
     }
 
-    case 'system:init': {
-      // TASK-201: If already in an active phase, system:init is a no-op (redundant call).
-      if (isActionPhase(state)) {
-        resultState = transition(state, 'system:init', state.phase);
-        details = { type: 'pass' };
-        break;
-      }
-
-      const skipDeployment = state.params.modeQuickStart;
-      const toPhase =
-        state.params.modeClassicDeployment && !skipDeployment ? 'DeploymentPhase' : 'AttackPhase';
-      const patch: Omit<Partial<GameState>, 'phase'> = {};
-
-      if (skipDeployment) {
-        patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
-        patch.turnNumber = 1;
-      } else if (toPhase === 'DeploymentPhase') {
-        patch.activePlayerIndex = state.params.initiative.deployFirst === 'P1' ? 0 : 1;
-      }
-
-      resultState = transition(state, 'system:init', toPhase, patch);
-      details = { type: 'system:init' };
-      break;
-    }
+    case 'system:init': {}
   }
 
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Cannot read properties of undefined (reading 'rows')

[Killed] ConditionalExpression
src/turns.ts:593:5
       break;
     }
 
-    case 'system:init': {
-      // TASK-201: If already in an active phase, system:init is a no-op (redundant call).
-      if (isActionPhase(state)) {
-        resultState = transition(state, 'system:init', state.phase);
-        details = { type: 'pass' };
-        break;
-      }
-
-      const skipDeployment = state.params.modeQuickStart;
-      const toPhase =
-        state.params.modeClassicDeployment && !skipDeployment ? 'DeploymentPhase' : 'AttackPhase';
-      const patch: Omit<Partial<GameState>, 'phase'> = {};
-
-      if (skipDeployment) {
-        patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
-        patch.turnNumber = 1;
-      } else if (toPhase === 'DeploymentPhase') {
-        patch.activePlayerIndex = state.params.initiative.deployFirst === 'P1' ? 0 : 1;
-      }
-
-      resultState = transition(state, 'system:init', toPhase, patch);
-      details = { type: 'system:init' };
-      break;
-    }
+    case 'system:init':
   }
 
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Cannot read properties of undefined (reading 'rows')

[Killed] BlockStatement
src/turns.ts:595:33
 
     case 'system:init': {
       // TASK-201: If already in an active phase, system:init is a no-op (redundant call).
-      if (isActionPhase(state)) {
-        resultState = transition(state, 'system:init', state.phase);
-        details = { type: 'pass' };
-        break;
-      }
+      if (isActionPhase(state)) {}
 
       const skipDeployment = state.params.modeQuickStart;
killedBy: Engine Coverage & Permutations State Manipulator Throws system:init is no-op in action phase
statusReason: expected 'system:init' to be 'pass' // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:595:11
 
     case 'system:init': {
       // TASK-201: If already in an active phase, system:init is a no-op (redundant call).
-      if (isActionPhase(state)) {
+      if (true) {
         resultState = transition(state, 'system:init', state.phase);
         details = { type: 'pass' };
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Invalid phase transition StartTurn --system:init--> StartTurn. Allowed: system:init->DeploymentPhase, system:init->AttackPhase, system:advance->AttackPhase, system:victory->gameOver, forfeit->gameOver

[Killed] LogicalOperator
src/turns.ts:603:9
 
       const skipDeployment = state.params.modeQuickStart;
       const toPhase =
-        state.params.modeClassicDeployment && !skipDeployment ? 'DeploymentPhase' : 'AttackPhase';
+        state.params.modeClassicDeployment || !skipDeployment ? 'DeploymentPhase' : 'AttackPhase';
       const patch: Omit<Partial<GameState>, 'phase'> = {};
 
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Action "attack" is not allowed in phase "DeploymentPhase"

[Killed] ConditionalExpression
src/turns.ts:603:9
 
       const skipDeployment = state.params.modeQuickStart;
       const toPhase =
-        state.params.modeClassicDeployment && !skipDeployment ? 'DeploymentPhase' : 'AttackPhase';
+        false ? 'DeploymentPhase' : 'AttackPhase';
       const patch: Omit<Partial<GameState>, 'phase'> = {};
 
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Action "deploy" is not allowed in phase "AttackPhase"

[Killed] ConditionalExpression
src/turns.ts:606:11
         state.params.modeClassicDeployment && !skipDeployment ? 'DeploymentPhase' : 'AttackPhase';
       const patch: Omit<Partial<GameState>, 'phase'> = {};
 
-      if (skipDeployment) {
+      if (false) {
         patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
         patch.turnNumber = 1;
killedBy: quickStart starts in StartTurn phase then transitions to AttackPhase via system:init
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:606:11
         state.params.modeClassicDeployment && !skipDeployment ? 'DeploymentPhase' : 'AttackPhase';
       const patch: Omit<Partial<GameState>, 'phase'> = {};
 
-      if (skipDeployment) {
+      if (true) {
         patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
         patch.turnNumber = 1;
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/turns.ts:607:35
       const patch: Omit<Partial<GameState>, 'phase'> = {};
 
       if (skipDeployment) {
-        patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
+        patch.activePlayerIndex = state.params.initiative.attackFirst !== 'P1' ? 0 : 1;
         patch.turnNumber = 1;
       } else if (toPhase === 'DeploymentPhase') {
killedBy: Core Rules Verification (TASK-Coverage) Rule 10: Classic Aces proves an Ace can only be destroyed by another Ace (modeClassicAces: true)
statusReason: Not this player's turn

[Killed] ConditionalExpression
src/turns.ts:607:35
       const patch: Omit<Partial<GameState>, 'phase'> = {};
 
       if (skipDeployment) {
-        patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
+        patch.activePlayerIndex = false ? 0 : 1;
         patch.turnNumber = 1;
       } else if (toPhase === 'DeploymentPhase') {
killedBy: PHX-PASS-001: Pass Rule Enforcement increments pass counters when a player passes
statusReason: Not this player's turn

[Killed] EqualityOperator
src/turns.ts:609:18
       if (skipDeployment) {
         patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
         patch.turnNumber = 1;
-      } else if (toPhase === 'DeploymentPhase') {
+      } else if (toPhase !== 'DeploymentPhase') {
         patch.activePlayerIndex = state.params.initiative.deployFirst === 'P1' ? 0 : 1;
       }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:609:18
       if (skipDeployment) {
         patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
         patch.turnNumber = 1;
-      } else if (toPhase === 'DeploymentPhase') {
+      } else if (true) {
         patch.activePlayerIndex = state.params.initiative.deployFirst === 'P1' ? 0 : 1;
       }
killedBy: STATE_MACHINE implementation coverage exercises every declared transition in STATE_MACHINE
statusReason: Not this player's turn

[Killed] EqualityOperator
src/turns.ts:610:35
         patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
         patch.turnNumber = 1;
       } else if (toPhase === 'DeploymentPhase') {
-        patch.activePlayerIndex = state.params.initiative.deployFirst === 'P1' ? 0 : 1;
+        patch.activePlayerIndex = state.params.initiative.deployFirst !== 'P1' ? 0 : 1;
       }
 
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:610:35
         patch.activePlayerIndex = state.params.initiative.attackFirst === 'P1' ? 0 : 1;
         patch.turnNumber = 1;
       } else if (toPhase === 'DeploymentPhase') {
-        patch.activePlayerIndex = state.params.initiative.deployFirst === 'P1' ? 0 : 1;
+        patch.activePlayerIndex = true ? 0 : 1;
       }
 
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/turns.ts:620:38
   }
 
   const hashAfter = hashFn ? hashFn(gameStateForHash(resultState)) : '';
-  const entry: TransactionLogEntry = {
-    sequenceNumber: seqNum,
-    action,
-    stateHashBefore: hashBefore,
-    stateHashAfter: hashAfter,
-    timestamp,
-    details,
-    phaseTrace,
-    msgId: action.msgId ?? null,
-  };
+  const entry: TransactionLogEntry = {};
 
   return {
killedBy: PHX-EV-001: deriveEventsFromEntry AC #6: determinism produces byte-identical results for a real replay entry
statusReason: Cannot read properties of undefined (reading 'type')

[Survived] LogicalOperator
src/turns.ts:628:12
     timestamp,
     details,
     phaseTrace,
-    msgId: action.msgId ?? null,
+    msgId: action.msgId && null,
   };
 

[Killed] LogicalOperator
src/turns.ts:633:26
 
   return {
     ...resultState,
-    transactionLog: [...(state.transactionLog ?? []), entry],
+    transactionLog: [...(state.transactionLog && []), entry],
   };
 }
killedBy: PHX-EV-001: deriveEventsFromEntry AC #6: determinism produces byte-identical results for a real replay entry
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
src/turns.ts:657:7
 ): Action[] {
   const actions: Action[] = [];
   const player = state.players[playerIndex];
-  if (!player) return [];
+  if (false) return [];
 
   if (!isGameOver(state)) {
killedBy: Engine Coverage & Permutations getValidActions Gaps returns empty list for non-existent player
statusReason: expected [ { type: 'forfeit', …(2) } ] to deeply equal []

[Killed] BooleanLiteral
src/turns.ts:657:7
 ): Action[] {
   const actions: Action[] = [];
   const player = state.players[playerIndex];
-  if (!player) return [];
+  if (player) return [];
 
   if (!isGameOver(state)) {
killedBy: Engine Coverage & Permutations getValidActions Gaps returns empty list for non-existent player
statusReason: expected [ { type: 'forfeit', …(2) } ] to deeply equal []

[Killed] ConditionalExpression
src/turns.ts:659:7
   const player = state.players[playerIndex];
   if (!player) return [];
 
-  if (!isGameOver(state)) {
+  if (true) {
     actions.push({ type: 'forfeit', playerIndex, timestamp });
   }
killedBy: MCTS Strategy Depth handles game over state gracefully
statusReason: expected 'forfeit' to be 'pass' // Object.is equality

[Killed] BooleanLiteral
src/turns.ts:659:7
   const player = state.players[playerIndex];
   if (!player) return [];
 
-  if (!isGameOver(state)) {
+  if (isGameOver(state)) {
     actions.push({ type: 'forfeit', playerIndex, timestamp });
   }
killedBy: MCTS Strategy Depth handles game over state gracefully
statusReason: expected 'forfeit' to be 'pass' // Object.is equality

[Killed] StringLiteral
src/turns.ts:660:26
   if (!player) return [];
 
   if (!isGameOver(state)) {
-    actions.push({ type: 'forfeit', playerIndex, timestamp });
+    actions.push({ type: "", playerIndex, timestamp });
   }
 
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 1 tests
{ seed: -1007787556, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/turns.ts:663:7
     actions.push({ type: 'forfeit', playerIndex, timestamp });
   }
 
-  if (playerIndex !== state.activePlayerIndex) {
+  if (true) {
     return actions;
   }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:663:7
     actions.push({ type: 'forfeit', playerIndex, timestamp });
   }
 
-  if (playerIndex !== state.activePlayerIndex) {
+  if (false) {
     return actions;
   }
killedBy: Engine Coverage & Permutations getValidActions Gaps returns only forfeit for non-active player
statusReason: expected false to be true // Object.is equality

[NoCoverage] ConditionalExpression
src/turns.ts:671:5
   const rows = state.params.rows;
 
   switch (state.phase) {
-    case 'StartTurn':
-      // system:init is an internal action triggered by the server, not a valid player action.
-      break;
+    case 'StartTurn':
 
     case 'DeploymentPhase':

[Killed] ConditionalExpression
src/turns.ts:675:5
       // system:init is an internal action triggered by the server, not a valid player action.
       break;
 
-    case 'DeploymentPhase':
-      for (const card of player.hand) {
-        for (let col = 0; col < columns; col++) {
-          if (!isColumnFull(player.battlefield, col, rows, columns)) {
-            actions.push({ type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp });
-          }
-        }
-      }
-      break;
+    case 'DeploymentPhase':
 
     case 'AttackPhase':
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Action "pass" is not allowed in phase "DeploymentPhase"

[Killed] BlockStatement
src/turns.ts:676:39
       break;
 
     case 'DeploymentPhase':
-      for (const card of player.hand) {
-        for (let col = 0; col < columns; col++) {
-          if (!isColumnFull(player.battlefield, col, rows, columns)) {
-            actions.push({ type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp });
-          }
-        }
-      }
+      for (const card of player.hand) {}
       break;
 
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] BlockStatement
src/turns.ts:677:49
 
     case 'DeploymentPhase':
       for (const card of player.hand) {
-        for (let col = 0; col < columns; col++) {
-          if (!isColumnFull(player.battlefield, col, rows, columns)) {
-            actions.push({ type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp });
-          }
-        }
+        for (let col = 0; col < columns; col++) {}
       }
       break;
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] BlockStatement
src/turns.ts:678:70
     case 'DeploymentPhase':
       for (const card of player.hand) {
         for (let col = 0; col < columns; col++) {
-          if (!isColumnFull(player.battlefield, col, rows, columns)) {
-            actions.push({ type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp });
-          }
+          if (!isColumnFull(player.battlefield, col, rows, columns)) {}
         }
       }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: expected 'forfeit' to be 'deploy' // Object.is equality

[Killed] ConditionalExpression
src/turns.ts:678:15
     case 'DeploymentPhase':
       for (const card of player.hand) {
         for (let col = 0; col < columns; col++) {
-          if (!isColumnFull(player.battlefield, col, rows, columns)) {
+          if (true) {
             actions.push({ type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp });
           }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Column is full

[Killed] StringLiteral
src/turns.ts:679:34
       for (const card of player.hand) {
         for (let col = 0; col < columns; col++) {
           if (!isColumnFull(player.battlefield, col, rows, columns)) {
-            actions.push({ type: 'deploy', playerIndex, column: col, cardId: card.id, timestamp });
+            actions.push({ type: "", playerIndex, column: col, cardId: card.id, timestamp });
           }
         }
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Action "" is not allowed in phase "DeploymentPhase"

[Killed] ConditionalExpression
src/turns.ts:685:5
       }
       break;
 
-    case 'AttackPhase':
-      actions.push({ type: 'pass', playerIndex, timestamp });
-      for (let col = 0; col < columns; col++) {
-        if (player.battlefield[col]) {
-          actions.push({
-            type: 'attack',
-            playerIndex,
-            attackingColumn: col,
-            defendingColumn: col,
-            timestamp,
-          });
-        }
-      }
-      break;
+    case 'AttackPhase':
 
     case 'ReinforcementPhase':
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'forfeit' to be 'attack' // Object.is equality

[Killed] StringLiteral
src/turns.ts:686:28
       break;
 
     case 'AttackPhase':
-      actions.push({ type: 'pass', playerIndex, timestamp });
+      actions.push({ type: "", playerIndex, timestamp });
       for (let col = 0; col < columns; col++) {
         if (player.battlefield[col]) {
killedBy: Bot Adversarial Paths The "Sneaky" path handles MCTS with extremely high exploration param
statusReason: Action "" is not allowed in phase "AttackPhase"

[Killed] EqualityOperator
src/turns.ts:687:25
 
     case 'AttackPhase':
       actions.push({ type: 'pass', playerIndex, timestamp });
-      for (let col = 0; col < columns; col++) {
+      for (let col = 0; col <= columns; col++) {
         if (player.battlefield[col]) {
           actions.push({
killedBy: computeBotAction - mcts strategy returns a deploy action during DeploymentPhase
statusReason: Only front-row cards can attack

[Killed] BlockStatement
src/turns.ts:687:47
 
     case 'AttackPhase':
       actions.push({ type: 'pass', playerIndex, timestamp });
-      for (let col = 0; col < columns; col++) {
-        if (player.battlefield[col]) {
-          actions.push({
-            type: 'attack',
-            playerIndex,
-            attackingColumn: col,
-            defendingColumn: col,
-            timestamp,
-          });
-        }
-      }
+      for (let col = 0; col < columns; col++) {}
       break;
 
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Killed] BlockStatement
src/turns.ts:688:38
     case 'AttackPhase':
       actions.push({ type: 'pass', playerIndex, timestamp });
       for (let col = 0; col < columns; col++) {
-        if (player.battlefield[col]) {
-          actions.push({
-            type: 'attack',
-            playerIndex,
-            attackingColumn: col,
-            defendingColumn: col,
-            timestamp,
-          });
-        }
+        if (player.battlefield[col]) {}
       }
       break;
killedBy: Bot Adversarial Paths The "Desire" path prefers winning immediately over anything else
statusReason: expected 'pass' to be 'attack' // Object.is equality

[Survived] ConditionalExpression
src/turns.ts:700:5
       }
       break;
 
-    case 'ReinforcementPhase':
-      if (state.reinforcement && state.reinforcement.attackerIndex !== playerIndex) {
-        for (const card of player.hand) {
-          actions.push({ type: 'reinforce', playerIndex, cardId: card.id, timestamp });
-        }
-        actions.push({ type: 'pass', playerIndex, timestamp });
-      }
-      break;
+    case 'ReinforcementPhase':
 
     default:

[Survived] BlockStatement
src/turns.ts:701:85
       break;
 
     case 'ReinforcementPhase':
-      if (state.reinforcement && state.reinforcement.attackerIndex !== playerIndex) {
-        for (const card of player.hand) {
-          actions.push({ type: 'reinforce', playerIndex, cardId: card.id, timestamp });
-        }
-        actions.push({ type: 'pass', playerIndex, timestamp });
-      }
+      if (state.reinforcement && state.reinforcement.attackerIndex !== playerIndex) {}
       break;
 

[Survived] LogicalOperator
src/turns.ts:701:11
       break;
 
     case 'ReinforcementPhase':
-      if (state.reinforcement && state.reinforcement.attackerIndex !== playerIndex) {
+      if (state.reinforcement || state.reinforcement.attackerIndex !== playerIndex) {
         for (const card of player.hand) {
           actions.push({ type: 'reinforce', playerIndex, cardId: card.id, timestamp });

[Survived] BlockStatement
src/turns.ts:702:41
 
     case 'ReinforcementPhase':
       if (state.reinforcement && state.reinforcement.attackerIndex !== playerIndex) {
-        for (const card of player.hand) {
-          actions.push({ type: 'reinforce', playerIndex, cardId: card.id, timestamp });
-        }
+        for (const card of player.hand) {}
         actions.push({ type: 'pass', playerIndex, timestamp });
       }

[Killed] ObjectLiteral
src/turns.ts:703:24
     case 'ReinforcementPhase':
       if (state.reinforcement && state.reinforcement.attackerIndex !== playerIndex) {
         for (const card of player.hand) {
-          actions.push({ type: 'reinforce', playerIndex, cardId: card.id, timestamp });
+          actions.push({});
         }
         actions.push({ type: 'pass', playerIndex, timestamp });
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 8 tests
{ seed: 193845340, path: "7:9:3:6:1:1:1", endOnFailure: true }
Counterexample: [-2014340196]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/turns.ts:705:22
         for (const card of player.hand) {
           actions.push({ type: 'reinforce', playerIndex, cardId: card.id, timestamp });
         }
-        actions.push({ type: 'pass', playerIndex, timestamp });
+        actions.push({});
       }
       break;
killedBy: Property-based testing with fast-check any valid action should preserve invariants
statusReason: Property failed after 19 tests
{ seed: 624653856, path: "18:8", endOnFailure: true }
Counterexample: [2065021481]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/turns.ts:709:5
       }
       break;
 
-    default:
-      break;
+    default:
   }
 
